{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620302109",
    "title": "A comprehensive review on deep learning-based methods for video anomaly detection",
    "abstract": "Video surveillance systems  are popular and used in public places such as market places, shopping malls, hospitals, banks, streets, education institutions, city administrative offices, and smart cities to enhance the safety of public lives and assets. Most of the time, the timely and accurate detection of video anomalies is the main objective of security applications. The video anomalies such as anomalous activities and anomalous entities are defined as the abnormal or irregular patterns present in the video that do not conform to the normal trained patterns. Anomalous activities such as fighting, riots, traffic rule violations, and stampede as well as anomalous entities such as weapons at the sensitive place and abandoned luggage should be detected automatically in time. However, the detection of video anomalies is challenging due to the ambiguous nature of the anomaly, various environmental conditions, the complex nature of human behaviors, and the lack of proper datasets. There are only a few dedicated surveys related to deep learning-based video  anomaly detection  as the research domain is in its early stages. However, state of the art lacks a review that provides a comprehensive study covering all the aspects such as definitions, classifications, modelings, performance evaluation methodologies, open and trending research challenges of video anomaly detection. Hence, in this survey, we present a comprehensive study of the deep learning-based methods reported in state of the art to detect the video anomalies. Further, we discuss the comparative analysis of the state of the art methods in terms of datasets, computational infrastructure, and performance metrics for both quantitative and qualitative analyses. Finally, we outline the challenges and promising directions for further research.",
    "citation_count": "207",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Rashmiranjan Nayak",
            "country": ""
        },
        {
            "name": "Umesh Chandra Pati",
            "country": ""
        },
        {
            "name": "Santos Kumar Das",
            "country": ""
        }
    ],
    "keywords": []
}