{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885618301501",
    "title": "A deep generic to specific recognition model for group membership analysis using non-verbal cues",
    "abstract": "Automatic understanding and analysis of groups has attracted increasing attention in the vision and multimedia communities in recent years. However, little attention has been paid to the  automatic analysis  of the non-verbal behaviors and how this can be utilized for analysis of group membership, i.e., recognizing which group each individual is part of. This paper presents a novel  Support Vector Machine  (SVM) based Deep  Specific Recognition Model (DeepSRM)  that is learned based on a  generic recognition model . The  generic recognition model  refers to the model trained with data across different conditions, i.e., when people are watching movies of different types. Although the  generic recognition model  can provide a baseline for the recognition model trained for each specific condition, the different behaviors people exhibit in different conditions limit the recognition performance of the generic model. Therefore, the  specific recognition model  is proposed for each condition separately and built on top of the  generic recognition model . A number of experiments are conducted using a database aiming to study group analysis while each group (i.e., four participants together) were watching a number of long movie segments. Our experimental results show that the proposed  deep specific recognition model  (44%) outperforms the  generic recognition model  (26%). The recognition of group membership also indicates that the non-verbal behaviors of individuals within a group share commonalities.",
    "citation_count": "3",
    "year": "2019/01/01",
    "authors": [
        {
            "name": "Wenxuan Mou",
            "country": ""
        },
        {
            "name": "Christos Tzelepis",
            "country": ""
        },
        {
            "name": "Vasileios Mezaris",
            "country": ""
        },
        {
            "name": "Hatice Gunes",
            "country": ""
        },
        {
            "name": "Ioannis Patras",
            "country": ""
        }
    ],
    "keywords": []
}