{
    "url": "https://www.sciencedirect.com/science/article/pii/S026288562400386X",
    "title": "A dictionary learning based unsupervised neural network for single image compressed sensing",
    "abstract": "In the field of Compressed Sensing (CS), the sparse representation of signals and the advancement of reconstruction algorithms are two critical challenges. However, conventional CS algorithms often fail to sufficiently exploit the structured sparsity present in images and suffer from poor reconstruction quality. Most deep learning-based CS methods are typically trained on large-scale datasets. Obtaining a sufficient number of training sets is challenging in many practical applications and there may be no training sets available at all in some cases. In this paper, a novel deep Dictionary Learning (DL) based unsupervised neural network for single image CS (dubbed DL-CSNet) is proposed. It is an effective trainless neural network that consists of three components and their corresponding loss functions: 1) a DL layer that consists of multi-layer perceptron (MLP) and convolution neural networks (CNN) for latent sparse features extraction with the L1-norm sparsity loss function; 2) an image smoothing layer with the Total Variation (TV) like image smoothing loss function; and 3) a CS acquisition layer for image compression, with the Mean Square Error (MSE) loss function between the original image compression and the reconstructed image compression. In particular, the proposed DL-CSNet is a lightweight and fast model that does not require datasets for training and exhibits a fast convergence speed, making it suitable for deployment in resource-constrained environments. Experiments have demonstrated that the proposed DL-CSNet achieves superior performance compared to traditional CS methods and other unsupervised state-of-the-art deep learning-based CS methods.",
    "citation_count": "0",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Kuang Luo",
            "country": ""
        },
        {
            "name": "Lu Ou",
            "country": ""
        },
        {
            "name": "Ming Zhang",
            "country": ""
        },
        {
            "name": "Shaolin Liao",
            "country": ""
        },
        {
            "name": "Chuangfeng Zhang",
            "country": ""
        }
    ],
    "keywords": []
}