{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621001505",
    "title": "A new perceptual hashing method for verification and identity classification of occluded faces",
    "abstract": "Recently, research communities on  Computer Vision  and  biometrics  have shown a lot of interest in  face verification  and classification methods. Fighting against Child Sexual Exploitation Material (CSEM) is one of the applications that might benefit most from these advances. In CSEM, discriminative parts of the face, i.e. mostly the eyes, are often occluded to make the victim identification more difficult. Most of the current  face recognition methods  are not able to handle such kind of occlusions. To overcome this problem, we present One-Shot Frequency Dominant Neighborhood Structure (OSF-DNS), a new perceptual  hashing method  that shows advantages on two scenarios: (a) occluded face verification, i.e., matching occluded faces with their non-occluded versions, and (b) face classification, i.e., getting the identity of an occluded face by means of a classifier trained with the non-occluded faces using the perceptual hash codes as feature vectors. We have compared the face verification performance of OSF-DNS with three perceptual hashing methods and with the features obtained from five  deep learning  techniques, using the occluded versions of six different facial datasets. The proposed method achieves accuracies between 69.24% and 99.46% depending on the dataset, and always higher than the compared methods. For the face  classification task , we compared the performance of OSF-DNS with the features obtained by four  deep learning techniques . Experimental results on LFW and CFPW datasets showed that the proposed hashing method outperformed the results obtained with deep features with an accuracy up to 89.53%.",
    "citation_count": "20",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Rubel Biswas",
            "country": ""
        },
        {
            "name": "Víctor González-Castro",
            "country": ""
        },
        {
            "name": "Eduardo Fidalgo",
            "country": ""
        },
        {
            "name": "Enrique Alegre",
            "country": ""
        }
    ],
    "keywords": []
}