{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624002889",
    "title": "A novel facial expression recognition model based on harnessing complementary features in multi-scale network with attention fusion",
    "abstract": "This paper presents a novel method for  facial expression recognition  using the proposed feature complementation and multi-scale attention model with attention fusion (FCMSA-AF). The proposed model consists of four main components: the shallow feature extractor module, parallel structured two-branch multi-scale attention module (MSA), feature complementing module (FCM), and attention fusion and classification module. The MSA module contains multi-scale attention modules in a cascaded fashion in two paths to learn diverse features. The upper and lower paths use left and right multi-scale blocks to extract and aggregate the features at different receptive fields. The  attention networks  in MSA focus on salient local regions to extract features at  granular levels . The FCM uses the correlation between the feature maps in two paths to make the multi-scale attention features complementary to each other. Finally, the complementary features are fused through an attention network to form an informative holistic feature which includes subtle, visually varying regions in similar classes. Hence, complementary and informative features are used in classification to minimize information loss and capture the discriminating finer aspects of facial expression recognition. Experimental evaluation of the proposed model carried out on AffectNet and CK   + datasets achieve accuracies of 64.59% and 98.98%, respectively, outperforming some of the state-of-the-art methods.",
    "citation_count": "0",
    "year": "2024/09/01",
    "authors": [
        {
            "name": "Chakrapani Ghadai",
            "country": ""
        },
        {
            "name": "Dipti Patra",
            "country": ""
        },
        {
            "name": "Manish Okade",
            "country": ""
        }
    ],
    "keywords": []
}