{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885625000708",
    "title": "Adaptive scale matching for remote sensing object detection based on aerial images",
    "abstract": "Remote sensing object detection based on aerial images presents challenges due to their complex backgrounds, and the utilization of specific a contextual information can enhance detection accuracy. Inadequate long-range background information may lead to erroneous detection of small remotely sensed objects, with variations in background complexity observed across different object types. In this paper, we propose a new  YOLO -based real-time object detector. The detector aims to  S cale- M atch the proportions of various objects in remote sensing images using the model named  YOLO-SM . Specifically, this paper proposes a straightforward yet highly efficient building block that dynamically adjusts the necessary receptive field for each object, minimizing the loss of feature information caused by consecutive convolutions. Additionally, a supplementary bottom-up pathway is incorporated to improve the representation of smaller objects. Empirical evaluations conducted on DOTA-v1.0, DOTA-v1.5, DIOR-R, and HRSC2016 datasets confirm the efficacy of the proposed methodology. On DOTA-v1.0, compared to RTMDet-R-L, YOLO-SM-S achieved competitive accuracy while significantly reducing parameters by 74.8% and FLOPs by 78.5%. Compared to LSKNet on HRSC2016, YOLO-SM-Tiny dramatically reduces 76% of parameters and 90% of FLOPs and improves FPS by about three times while maintaining stable accuracy.",
    "citation_count": "0",
    "year": "2025/05/01",
    "authors": [
        {
            "name": "Lu Han",
            "country": ""
        },
        {
            "name": "Nan Li",
            "country": ""
        },
        {
            "name": "Zeyuan Zhong",
            "country": ""
        },
        {
            "name": "Dong Niu",
            "country": ""
        },
        {
            "name": "Bingbing Gao",
            "country": ""
        }
    ],
    "keywords": []
}