{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885625000204",
    "title": "Advancing brain tumor segmentation and grading through integration of FusionNet and IBCO-based ALCResNet",
    "abstract": "Brain tumors represent a significant global health challenge, characterized by uncontrolled cerebral cell growth. The variability in size, shape, and anatomical positioning complicates computational classification, which is crucial for effective treatment planning. Accurate detection is essential, as even small diagnostic inaccuracies can significantly increase the mortality risk. Tumor grade stratification is also critical for automated diagnosis; however, current deep learning models often fall short in achieving the desired effectiveness. In this study, we propose an advanced approach that leverages cutting-edge deep learning techniques to improve early detection and tumor severity grading, facilitating automated diagnosis. Clinical bioinformatics datasets are used to source representative brain tumor images, which undergo pre-processing and data augmentation via a Generative Adversarial Network (GAN). The images are then classified using the Adaptive Layer Cascaded ResNet (ALCResNet) model, optimized with the Improved Border Collie Optimization (IBCO) algorithm for enhanced diagnostic accuracy. The integration of FusionNet for precise segmentation and the IBCO-enhanced ALCResNet for optimized feature extraction and classification forms a novel framework. This unique combination ensures not only accurate segmentation but also enhanced precision in grading tumor severity, addressing key limitations of existing methodologies. For segmentation, the FusionNet deep learning model is employed to identify abnormal regions, which are subsequently classified as Meningioma, Glioma, or Pituitary tumors using ALCResNet. Experimental results demonstrate significant improvements in tumor identification and severity grading, with the proposed method achieving superior precision (99.79%) and accuracy (99.33%) compared to existing classifiers and heuristic approaches.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Abbas Rehman",
            "country": ""
        },
        {
            "name": "Gu Naijie",
            "country": ""
        },
        {
            "name": "Asma Aldrees",
            "country": ""
        },
        {
            "name": "Muhammad Umer",
            "country": ""
        },
        {
            "name": "Abeer Hakeem",
            "country": ""
        },
        {
            "name": "Shtwai Alsubai",
            "country": ""
        },
        {
            "name": "Lucia Cascone",
            "country": ""
        }
    ],
    "keywords": []
}