{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619304172",
    "title": "An integrated ship segmentation method based on discriminator and extractor",
    "abstract": "Ship segmentation is an important task in  maritime surveillance  systems. A great deal of research on image segmentation has been done in the past few years, but there appears to be some problems when directly utilizing them for ship segmentation under complex maritime background. The interference factors decreasing segmentation performance usually are from the peculiarity of complex maritime background, such as the existence of sea fog, large wakes and large waves. To deal with these interference factors, this paper presents an integrated ship segmentation method based on  discriminator  and extractor (ISDE). Different from traditional  segmentation methods , our method consists of two components in light of the structure: Interference Factor Discriminator (IFD) and Ship Extractor (SE). SqueezeNet is employed for the implementation of IFD as the first step to make a  judgment  on what interference factors are contained in the input image. While DeepLabv3   + and improved DeepLabv3   + are employed for the implementation of SE as the second step to finally extract ships. We collect a ship segmentation dataset and conduct intensive experiments on it. The experimental results demonstrate that our method for ship segmentation outperforms state-of-the-art methods in terms of segmentation accuracy, especially for the images contain sea fog. Besides our method can run in real time as well.",
    "citation_count": "30",
    "year": "2020/01/01",
    "authors": [
        {
            "name": "Wen Zhang",
            "country": ""
        },
        {
            "name": "Xujie He",
            "country": ""
        },
        {
            "name": "Wanyi Li",
            "country": ""
        },
        {
            "name": "Zhi Zhang",
            "country": ""
        },
        {
            "name": "Yongkang Luo",
            "country": ""
        },
        {
            "name": "Li Su",
            "country": ""
        },
        {
            "name": "Peng Wang",
            "country": ""
        }
    ],
    "keywords": []
}