{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885604000678",
    "title": "An intelligent character recognizer for Telugu scripts using multiresolution analysis and associative memory",
    "abstract": "The present work is an attempt to develop a robust character recognizer for Telugu texts. We aim at designing a recognizer, which exploits the inherent characteristics of the Telugu Script. Our proposed method uses wavelet multi-resolution analysis for the purpose extracting features and  associative memory  model to accomplish the recognition tasks. Our system learns the style and font from the document itself and then it recognizes the remaining characters in the document. The major contribution of the present study can be outlined as follows. It is a robust  OCR  system for Telugu printed text. It avoids feature extraction process and it exploits the inherent characteristics of the Telugu character by a clever selection of Wavelet Basis function, which extracts the invariant features of the characters. It has a Hopfield-based Dynamic  Neural Network  for the purpose of learning and recognition. This is important because it overcomes the inherent difficulties of memory limitation and spurious states in the  Hopfield Network . The DNN has been demonstrated to be efficient for  associative memory  recall. However, though it is normally not suitable for  image processing  application, the multi-resolution analysis reduces the sizes of the images to make the DNN applicable to the present domain. Our experimental results show extremely promising results.",
    "citation_count": "30",
    "year": "2004/12/01",
    "authors": [
        {
            "name": "Arun K. Pujari",
            "country": ""
        },
        {
            "name": "C. Dhanunjaya Naidu",
            "country": ""
        },
        {
            "name": "M. Sreenivasa Rao",
            "country": ""
        },
        {
            "name": "B.C. Jinaga",
            "country": ""
        }
    ],
    "keywords": []
}