{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620301074",
    "title": "Application of the best evacuation model of deep learning in the design of public structures",
    "abstract": "Evacuation behavior is an important factor which must be considered in the design of public structures. With the continuous complexity of structure, more and more factors should be considered in evacuation. The traditional design based on experience may have some limitations in practice. Based on the  deep neural network  model, the evacuation design simulation for  subway station  buildings is implemented. VR video tracking technologies such as auxiliary  image data  pre-training algorithm, tracking sequence pre-training algorithm, and recursive neural network model based on You Only Look Once (YOLO) are introduced. Compared with the  convolutional neural network  (CNN) model, the classified data set pre-training model, and YOLO algorithm, the accuracy and training speed of the model algorithm are verified. In simulation, the Zhujiang New Town Station in Guangzhou is taken as the object. The initial evacuation test point is selected according to the structure of the  subway  platform, and the test personnel are selected according to the test requirements. The average evacuation time and the average satisfaction score of the testers under the influence factors such as gender, age, subway frequency, and familiarity with VR equipment, as well as under the  initial starting points  of different evacuation tests. The results show that the accuracy of the algorithm is lower than that of the CNN, but the training speed is faster. The accuracy of the model based on YOLO  recurrent neural network  is the highest. Although the training speed is 19 ms, which is higher than other models, the overall performance is the best. Differences in factors such as gender, age, frequency of subway ride, and familiarity with VR devices will result in different differences in average evacuation time and average satisfaction score. When the platform center is used as the initial evacuation point, the average evacuation time is the shortest, and the average satisfaction score of the testers is the highest. In conclusion, through VR video tracking technology, the actual situation of subway station buildings can be well simulated, and further design schemes can be made according to the simulated situation, which has practical reference significance.",
    "citation_count": "140",
    "year": "2020/10/01",
    "authors": [
        {
            "name": "Yan Chen",
            "country": ""
        },
        {
            "name": "Shenjian Hu",
            "country": ""
        },
        {
            "name": "He Mao",
            "country": ""
        },
        {
            "name": "Wei Deng",
            "country": ""
        },
        {
            "name": "Xin Gao",
            "country": ""
        }
    ],
    "keywords": []
}