{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300202",
    "title": "Attention-guided RGBD saliency detection using appearance information",
    "abstract": "Most of the deep  convolutional neural networks  (CNNs) based RGBD saliency models either regard the RGB and depth cues as the same status or trust the depth information excessively. However, they ignore that the low-quality depth map is an interference factor and the multi-level deep features that originated from  RGB images  contain abundant appearance information. Therefore, we propose a novel RGBD saliency model, where the attention-guided bottom-up and top-down modules are powerfully combined by using multi-level deep RGB features, to utilize the deep RGB and depth features in a sufficient and appropriate way. Concretely, a two-stream structure based bottom-up module is first constructed to dig and fuse the RGB and depth information, yielding the fused deep feature. Besides, the module embeds the depth cue based attention maps to guide the indication of salient objects. Then, considering the abundant appearance information, a top-down module is deployed to perform coarse-to-fine saliency inference, where the fused deep feature is progressively integrated with appearance information. Similarly, the attention map is also inserted into this module for locating salient objects. Extensive experiments are performed on five public RGBD datasets and the corresponding experimental results firmly demonstrate the effectiveness and superiority of our model when compared with the state-of-the-art RGBD saliency models.",
    "citation_count": "34",
    "year": "2020/03/01",
    "authors": [
        {
            "name": "Xiaofei Zhou",
            "country": ""
        },
        {
            "name": "Gongyang Li",
            "country": ""
        },
        {
            "name": "Chen Gong",
            "country": ""
        },
        {
            "name": "Zhi Liu",
            "country": ""
        },
        {
            "name": "Jiyong Zhang",
            "country": ""
        }
    ],
    "keywords": []
}