{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624001422",
    "title": "Attribute discrimination combined with selected sample dropout for unsupervised domain adaptive person re-identification",
    "abstract": "The popular clustering-based Unsupervised Domain Adaptive (UDA) person re-identification (re-ID) does not require additional annotation. However, owing to unsatisfactory feature embedding and imperfect clustering, most existing clustering-based methods suffer from the noise of pseudo labels in the target domain, which will lead to a serious  performance degradation . To reduce the  negative impact  of noisy pseudo labels on training, we put forward an approach named selected sample dropout (SSD) in the training stage, which defines a criterion for evaluating the  noise level  of pseudo labels. SSD would mine and discard samples with noisy pseudo labels before training, and then all the remaining samples are fed into the network to train. On top of a strong baseline, SSD is proved to be effective. We call the baseline of adding SSD as the selected sample dropout-enhanced teacher-student network (SSD-TSNet). In addition, considering the robustness of pedestrian gender, we use it as  auxiliary information  in the SSD-TSNet test stage. Specifically, we propose a pedestrian gender attribute  discriminator  (GAD) to predict gender labels. Based on predictive gender labels, SSD-TSNet could retrieve one person among other persons with the same gender as the person, thus narrowing the  search space  of re-ID. The proposed SSD-TSNet and GAD are integrated into one framework, and extensive experiments on four widely used UDA benchmark protocols demonstrate its competitive performance. Specifically, our method outperforms the baseline by 11.6%  mAP  on the Duke-to-Market task, while surpassing the state-of-the-art method by 0.5% mAP on the Market-to-Duke task.",
    "citation_count": "2",
    "year": "2024/06/01",
    "authors": [
        {
            "name": "Chang Liu",
            "country": ""
        },
        {
            "name": "Haoqi Li",
            "country": ""
        },
        {
            "name": "Xuan He",
            "country": ""
        },
        {
            "name": "Guanzhong Yang",
            "country": ""
        },
        {
            "name": "Zhiyong Li",
            "country": ""
        }
    ],
    "keywords": []
}