{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885622001743",
    "title": "Bald eagle search optimization with deep transfer learning enabled age-invariant face recognition model",
    "abstract": "Facial aging variation is a challenging process in the design of  face recognition  system because of high intra-personal differences instigated by age progression. Age-invariant face recognition (AIFR) models find applicability in several  real time applications  such as criminal identification, missing person detection, and so on. The main issue is the high intra-personal disparities because of complicated and non-linear age progression process. An essential component of face recognition model is the extraction of important features from the  facial images  for reducing intrapersonal differences produced by illumination, expression, pose, age, etc. The recent advances of  machine learning  (ML) and  deep learning  (DL) models pave a way for effective design of AIFR models. In this view, this study presents a new Bald Eagle Search Optimization with  Deep Transfer Learning  Enabled AFIR (BESDTL-AIFR) model. The presented BESDTL-AIFR model primarily pre-processes the facial images to enhance the quality. Besides, the BESDTL-AIFR model utilizes  Inception v3  model for learning high level deep features. Next, these features are passed into the optimal  deep belief network  (DBN) model for face recognition. Finally, the hyperparameters of the DBN model are optimally chosen by the use of BES algorithm. Experimentation analysis on challenging benchmark datasets pointed out the promising outcomes of the BESDTL-AIFR model compared to recent approaches.",
    "citation_count": "24",
    "year": "2022/10/01",
    "authors": [
        {
            "name": "Shtwai Alsubai",
            "country": ""
        },
        {
            "name": "Monia Hamdi",
            "country": ""
        },
        {
            "name": "Sayed Abdel-Khalek",
            "country": ""
        },
        {
            "name": "Abdullah Alqahtani",
            "country": ""
        },
        {
            "name": "Adel Binbusayyis",
            "country": ""
        },
        {
            "name": "Romany F. Mansour",
            "country": ""
        }
    ],
    "keywords": []
}