{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002639",
    "title": "Camera-aware re-identification feature for multi-target multi-camera tracking",
    "abstract": "Multi-target multi-camera tracking is an important  research topic  in intelligent surveillance to achieve re-identification (Re-ID) of moving targets across different cameras. However, Re-ID faces significant challenges owing to variations in cameras/viewpoints, making it difficult to learn  discriminative feature  representations for targets captured from different cameras/viewpoints. A new pipeline is introduced by balancing the across-cameras sample  feature space  in camera-aware Re-ID framework. Specifically, different sampling strategies play a crucial role on the performance under the same baseline and identify the feature discrepancy between cameras/viewpoints as a crucial factor. This proposed sampling strategy is called camera equalization sampling to learn enhanced feature disparities, which balances cameras under identity rather than randomly sampling in a batch. The sampled images are combined with non visual cues(cameras position encoding) to reduce intra  class variance . For the mechanism of camera equalization sampling, the improved camera centric loss function can better reduce the  negative impact  of individual samples and provide stable learnable features.Our proposed method consists of three modules. (i) Camera equalization (CE) ensures that each batch collects at least one image from each camera for every identity, thereby enabling robust features. (ii) Camera position embedding (CPE) mitigates the scene bias caused by different cameras/viewpoints by encoding camera indices. (iii) Camera Center triplet loss(CCL) based on CE improves higher robustness to outliers and noisy labels. We demonstrated the proposed method's effectiveness on popular datasets such as DukeMTMC-reID, Market-1501, and MSMT17, achieving state-of-the-art performance.",
    "citation_count": "2",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Jinlong Zhu",
            "country": ""
        },
        {
            "name": "Qingliang Li",
            "country": ""
        },
        {
            "name": "Changbo Gao",
            "country": ""
        },
        {
            "name": "Yu Ge",
            "country": ""
        },
        {
            "name": "Ke Xu",
            "country": ""
        }
    ],
    "keywords": []
}