{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885605001538",
    "title": "Connectivity-based local adaptive thresholding for carotid artery segmentation using MRA images",
    "abstract": "The computer algorithms for the delineation of anatomical structures and other regions of interest on the medical imagery are important component in assisting and automating specific radiological tasks. In addition, the segmentation of region is an important first step for variety image  related application  and visualization tasks. In this paper, we propose a fast and automated connectivity-based  local adaptive thresholding  (CLAT) algorithm to segment the carotid artery in sequence medical imagery. This algorithm provides the new feature that is the circumscribed quadrangle on the segmented carotid artery for region-of-interest (ROI) determination. By using the preserved connectivity between consecutive slice images, the size of the ROI is adjusted like a moving window according to the segmentation result of previous slice image. The histogram is prepared for each ROI and then smoothed by local averaging for the threshold selection. The threshold value for carotid artery segmentation is locally selected on each slice image and is adaptively determined through the sequence image. In terms of automated features and computing time, this algorithm is more effective than region growing and  deformable model  approaches. This algorithm is also applicable to segment the cylinder shape structures and tree-like blood vessels such as renal artery and coronary artery in the medical imagery. Experiments have been conducted on synthesized images, phantom and  clinical data  sets with various  Gaussian noise .",
    "citation_count": "38",
    "year": "2005/12/12",
    "authors": [
        {
            "name": "Do Yeon Kim",
            "country": ""
        },
        {
            "name": "Jong Won Park",
            "country": ""
        }
    ],
    "keywords": []
}