{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003329",
    "title": "Coplane-constrained sparse depth sampling and local depth propagation for depth estimation",
    "abstract": "Depth estimation with sparse reference has emerged recently, and predicts depth map from a monocular image and a set of depth reference samples. Previous works randomly select reference samples by sensors, leading to severe depth bias as this sampling is independent to image semantic and neglects the unbalance of depth distribution in regions. This paper proposes a Coplane-Constrained sparse Depth (CCD) sampling to explore representative reference samples, and design a Local Depth Propagation (LDP) network for complete the sparse point cloud map. This can capture diverse depth information and diffuse the valid points to neighbors with geometry prior. Specifically, we first construct the surface normal map and detect coplane pixels by superpixel segmenting for sampling references, whose depth can be represented by that of superpixel centroid. Then, we introduce local depth propagation to obtain coarse-level depth map with geometric information, which dynamically diffuses the depth from the reference to neighbors based on local planar assumption. Further, we generate the fine-level depth map by devising a pixel-wise focal loss, which imposes the semantic and geometry calibration on pixels with low confidence in coarse-level prediction. Extensive experiments on public datasets demonstrate that our model outperforms SOTA depth estimation and completion methods.",
    "citation_count": "0",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Jiehua Zhang",
            "country": ""
        },
        {
            "name": "Zhiwen Yang",
            "country": ""
        },
        {
            "name": "Chuqiao Chen",
            "country": ""
        },
        {
            "name": "Hongkui Wang",
            "country": ""
        },
        {
            "name": "Tingyu Wang",
            "country": ""
        },
        {
            "name": "Chenggang Yan",
            "country": ""
        },
        {
            "name": "Yihong Gong",
            "country": ""
        }
    ],
    "keywords": []
}