{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300597",
    "title": "Cross-resolution learning for Face Recognition",
    "abstract": "Convolutional Neural Network  models have reached extremely high performance on the  Face Recognition  task. Mostly used datasets, such as VGGFace2, focus on gender, pose, and age variations, in the attempt of balancing them to empower models to better generalize to unseen data. Nevertheless, image resolution variability is not usually discussed, which may lead to a resizing of 256 pixels. While specific datasets for very low-resolution faces have been proposed, less attention has been paid on the task of cross-resolution matching. Hence, the discrimination power of a  neural network  might seriously degrade in such a scenario. Surveillance systems and  forensic applications  are particularly susceptible to this problem since, in these cases, it is common that a low-resolution query has to be matched against higher-resolution galleries. Although it is always possible to either increase the resolution of the query image or to reduce the size of the gallery (less frequently), to the best of our knowledge, extensive experimentation of cross-resolution matching was missing in the recent deep learning-based literature. In the context of low- and cross-resolution Face Recognition, the contribution of our work is fourfold: i) we proposed a training procedure to fine-tune a state-of-the-art model to empower it to extract resolution-robust deep features; ii) we conducted an extensive test campaign by using high-resolution datasets (IJB-B and IJB-C) and surveillance-camera-quality datasets (QMUL-SurvFace, TinyFace, and SCface) showing the effectiveness of our algorithm to train a resolution-robust model; iii) even though our main focus was the cross-resolution Face Recognition, by using our  training algorithm  we also improved upon state-of-the-art model performances considering low-resolution matches; iv) we showed that our approach could be more effective concerning preprocessing faces with super-resolution techniques. The  python code  of the proposed method will be available at  https://github.com/fvmassoli/cross-resolution-face-recognition .",
    "citation_count": "65",
    "year": "2020/07/01",
    "authors": [
        {
            "name": "Fabio Valerio Massoli",
            "country": ""
        },
        {
            "name": "Giuseppe Amato",
            "country": ""
        },
        {
            "name": "Fabrizio Falchi",
            "country": ""
        }
    ],
    "keywords": []
}