{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624001483",
    "title": "Deep learning with adaptive convolutions for classification of retinal diseases via optical coherence tomography",
    "abstract": "Optical coherence  tomography  (OCT) uses  interferometry  to capture high-resolution cross-sectional images of the retina to diagnose  retinal diseases . Convolutional  neural networks  (CNNs) have become essential for developing efficient computer-aided  diagnostic algorithms , but  noisy images  can hinder their performance. This study introduces an innovative image preprocessing strategy that involves a new method of representing images to reduce  image noise  and a new adaptive convolution layer. The adaptive convolution layer aims to replace traditional convolution layers for OCT  image classification  by relying on local’Feature Content’. The proposed image representation is based on Zeckendorf's theorem, which states that every  positive integer  may be split into a unique sum of distinct, non-adjacent Fibonacci numbers. The proposed approach enables the generation of two separate images, known as the ‘base’ and ‘fine,’ where the ‘base’ image is the  denoised image . We assessed our methodology by evaluating against ten filters, comprising a Low-pass filter,  Gaussian  filter, Wiener filter, Wavelet filter, Guided filter, Lee filter, Frost filter, Kuan filter, Detail Preserving Anisotropic Diffusion (DPAD) filter, and Non-Local Means (NLM) filter. In our study, we found that the proposed filter produced the most favorable results in five of the six no-reference parameters (Blur Percent (BP), Blind/Referenceless Image  Spatial Quality   Evaluator  (BRISQUE), Naturalness  Image Quality  Evaluator (NIQE), Wavelet Variance (WAVV), Wavelet Variance Radial (WAVR)) used to assess the effectiveness of the proposed image enhancement technique. The OCT dataset utilized in the study was compiled by the University of California San Diego. The proposed adaptive convolution layer and its accompanying  activation function  were tested using seven OCT  image classification   CNN architectures . The test architectures comprise OctNET, NT-CNN, AOCT-NET, M-CNN, LightOCT, RetiNet, and DeepOCT. Experiments were conducted to assess the impact of the new preprocessing algorithm and the placement of the adaptive convolution layer as a substitute for the conventional convolution layer. Implementing the proposed approaches resulted in accuracy improvements ranging from 0.44% to 2.44% across architectures. Our findings highlight the efficacy of the proposed indirect noise reduction technique and a texture-sensitive adaptive convolution layer.",
    "citation_count": "5",
    "year": "2024/06/01",
    "authors": [
        {
            "name": "Karri Karthik",
            "country": ""
        },
        {
            "name": "Manjunatha Mahadevappa",
            "country": ""
        }
    ],
    "keywords": []
}