{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624001203",
    "title": "Detection of dental periapical lesions using retinex based image enhancement and lightweight deep learning model",
    "abstract": "Dental  periapical lesions , commonly associated with inflammation around the  tooth apex , pose a significant challenge in early diagnosis and treatment. This study introduces a novel approach for the detection of dental  periapical lesions  through the integration of Retinex-based image enhancement techniques and a lightweight deep learning model. The Retinex algorithm is employed to enhance the radiographic images, addressing issues related to inconsistent illumination and contrast. Subsequently, a tailored lightweight deep learning model is designed to efficiently extract relevant features from the enhanced images. Present methodology leverages a dataset of dental radiographs to train and evaluate the deep learning model, incorporating a diverse range of periapical lesion cases. The model is optimized for computational efficiency while maintaining high accuracy, making it suitable for deployment in resource-constrained environment. To enhance precision in lesion detection, the U-Net segmentation technique has been incorporated, providing a sophisticated approach to delineate and analyze specific areas of interest within the radiographic images. This addition further refines our diagnostic framework, contributing to the robustness of lesion identification. Experimental results demonstrate the effectiveness of the Retinex-based image enhancement in improving the visibility of periapical lesions. The lightweight deep learning model exhibits promising performance in accurately detecting and classifying dental periapical lesions, showcasing its potential for early and efficient diagnosis. The results obtained from the present model are compared with those from Convolutional Neural Network (CNN) as well as with diagnosis of expert practitioners and the model is observed to perform very well. The study contributes to the advancement of computer-aided diagnostic tools in  dentistry , offering a scalable and accessible solution for the identification of dental periapical lesions through the fusion of image enhancement and lightweight deep learning techniques.",
    "citation_count": "5",
    "year": "2024/06/01",
    "authors": [
        {
            "name": "Vaishali Latke",
            "country": ""
        },
        {
            "name": "Vaibhav Narawade",
            "country": ""
        }
    ],
    "keywords": []
}