{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623000847",
    "title": "Detection of anomaly in surveillance videos using quantum convolutional neural networks",
    "abstract": "Anomalous behavior identification is the process of detecting behavior that differs from its normal. These incidents will vary from violence to war, road crashes to kidnapping, and so on in a surveillance model. Video  anomaly detection  from video surveillance is a difficult research activity due to the frequency of anomalous cases. Since certain devices need manual evaluation for the detection of violent or criminal situations at the same time video monitoring of security cameras is also a challenging task and is unreliable. When the data or model dimension is sufficiently large,  convolutional neural networks  have the limitation of learning inefficiently. Quantum Convolutional Neural Network (QCNN) is the name given to a technology that combines CNN and  quantum computing .  Quantum computation  and CNN are combined to create a more efficient and outperforming solution for solving complicated machine-learning problems. To analyze the anomalies in a sequence of video frames, two models are proposed in this research. In this research 07 layers of Javeria deep convolutional  neural network  (DCNN) are proposed on the selected hyperparameters named J. DCNN which is also different from the existing models to analyze the abnormal behavior in a video segment. Furthermore, for a comprehensive analysis of the abnormal video frames a model is proposed which is the combination of Javeria quantum and  convolutional neural networks  (J. QCNN). In this model 04-qubit quantum  neural network  is used with five layers and an optimal loss rate named J. QCNN. The proposed J. QCNN model is different from the existing  deep learning  architectures. The proposed models are trained from the scratch for the detection of anomalous from top challenging publicly available video surveillance datasets such as UNI-Crime and UCF Crime. The proposed J. QCNN model classifies the number of violent robberies such as armed thefts containing handguns or knives, and robberies displaying varying levels of viciousness with 0.99 accuracy while J. DCNN model gives 0.97 accuracy. The obtained results are superior in comparison with recent existing cutting-edge published work for real-time  anomaly detection  in video CCTV.",
    "citation_count": "26",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Javaria Amin",
            "country": ""
        },
        {
            "name": "Muhammad Almas Anjum",
            "country": ""
        },
        {
            "name": "Kainat Ibrar",
            "country": ""
        },
        {
            "name": "Muhammad Sharif",
            "country": ""
        },
        {
            "name": "Seifedine Kadry",
            "country": ""
        },
        {
            "name": "Ruben González Crespo",
            "country": ""
        }
    ],
    "keywords": []
}