{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300469",
    "title": "Digital video intrusion intelligent detection method based on narrowband Internet of Things and its application",
    "abstract": "This paper proposes a digital video  intrusion detection  method based on  Narrow Band   Internet of Things  (NB-IoT), and establishes a digital video  intrusion detection system  based on NB-IoT network and SVM intelligent  classification algorithm . Firstly, the image is preprocessed by gradation processing and threshold transformation to extract the HOG feature extraction of human intrusion behavior in digital video frame images. Then, combined with the human intrusion HOG feature data, the SVM intelligent algorithm is used to classify the human intrusion behavior, so as to accurately classify the movements of walking, jumping, running and waving in video surveillance. Finally, the performance analysis of the algorithm finds that the classification time,  classification accuracy  and classification false positive rate of the model are tested. The classification time is 40.8 s, the shortest is 27 s, the  classification accuracy  is 87.65%, and the lowest is 83.7%. The false detection rate is up to 15%, both of which are less than 20%, indicating that the classification method has good accuracy and stability. Comparing the algorithm with other algorithms, the intrusion sensitivity, intrusion specificity and training speed of the model are 93.6%, 94.3%, and 19 s, respectively, which are better than other methods, which indicates that the model has good detection performance in the experimental stage.",
    "citation_count": "16",
    "year": "2020/05/01",
    "authors": [
        {
            "name": "Aimin Yang",
            "country": ""
        },
        {
            "name": "Huixiang Liu",
            "country": ""
        },
        {
            "name": "Yongjie Chen",
            "country": ""
        },
        {
            "name": "Chunying Zhang",
            "country": ""
        },
        {
            "name": "Ke Yang",
            "country": ""
        }
    ],
    "keywords": []
}