{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001701",
    "title": "Domain adaptive person search via GAN-based scene synthesis for cross-scene videos",
    "abstract": "Person search has recently been a challenging task in the computer vision domain, which aims to search specific pedestrians from real cameras.Nevertheless, most surveillance videos comprise only a handful of images of each pedestrian, which often feature identical backgrounds and clothing. Hence, it is difficult to learn more discriminative features for person search in real scenes. To tackle this challenge, we draw on Generative Adversarial Networks (GAN) to synthesize data from surveillance videos. GAN has thrived in computer vision problems because it produces high-quality images efficiently. We merely alter the popular Fast R-CNN model, which is capable of processing videos and yielding accurate detection outcomes. In order to appropriately relieve the pressure brought by the two-stage model, we design an Assisted-Identity Query Module (AIDQ) to provide positive images for the behind part. Besides, the proposed novel GAN-based Scene Synthesis model that can synthesize high-quality cross-id person images for person search tasks. In order to facilitate the feature learning of the GAN-based Scene Synthesis model, we adopt an online learning strategy that collaboratively learns the synthesized images and original images. Extensive experiments on two widely used person search benchmarks, CUHK-SYSU and PRW, have shown that our method has achieved great performance, and the extensive ablation study further justifies our GAN-synthetic data can effectively increase the variability of the datasets and be more realistic. The code is available at https://github.com/crsm424/DA-GSS .",
    "citation_count": "8",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Huibing Wang",
            "country": ""
        },
        {
            "name": "Tianxiang Cui",
            "country": ""
        },
        {
            "name": "Mingze Yao",
            "country": ""
        },
        {
            "name": "Huijuan Pang",
            "country": ""
        },
        {
            "name": "Yushan Du",
            "country": ""
        }
    ],
    "keywords": []
}