{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003135",
    "title": "Dual temporal memory network with high-order spatio-temporal graph learning for video object segmentation",
    "abstract": "Typically, Video Object Segmentation (VOS) always has the semi-supervised setting in the testing phase. The VOS aims to track and segment one or several target objects in the following frames in the sequence, only given the ground-truth segmentation mask in the initial frame. A fundamental issue in VOS is how to best utilize the temporal information to improve the accuracy. To address the aforementioned issue, we provide an end-to-end framework that simultaneously extracts long-term and short-term historical sequential information to current frame as temporal memories. The integrated temporal architecture consists of a short-term and a long-term memory modules. Specifically, the short-term memory module leverages a high-order graph-based learning framework to simulate the fine-grained spatial–temporal interactions between local regions across neighboring frames in a video, thereby maintaining the spatio-temporal visual consistency on local regions. Meanwhile, to relieve the occlusion and drift issues, the long-term memory module employs a Simplified Gated Recurrent Unit (S-GRU) to model the long evolutions in a video. Furthermore, we design a novel direction-aware attention module to complementarily augment the object representation for more robust segmentation. Our experiments on three mainstream VOS benchmarks, containing DAVIS 2017, DAVIS 2016, and Youtube-VOS, demonstrate that our proposed solution provides a fair tradeoff performance between both speed and accuracy.",
    "citation_count": "0",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Jiaqing Fan",
            "country": ""
        },
        {
            "name": "Shenglong Hu",
            "country": ""
        },
        {
            "name": "Long Wang",
            "country": ""
        },
        {
            "name": "Kaihua Zhang",
            "country": ""
        },
        {
            "name": "Bo Liu",
            "country": ""
        }
    ],
    "keywords": []
}