{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001233",
    "title": "Dynamic texture analysis using Temporal Gray scale Pattern Image for water surface velocity measurement",
    "abstract": "Water surface velocity (WSV) is one of the critical parameters in hydrology. The development of non-intrusive measurement of this parameter using cameras is increasing. Traditionally, measuring WSV using a camera utilizes tracking of moving objects on the water surfaces. Recently, another method has emerged that utilizes the movement of water ripples to estimate the WSV. This paper proposes a novel method for estimating WSV based on camera measurements. The authors call this method Temporal Gray-scale Pattern Image (TGPI) since it extracts Gray-scale patterns of pixels of water flow video in the temporal domain using the XOR operator and create new image. The new image pattern formed is then used to predict WSV using predictor. There are four predictors being compared, namely Multiple Input Linear Regression (MILR), Multiple Input Logistic Regression (MILgR), Convolutional Neural Network Regression (CNN-R), and Convolutional Neural Network Classification (CNN-K). CNN-R and CNN-K predict WSV directly from the results of TGPI. Meanwhile, MILR and MILgR predict WSV from five TGPI features. The five features are the Mean and Median of the Histogram, Mean and Median of the Histogram of Oriented Gradient (HOG), and the Maximum Mid-Value of the Fast Fourier Transform (FFT). MILR and CNN-R are predictors for regression problems, so the testing metrics for them are Trend-Line equation and R 2  from the predicted WSV and actual values graph. Meanwhile, for MILgR and CNN-K, which are predictors for classification problems, the testing metrics are Confusion Matrix (CM), Accuracy, Precision, Recall, and F1-Score. To test the four methods without distinguishing their predictor types, a 2-dimensional histogram graph is used. The data-set used for training and testing is video footage of water flow with known WSV. The WSV measurement points used in this study are 1.7 m/s, 3.1 m/s, and 4.2 m/s. The video dataset and these three points are generated by the Mini Open Channel Water Flow Simulator (MOCWFS) developed by the author in this study. From the comparison results, it can be seen that the classification type predictor is superior to the regression type. For the regression type predictor, MILR is better than CNN-R. Meanwhile, for the classification type, CNN-K is superior to MILgR. The best accuracy produced by CNN-K is 98.4%. Although there are shortcomings, the TGPI method is quite feasible for predict Water Surface Velocity.",
    "citation_count": "0",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Bernadus Herdi Sirenden",
            "country": ""
        },
        {
            "name": "Petrus Mursanto",
            "country": ""
        },
        {
            "name": "Sensus Wijonarko",
            "country": ""
        }
    ],
    "keywords": []
}