{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001385",
    "title": "Efficient unsupervised learning of biological images with compressed deep features",
    "abstract": "Machine learning has significantly impacted the analysis of biological images and is now an important part of many biological data analysis pipelines. A variety of biological and biomedical domain-related tasks is gaining benefit from image analysis and pattern recognition tools developed currently. Applications include diagnostic histopathology, environmental monitoring, synthetic biology, genomics, and proteomics. Particularly in the last decade, several deep learning and advanced computer vision methods such as convolutional neural networks (CNNs), typically trained in a supervised fashion, have started to be largely employed in biological image classification. Moreover, the advancement of automatic acquisition systems has been generating a massive amount of biological data, which requires to be analyzed by domain experts. However, the cost of manual annotation of such data has become a bottleneck, impairing the application of supervised machine learning algorithms. Biological images generally have an intrinsic high variability, whose identity is sometimes hard to assign and strongly dependent on the annotator’s expertise. In this context, a limited number of annotation-free (i.e., unsupervised) learning solutions have been proposed, typically based on hand-crafted features, specifically tailored for a certain biological domain. Nonetheless, a successful unsupervised learning approach must be accurate, and sufficiently robust to deal with different biological domains. This paper aims at providing a viable solution to these issues, proposing an unsupervised learning algorithm based on compressed deep features for image classification. We exploit features extracted from ImageNet pre-trained transformers and CNNs, further compressed with a customized  β -Variational AutoEncoder ( β -VAE), that we call reconstruction VAE (R-VAE). We test our algorithm on biological images coming from diverse domains characterized by high variability in shape and texture information and acquired with widely differing imaging platforms. Considered image datasets range from multi-cellular organisms (plankton, coral) to sub-cellular organelles (budding yeast vacuoles, human cells’ nuclei, etc.). Our results show that the compressed deep features extracted from different pre-trained vision models establish new unsupervised learning state-of-the-art performances for the investigated datasets.",
    "citation_count": "0",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Vito Paolo Pastore",
            "country": ""
        },
        {
            "name": "Massimiliano Ciranni",
            "country": ""
        },
        {
            "name": "Simone Bianco",
            "country": ""
        },
        {
            "name": "Jennifer Carol Fung",
            "country": ""
        },
        {
            "name": "Vittorio Murino",
            "country": ""
        },
        {
            "name": "Francesca Odone",
            "country": ""
        }
    ],
    "keywords": []
}