{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616300270",
    "title": "Examplar coherent 3D face reconstruction from forensic mugshot database",
    "abstract": "Reconstructing 3D  face models  from 2D face images is usually done by using a single reference 3D face model or some gender/ethnicity specific 3D face models. However, different persons, even those of the same gender or ethnicity, usually have significantly different faces in terms of their overall appearance, which forms the base of person recognition  via  faces. Consequently, existing 3D reference model based methods have limited capability of reconstructing precise 3D face models for a large variety of persons. In this paper, we propose to explore a reservoir of diverse reference models for 3D face reconstruction from forensic mugshot face images, where facial examplars coherent with the input determine the final shape estimation. Specifically, our 3D face reconstruction is formulated as an  energy minimization  problem with: 1) shading constraint from multiple input face images, 2) distortion and self-occlusion based color consistency between different views, and 3) depth uncertainty based smoothness constraint on  adjacent pixels . The proposed energy is minimized in a coarse to fine way, where the shape refinement step is done by using a multi-label  segmentation algorithm . Experimental results on challenging datasets demonstrate that the proposed algorithm is capable of recovering high quality 3D face models. We also show that our reconstructed models successfully boost face  recognition accuracy .",
    "citation_count": "22",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Dan Zeng",
            "country": ""
        },
        {
            "name": "Qijun Zhao",
            "country": ""
        },
        {
            "name": "Shuqin Long",
            "country": ""
        },
        {
            "name": "Jing Li",
            "country": ""
        }
    ],
    "keywords": []
}