{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300630",
    "title": "Eye center localization in a facial image based on geometric shapes of iris and eyelid under natural variability",
    "abstract": "The estimation of the human eye centers is one of the important step in several  computer vision applications  such as driver  drowsiness detection , eye tracking, face recognition etc. Most of the existing techniques are able to localize eyes in frontal faces only while they fail to localize eye pairs in complex scenarios such as changes in head pose, scale, and illumination. In this paper, an eye  localization method  has been proposed that can locate the eye centers more precisely in  facial images  captured under the above-mentioned complexities. The proposed method consists of three stages: eye candidate detection, eye candidate verification, and post-processing. In eye candidate detection, the possible eye candidates are extracted using two new features namely Semi-Circular Edge Shape (sCES) and Semi-Ellipse Edge Shape (sEES) features. These features take into consideration the semi-circular and semi-ellipse edges of iris and eyelid and hence are able to localize eye centers more precisely. In verification, the extracted eye candidates are verified using a  Support Vector Machine  (SVM) based classifier. A scale-space framework is also included in the verification stage to handle the scale variations of images. In post-processing, the eye centers are paired using some geometrical constraints and then a modified gradient-based method is proposed to detect the required eye pair. The proposed system is evaluated on different databases to check its robustness to changes in head pose, scale, illumination etc. The experimental results suggest that the proposed method shows better accuracy in challenging environments and also outperforms some state-of-the-art methods.",
    "citation_count": "21",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Manir Ahmed",
            "country": ""
        },
        {
            "name": "Rabul Hussain Laskar",
            "country": ""
        }
    ],
    "keywords": []
}