{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624004517",
    "title": "Feature extraction and fusion algorithm for infrared visible light images based on residual and generative adversarial network",
    "abstract": "With the application and popularization of depth cameras, image fusion techniques based on infrared and visible light are increasingly used in various fields. Object detection and robot navigation impose more stringent requirements on the texture details and image quality of fused images. Existing residual network, attention mechanisms, and generative adversarial network are ineffective in dealing with the image fusion problem because of insufficient detail feature extraction and non-conformity to the human visual perception system during the fusion of infrared and visible light images. Our newly developed RGFusion network relies on a two-channel attentional mechanism, a residual network, and a generative adversarial network that introduces two new components: a high-precision image feature extractor and an efficient multi-stage training strategy. The network is preprocessed by a high-dimensional mapping and the complex feature extractor is processed through a sophisticated two-stage image fusion process to obtain feature structures with multiple features, resulting in high-quality fused images rich in detailed features. Extensive experiments on public datasets validate this fusion approach, and RGFusion is at the forefront of SD metrics for EN and SF, reaching 7.366, 13.322, and 49.281 on the TNO dataset and 7.276, 19.171, and 53.777 on the RoadScene dataset, respectively.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Naigong Yu",
            "country": ""
        },
        {
            "name": "YiFan Fu",
            "country": ""
        },
        {
            "name": "QiuSheng Xie",
            "country": ""
        },
        {
            "name": "QiMing Cheng",
            "country": ""
        },
        {
            "name": "Mohammad Mehedi Hasan",
            "country": ""
        }
    ],
    "keywords": []
}