{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885618300672",
    "title": "Gait recognition in the wild using shadow silhouettes",
    "abstract": "Gait recognition  systems allow identification of users relying on features acquired from their body movement while walking. This paper discusses the main factors affecting the gait features that can be acquired from a 2D video sequence, proposing a taxonomy to classify them across four dimensions. It also explores the possibility of obtaining users' gait features from the shadow silhouettes by proposing a novel gait recognition system. The system includes novel methods for: (i) shadow segmentation, (ii) walking direction identification, and (iii) shadow silhouette  rectification . The shadow segmentation is performed by fitting a line through the feet positions of the user obtained from the gait texture image (GTI). The direction of the fitted line is then used to identify the walking direction of the user. Finally, the shadow silhouettes thus obtained are rectified to compensate for the distortions and deformations resulting from the acquisition setup, using the proposed four-point correspondence method. The paper additionally presents a new database, consisting of 21 users moving along two walking directions, to test the proposed gait recognition system. Results show that the performance of the proposed system is equivalent to that of the state-of-the-art in a constrained setting, but performing equivalently well in the wild, where most state-of-the-art methods fail. The results also highlight the advantages of using rectified shadow silhouettes over body silhouettes under certain conditions.",
    "citation_count": "17",
    "year": "2018/08/01",
    "authors": [
        {
            "name": "Tanmay Tulsidas Verlekar",
            "country": ""
        },
        {
            "name": "Luís Ducla Soares",
            "country": ""
        },
        {
            "name": "Paulo Lobato Correia",
            "country": ""
        }
    ],
    "keywords": []
}