{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621002444",
    "title": "Geometric feature statistics histogram for both real-valued and binary feature representations of 3D local shape",
    "abstract": "3D  local feature  description is now at the core of many 3D vision technologies. However, most of the existing 3D  feature descriptors  can't strike a balance among descriptiveness, robustness, compactness, and efficiency. To overcome the challenges, we propose a real-valued 3D local feature descriptor named  Geometric Feature  Statistics Histogram (GFSH) and its binary extension descriptor named B-GFSH. A GFSH descriptor first constructs an improved-weighted  covariance matrix  to solve a stable and reliable Local Reference Frame (LRF), and then achieves a comprehensive description of the 3D local surface by performing statistics on multiple  geometric distribution  features, namely voxel density, voxel centroid, and projection density. A particular trait of our GFSH descriptor is its seamless extension to the  binary representation  to reduce storage consumption and accelerate feature matching. For each sub-feature of GFSH, B-GFSH respectively adopts the corresponding  binarization  strategy, i.e., improved Gray code quantization, thresholding based on coordinates, and neighbor comparison. Extensive experiments on six public datasets prove that both GFSH and B-GFSH have high descriptiveness, strong robustness, and fast real-time performance. In addition, B-GFSH further has the characteristics of fast matching speed, low  memory footprint , and high compactness. Finally, we conduct  3D scene  registration and 3D object recognition experiments to visually demonstrate the actual effectiveness of GFSH and B-GFSH.",
    "citation_count": "13",
    "year": "2022/01/01",
    "authors": [
        {
            "name": "Linbo Hao",
            "country": ""
        },
        {
            "name": "Huaming Wang",
            "country": ""
        }
    ],
    "keywords": []
}