{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002160",
    "title": "Improving defocus blur detection via adaptive supervision prior-tokens",
    "abstract": "The  Defocus Blur  Detection (DBD) technique is devised to accurately identify regions of  blurriness  within images. The prediction difficulty of defocused pixels is closely associated with their  spatial location . Owing to the cluttered background, pixels near the edges are more prone to erroneous predictions. To address the issue of uneven pixel distribution at the edges of defocused regions, we deliberately decouple the original labels into Prior-Tokaens: Edge Transition Detail Region (EDR) and Structure Body Region (SBR). Subsequently, we propose a novel adaptive multi-supervised network comprising a feature extraction module, a  feature fusion  network (FFN), and a Multi-scale Channel Attention Module (MCAM). This method harnesses complementary features between SBR and EDR, furnishing a tailored  feature learning  strategy that outperforms traditional single-supervised techniques. Furthermore, considering that features generated with varying receptive fields contain information at different levels, we introduce MCAM to identify feature pixels at different scales, enhancing  semantic relevance . Moreover, for images with complex scenes, an adaptive learning scheme is developed to selectively fuse low-level detail features and high-level semantic information, thereby enhancing the model's generalization capability. The proposed approach outperforms state-of-the-art techniques on various  evaluation metrics , as demonstrated through qualitative and  quantitative analyses  of popular public datasets.",
    "citation_count": "2",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Huaguang Li",
            "country": ""
        },
        {
            "name": "Wenhua Qian",
            "country": ""
        },
        {
            "name": "Jinde Cao",
            "country": ""
        },
        {
            "name": "Peng Liu",
            "country": ""
        }
    ],
    "keywords": []
}