{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620301190",
    "title": "Intelligent detection of building cracks based on deep learning",
    "abstract": "In order to solve the damage caused by the concrete structure, which leads to the reduction of the life of infrastructure, endangers the safety of pedestrians, and has a serious impact on the social economy, building crack detection model of FCN (Fully Convolutional Networks), R-CNN (Regions with  CNN  feature) and RFCN (Richer Fully Convolutional Networks) has been proposed based on the convolutional neural network model to amplify and extract the features of the data and previous studies. Through the training of building surface data such as roads, bridges, houses and dams, the model is analyzed in terms of morphological and geometric indexes. Finally, the model of crack picture detection and segmentation based on  deep learning  is used for picture performance detection and comprehensive evaluation. The results show that: in the aspect of building gap detection, the RFCN model has the best processing effect, the gap recognition degree is higher, and the detail processing is better. In the aspect of model evaluation index, the correct rate of RFCN model is increased by 10%, the accuracy rate is increased by 12%, the recall rate is increased by 8%, the loss rate is increased by 3%, and the overall stability is higher. In the aspect of comprehensive performance, the picture processing performance is better than the FCN model by 7% and better than the R-CNN model by 15%, and the memory share is 80%. The fusion model based on deep learning and picture processing has been improved in many aspects, which can provide strong theoretical support and practical value for the detection and research of concrete surface cracks such as bridges, dams, highways and houses.",
    "citation_count": "61",
    "year": "2020/11/01",
    "authors": [
        {
            "name": "Minjuan Zheng",
            "country": ""
        },
        {
            "name": "Zhijun Lei",
            "country": ""
        },
        {
            "name": "Kun Zhang",
            "country": ""
        }
    ],
    "keywords": []
}