{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003421",
    "title": "Learning accurate monocular 3D voxel representation via bilateral voxel transformer",
    "abstract": "Vision-based methods for 3D scene perception have been widely explored for autonomous vehicles. However, inferring complete 3D semantic scenes from monocular 2D images is still challenging owing to the 2D-to-3D transformation. Specifically, existing methods that use Inverse Perspective Mapping (IPM) to project image features to dense 3D voxels severely suffer from the ambiguous projection problem. In this research, we present  Bilateral Voxel Transformer  (BVT), a novel and effective Transformer-based approach for monocular 3D semantic scene completion. BVT exploits a bilateral architecture composed of two branches for preserving the high-resolution 3D voxel representation while aggregating contexts through the proposed Tri-Axial Transformer simultaneously. To alleviate the ill-posed 2D-to-3D transformation, we adopt position-aware voxel queries and dynamically update the voxels with image features through weighted geometry-aware sampling. BVT achieves 11.8 mIoU on the challenging Semantic KITTI dataset, considerably outperforming previous works for semantic scene completion with monocular images. The code and models of BVT will be available on  GitHub .",
    "citation_count": "1",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Tianheng Cheng",
            "country": ""
        },
        {
            "name": "Haoyi Jiang",
            "country": ""
        },
        {
            "name": "Shaoyu Chen",
            "country": ""
        },
        {
            "name": "Bencheng Liao",
            "country": ""
        },
        {
            "name": "Qian Zhang",
            "country": ""
        },
        {
            "name": "Wenyu Liu",
            "country": ""
        },
        {
            "name": "Xinggang Wang",
            "country": ""
        }
    ],
    "keywords": []
}