{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300019",
    "title": "Learning reliable-spatial and spatial-variation regularization correlation filters for visual tracking",
    "abstract": "Single-object tracking is a significant and challenging  computer vision  problem. Recently, discriminative correlation filters (DCF) have shown excellent performance. But there is a theoretical defects that the boundary effect, caused by the periodic assumption of  training samples , greatly limit the tracking performance. Spatially regularized DCF (SRDCF) introduces a spatial  regularization  to penalize the  filter coefficients  depending on their  spatial location , which improves the tracking performance a lot. However, this simple  regularization  strategy implements unequal penalties for the target area  filter coefficients , which makes the filter learn a distorted object appearance model. In this paper, a novel spatial regularization strategy is proposed, utilizing a reliability map to approximate the target area and to keep the penalty coefficients of relevant region consistent. Besides, we introduce a spatial variation regularization component that the second-order difference of the filter, which smooths changes of filter coefficients to prevent the filter over-fitting current frame. Furthermore, an efficient  optimization algorithm  called  alternating direction method of multipliers  (ADMM) is developed. Comprehensive experiments are performed on three benchmark datasets: OTB-2013, OTB-2015 and TempleColor-128, and our algorithm achieves a more favorable performance than several state-of-the-art methods. Compared with SRDCF, our approach obtains an absolute gain of 6.6% and 5.1% in mean distance precision on OTB-2013 and OTB-2015, respectively. Our approach runs in real-time on a CPU.",
    "citation_count": "9",
    "year": "2020/02/01",
    "authors": [
        {
            "name": "Hengcheng Fu",
            "country": ""
        },
        {
            "name": "Yihong Zhang",
            "country": ""
        },
        {
            "name": "Wuneng Zhou",
            "country": ""
        },
        {
            "name": "Xiaofeng Wang",
            "country": ""
        },
        {
            "name": "Huanlong Zhang",
            "country": ""
        }
    ],
    "keywords": []
}