{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885622000257",
    "title": "Lightweight and computationally faster Hypermetropic Convolutional Neural Network for small size object detection",
    "abstract": "Object detection has been an active area of research over the past two decades. The complexity of detecting an object increases with the increase in object speed and decrease in object size. Similar scenarios are observed in sports video analysis, vision systems of robots, driverless cars and much more. This led to the need for an efficient  neural network  that can detect small size objects. Further, most of the real-time applications use single board computers such as Jetson Nano, TX2, Xavier, Raspberry Pi and the like. The state-of-the-art of  Deep Learning  models such as YOLOv4, v3, YOLOR, YOLOX and SSD show poor run-time performance on these devices. Their lighter versions YOLOv3-tiny, YOLOv4-tiny and YOLOX-nano run nearly at 24 frames per second (fps) on Jetson Nano; however, their detection accuracy on small-sized objects is unsatisfactory. This paper focuses on developing a computationally lighter Convolutional Neural network(CNN) to detect small-sized objects efficiently. A novel hypermetropic CNN was developed to meet the above requirements. The improvement in detection is made by extracting more features from the shallow layers and transferring low-level features to the deeper layers. The network is hypermetropic because it performs well on distant objects and lags on nearby objects. The proposed model's performance is compared with the state-of-the-art models on various public datasets such as the VEDAI dataset, Visdrone dataset, and a few classes from the MS COCO and OID dataset. The proposed model shows impressive improvements in detecting small-size objects, and a 32% increase in the fps is observed on Jetson Nano.",
    "citation_count": "36",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Amudhan A.N.",
            "country": ""
        },
        {
            "name": "Sudheer A.P.",
            "country": ""
        }
    ],
    "keywords": []
}