{
    "url": "https://www.sciencedirect.com/science/article/pii/S026288561630110X",
    "title": "Local feature approach to dorsal hand vein recognition by Centroid-based Circular Key-point Grid and fine-grained matching",
    "abstract": "Due to the great progress made by  local feature  matching in both performance and robustness of dorsal hand vein recognition, this paper proposes a novel and effective approach for such an issue by improving two major steps of the SIFT-like framework,  i.e.  key-point detection and matching. For the former, a new key-point generation pattern, namely Centroid-based Circular Key-point Grid (CCKG), is presented, which efficiently localizes a certain number of points on the dorsal hand for the following  SIFT  feature extraction, leading to a discriminative description. In contrast to the existing key-point detectors, CCKG comprehensively accounts for the properties of the dorsal hand, including the vein network as well as the surrounding corium region, and hence achieves both good  representativeness  and low complexity. For the latter, a fine-grained  matching process  is introduced which makes use of Multi-task  Sparse Representation  Classifier (MtSRC). Compared with the traditional coarse-grained one that counts the number of associated SIFT features between the gallery and probe dorsal hand images, MtSRC precisely calculates the error of each feature of the probe as reconstructed by the gallery features, and all the errors of the probe features are combined for similarity measurement, reaching a better accuracy in recognition. The proposed approach is evaluated on the NCUT Part A database and shows its effectiveness in both the identification and verification scenarios. Additionally, the experimental results achieved on the NCUT Part B dataset highlight its generality and robustness to low quality images.",
    "citation_count": "37",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Di Huang",
            "country": ""
        },
        {
            "name": "Renke Zhang",
            "country": ""
        },
        {
            "name": "Yuan Yin",
            "country": ""
        },
        {
            "name": "Yiding Wang",
            "country": ""
        },
        {
            "name": "Yunhong Wang",
            "country": ""
        }
    ],
    "keywords": []
}