{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885614001085",
    "title": "Local circular patterns for multi-modal facial gender and ethnicity classification",
    "abstract": "Gender and ethnicity are both key demographic attributes of human beings and they play a very fundamental and important role in automatic machine based face analysis, therefore, there has been increasing attention for face based gender and ethnicity classification in recent years. In this paper, we present an effective and efficient approach on this issue by combining both boosted local texture and shape features extracted from 3D  face models , in contrast to the existing ones that only depend on either 2D texture or 3D shape of faces. In order to comprehensively represent the difference between different genders or ethnicities, we propose a novel  local descriptor , namely local circular patterns (LCP). LCP improves the widely utilized  local binary patterns  (LBP) and its variants by replacing the binary quantization with a clustering based one, resulting in higher  discriminative power  as well as better robustness to noise. Meanwhile the following  Adaboost  based feature selection finds the most discriminative gender- and race-related features and assigns them with different weights to highlight their importance in classification, which not only further raises the performance but reduces the time and memory cost as well. Experimental results achieved on the FRGC v2.0 and BU-3DFE datasets clearly demonstrate the advantages of the proposed method.",
    "citation_count": "30",
    "year": "2014/12/01",
    "authors": [
        {
            "name": "Di Huang",
            "country": ""
        },
        {
            "name": "Huaxiong Ding",
            "country": ""
        },
        {
            "name": "Chen Wang",
            "country": ""
        },
        {
            "name": "Yunhong Wang",
            "country": ""
        },
        {
            "name": "Guangpeng Zhang",
            "country": ""
        },
        {
            "name": "Liming Chen",
            "country": ""
        }
    ],
    "keywords": []
}