{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001191",
    "title": "Loss-aware automatic selection of structured pruning criteria for deep neural network acceleration",
    "abstract": "Structured pruning is a well-established technique for compressing  neural networks , making them suitable for deployment in resource-limited edge devices. This study presents an efficient loss-aware automatic selection of structured pruning (LAASP) criteria for slimming and accelerating  deep neural networks . The majority of pruning methods employ a sequential process consisting of three stages, 1) training, 2) pruning, and 3) fine-tuning, whereas the proposed pruning technique adopts a pruning-while-training approach that eliminates the first stage and integrates the second and third stages into a single cycle. The automatic selection of magnitude or similarity-based filter pruning criteria from a specified pool of criteria and the specific pruning layer at each pruning iteration is guided by the network's overall loss on a small subset of  training data . To mitigate the abrupt accuracy drop due to pruning, the network is retrained briefly after each reduction of a predefined number of floating-point operations (FLOPs). The optimal pruning rates for each layer in the network are automatically determined, eliminating the need for manual allocation of fixed or variable pruning rates for each layer. Experiments on the VGGNet,  ResNet , and MobileNet models on the CIFAR-10 and ImageNet benchmark datasets demonstrate the effectiveness of the proposed method. In particular, the ResNet56 and ResNet110 models on the CIFAR-10 dataset significantly improve the top-1 accuracy compared to state-of-the-art methods while reducing the network FLOPs by 52%. Furthermore, pruning the  ResNet50  model on the ImageNet dataset reduces FLOPs by more than 42% with a negligible 0.33% drop in the top-5 accuracy. The  source code  of this study is publicly available on GitHub:  https://github.com/ghimiredhikura/laasp .",
    "citation_count": "8",
    "year": "2023/08/01",
    "authors": [
        {
            "name": "Deepak Ghimire",
            "country": ""
        },
        {
            "name": "Kilho Lee",
            "country": ""
        },
        {
            "name": "Seong-heum Kim",
            "country": ""
        }
    ],
    "keywords": []
}