{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621000469",
    "title": "Multi-stream slowFast graph convolutional networks for skeleton-based action recognition",
    "abstract": "Recently, many efforts have been made to model spatial–temporal features from human skeleton for action recognition by using  graph convolutional networks  (GCN). Skeleton sequence can precisely represent human pose with a small number of joints while there is still a lot of redundancies across the skeleton sequence in the term of temporal dependency. In order to improve the effectiveness of spatial–temporal feature extraction from skeleton sequence, a SlowFast graph convolution network (SF-GCN) is proposed by implementing the architecture of SlowFast network, which is consisted of the Fast and Slow pathway, in the GCN model. The Fast pathway is a temporal attention embedded lightweight GCN for extracting the feature of fast temporal changes from the skeleton sequence with a high frame rate and fast refreshing speed. The Slow pathway is a spatial attention embedded GCN for extracting the feature of slow temporal changes from the skeleton sequence with a low frame rate and slow refreshing speed. The features of two pathways are fused by using lateral connection and weighted by using channel attention. Based on the aforementioned design, SF-GCN can achieve superior ability of feature extraction while the computational cost significantly drops. In addition to the coordinate information of joints, five high order sequences including edge, the spatial difference and  temporal difference  of joints and edges are induced to enhance the representation of human action. Six SF-GCNs are implemented for extracting spatial–temporal feature from six kinds of sequences and fused for skeleton-based action recognition, which is called multi-stream SlowFast graph convolutional networks (MSSF-GCN). Extensive experiments are conducted to evaluate the proposed method on three skeleton-based action recognition databases including NTU RGB + D, NTU RGB + D 120, and Skeleton-Kinetics. The results show that the proposed method is effective for skeleton-based action recognition and can achieve the  recognition accuracy  with an obvious advantage in comparison with the state-of-the-art.",
    "citation_count": "30",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Ning Sun",
            "country": ""
        },
        {
            "name": "Ling Leng",
            "country": ""
        },
        {
            "name": "Jixin Liu",
            "country": ""
        },
        {
            "name": "Guang Han",
            "country": ""
        }
    ],
    "keywords": []
}