{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621001864",
    "title": "Multi-type decision fusion network for visual Q&A",
    "abstract": "The existing VQA task contains questions of various complexity, which can be divided into the object-level and relation-level categories. The former requires the model to focus on  individual objects  of images to answer the question, such as “Is a man in the image?”, denoted by object-QA, while the latter depends on a better understanding in the relation of pairwise objects to infer the answer, such as “What is the man doing now?”, denoted by relation-QA. However, existing methods indiscriminately rely on the single network to deal with multi-type question categories, which cannot meet the comprehensive nature of VQA task. To this end, we introduce the novel multi-type decision fusion model, which can adaptively leverage object- and relation-level decision networks to infer the answer. Our approach consists of three key components: 1) the object-QA network designs the attention layer to search for object regions in an image that are associated with the answer. 2) the relation-QA network captures the question aware relation information from the visual scene graph, for the answer inference; 3) the proposed balance gate involves the outputs of object- and relation-QA networks to adaptively predict the final output. Extensive experiments on two benchmarks demonstrate that the proposed method can achieve competing performance against the state-of-the-art methods. Additional ablation studies further validate its effectiveness.",
    "citation_count": "5",
    "year": "2021/11/01",
    "authors": [
        {
            "name": "An-An Liu",
            "country": ""
        },
        {
            "name": "Zimu Lu",
            "country": ""
        },
        {
            "name": "Ning Xu",
            "country": ""
        },
        {
            "name": "Weizhi Nie",
            "country": ""
        },
        {
            "name": "Wenhui Li",
            "country": ""
        }
    ],
    "keywords": []
}