{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624002245",
    "title": "Occlusion-aware deep convolutional neural network via homogeneous Tanh-transforms for face parsing",
    "abstract": "Face   parsing  infers a pixel-wise label map for each semantic facial component. Previous methods generally work well for uncovered faces, however, they overlook facial occlusion and ignore some contextual areas outside a single face, especially when facial occlusion has become a common situation during the COVID-19 epidemic. Inspired by the lighting phenomena in everyday life, where illumination from four distinct lamps provides a more uniform distribution than a single central  light source , we propose a novel homogeneous tanh-transform for image preprocessing, which is made up of four tanh-transforms. These transforms fuse the central vision and the  peripheral vision  together. Our proposed method addresses the dilemma of face parsing under occlusion and compresses more information from the surrounding context. Based on homogeneous tanh-transforms, we propose an occlusion-aware convolutional  neural network  for occluded face parsing. It combines information in both Tanh-polar space and Tanh-Cartesian space, capable of enhancing receptive fields. Furthermore, we introduce an occlusion-aware loss to focus on the boundaries of occluded regions. The network is simple, flexible, and can be trained end-to-end. To facilitate future research of occluded face parsing, we also contribute a new cleaned face parsing dataset. This dataset is manually purified from several academic or industrial datasets, including CelebAMask-HQ, Short-video Face Parsing, and the Helen dataset, and will be made public. Experiments demonstrate that our method surpasses state-of-the-art methods in face parsing under occlusion.",
    "citation_count": "2",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Jianhua Qiu",
            "country": ""
        },
        {
            "name": "Weihua Liu",
            "country": ""
        },
        {
            "name": "Chaochao Lin",
            "country": ""
        },
        {
            "name": "Jiaojiao Li",
            "country": ""
        },
        {
            "name": "Haoping Yu",
            "country": ""
        },
        {
            "name": "Said Boumaraf",
            "country": ""
        }
    ],
    "keywords": []
}