{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624002567",
    "title": "Omnidirectional image quality assessment with local–global vision transformers",
    "abstract": "With the rising popularity of  omnidirectional images  (ODIs) in  virtual reality applications , the need for specialized  image quality assessment  (IQA) methods becomes increasingly critical. Traditional IQA approaches, designed for rectilinear images, often fail to evaluate ODIs accurately due to their 360-degree scene representation. Addressing this, we introduce the Local–Global Transformer for 360-degree Image Quality Assessment (LGT360IQ). This novel framework features dual branches tailored to mimic top-down and bottom-up visual  attention mechanisms , adapted for the spherical characteristics of ODIs. The local branch processes tangent viewports from  salient regions  within the equirectangular projection image, extracting detailed features for granular quality assessment. In parallel, the global branch utilizes a task-dependent token sampling strategy for holistic  image feature  processing and quality score prediction. This integrated approach combines local and global information, offering an effective IQA method for ODIs. Our extensive evaluation across three benchmark ODI datasets, CVIQ, OIQA, and ODI, demonstrates LGT360IQ superior performance and establishes its role in advancing the field of IQA for omnidirectional images.",
    "citation_count": "2",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Nafiseh Jabbari Tofighi",
            "country": ""
        },
        {
            "name": "Mohamed Hedi Elfkir",
            "country": ""
        },
        {
            "name": "Nevrez Imamoglu",
            "country": ""
        },
        {
            "name": "Cagri Ozcinar",
            "country": ""
        },
        {
            "name": "Aykut Erdem",
            "country": ""
        },
        {
            "name": "Erkut Erdem",
            "country": ""
        }
    ],
    "keywords": []
}