{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619301052",
    "title": "Online learning of contexts for detecting suspicious behaviors in surveillance videos",
    "abstract": "One of the main incentives for implementing video-based surveillance systems is the urban security. During the last years, several approaches for automatic detection of suspicious events have been proposed. Those methods usually require a training stage before starting their operation. This means that previous to run time a representative dataset of interest events, that may occur in the future, must be available. Nevertheless, most real surveillance systems lack of that information, so many of those proposals results impractical. In this paper, a context online learning scheme for detecting suspicious behaviors on  surveillance videos  is proposed. Contextual information, which is inferred from videos of people in a scenario, allows detecting suspicious behaviors before an eventual criminal's final attack occur. The main attribute of the proposed approach is the capacity to start up its operation with a reduced training dataset. By an incremental learning process, which uses new data obtained during the online operation, the proposed scheme improves the performance over time achieving a better adaptation to conditions of each scenario. The proposed scheme was validated on two datasets. The first of them includes threats against a parked truck and its driver. The second  testing dataset  is composed of night assault scenes recorded in an urban environment. The experimental results demonstrate that the proposed method is able to learn incrementally from a reduced initial dataset, achieving a performance similar to batch-type systems trained with all data simultaneously and outperforming five state-of-the-art algorithms over violence detection.",
    "citation_count": "11",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Duber Martinez Torres",
            "country": ""
        },
        {
            "name": "Humberto Loaiza Correa",
            "country": ""
        },
        {
            "name": "Eduardo Caicedo Bravo",
            "country": ""
        }
    ],
    "keywords": []
}