{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002585",
    "title": "Research on efficient detection network method for remote sensing images based on self attention mechanism",
    "abstract": "Remote sensing  images are widely used in aerial drones, satellites, and other fields. However, traditional object detection methods face challenges of low efficiency and accuracy due to the diverse scales, numerous target types, and complex backgrounds of remote sensing images. To address these issues, this paper proposes a remote sensing image detection network based on self-attention, which adaptively learns the relative importance of pixels to achieve more precise and efficient object detection in remote sensing images, meeting the demands of large-scale remote sensing  image processing . Firstly, through end-to-end training, the object detection network is optimized as a whole to directly output detection results from the input remote sensing images, eliminating the need for additional intermediate steps. This not only reduces the impact of information loss and inconsistency but also simplifies the entire detection process. Secondly, we integrate the Faster R-CNN architecture as the foundation, combining region extraction and object classification into a unified process. Lastly, we embed self-attention mechanisms at different levels of the Faster R-CNN to progressively extract multi-scale and multi-level feature information, enhancing the network's ability to learn the correlation of information from different positions in the image, automatically capturing the relationships between objects, and improving the accuracy of object detection. This significantly reduces redundant computation, making it more efficient for large-scale remote sensing image processing. Experimental verification demonstrates that this approach outperforms traditional methods in terms of detection accuracy and efficiency, better addressing the particularities of remote sensing images, and providing an efficient and precise solution for aerial drone and satellite image processing. Remote sensing image detection has become one of the research hotspots in the field of remote sensing, holding significant theoretical significance and practical application value.",
    "citation_count": "0",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Jing Li",
            "country": ""
        },
        {
            "name": "XiaoMeng Wei",
            "country": ""
        }
    ],
    "keywords": []
}