{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885617301531",
    "title": "Robust epipolar geometry estimation using noisy pose priors",
    "abstract": "Epipolar geometry  estimation is fundamental to many  computer vision  algorithms. It has therefore attracted a lot of interest in recent years, yielding high quality  estimation algorithms  for wide baseline image pairs. Currently many types of cameras such as smartphones produce geo-tagged images containing pose and internal  calibration data . These include a  GPS  receiver, which estimates the position, a compass,  accelerometers , and gyros, which estimate the orientation, and the focal length. Exploiting this information as part of an epipolar geometry estimation algorithm may be useful but not trivial, since the pose measurement may be quite noisy. We introduce SOREPP (Soft Optimization method for Robust Estimation based on Pose Priors), a novel estimation algorithm designed to exploit pose priors naturally. It sparsely samples the pose space around the measured pose and for a few promising candidates applies a robust  optimization procedure . It uses all the putative correspondences simultaneously, even though many of them are outliers, yielding a very efficient algorithm whose runtime is independent of the  inlier  fraction. SOREPP was extensively tested on  synthetic data  and on hundreds of real image pairs taken by smartphones. Its ability to handle challenging scenarios with extremely low inlier fractions of less than 10 %  was demonstrated. It outperforms current state-of-the-art algorithms that do not use pose priors as well as others that do.",
    "citation_count": "6",
    "year": "2017/11/01",
    "authors": [
        {
            "name": "Yehonatan Goldman",
            "country": ""
        },
        {
            "name": "Ehud Rivlin",
            "country": ""
        },
        {
            "name": "Ilan Shimshoni",
            "country": ""
        }
    ],
    "keywords": []
}