{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621002614",
    "title": "Spatial temporal and channel aware network for video-based person re-identification",
    "abstract": "As a challenging  computer vision task , video-based person Re-IDentification (Re-ID) has been intensively studied, and recent works have achieved a series of satisfactory results by capturing spatial temporal relationships. However, extensive observations have found that the same feature vector generated by a  convolutional neural network  contains considerable redundant information in the channel dimension. This issue is seldom investigated. A Spatial Temporal and Channel Aware Network (STCAN) for video-based ReID is studied in this paper. It jointly considers spatial temporal and channel information. Firstly, the  Spatial Attention  Enhanced (SAE)  convolutional network  is developed as the  backbone network  to learn spatial enhanced features from video frames. Secondly, a Channel Segmentation and Group Shuffle (CSGS) convolution module is designed to jointly address temporal and channel relations. Finally, a Two Branch Weighted Fusion (TBWF) mechanism is introduced to enhance the robustness of the Re-ID network by fusing the output of the SAE backbone network and CSGS. Comprehensive experiments are conducted on three large-scale datasets MARS, LSVID, and P-DESTRE. The experimental results imply that the STCAN can effectively improve the performance of video-based Re-ID and outperform several state-of-the-art methods.",
    "citation_count": "10",
    "year": "2022/02/01",
    "authors": [
        {
            "name": "Hui Fu",
            "country": ""
        },
        {
            "name": "Ke Zhang",
            "country": ""
        },
        {
            "name": "Haoyu Li",
            "country": ""
        },
        {
            "name": "Jingyu Wang",
            "country": ""
        },
        {
            "name": "Zhen Wang",
            "country": ""
        }
    ],
    "keywords": []
}