{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616302190",
    "title": "The Conflict Escalation Resolution (CONFER) Database",
    "abstract": "Conflict is usually defined as a high level of disagreement taking place when individuals act on incompatible goals, interests, or intentions. Research in human sciences has recognized conflict as one of the main dimensions along which an interaction is perceived and assessed. Hence, automatic estimation of conflict intensity in naturalistic conversations would be a valuable tool for the advancement of human-centered computing and the deployment of novel applications for  social skills  enhancement including conflict management and negotiation. However, machine analysis of conflict is still limited to just a few works, partially due to an overall lack of suitable annotated data, while it has been mostly approached as a conflict or (dis)agreement detection problem based on audio features only. In this work, we aim to overcome the aforementioned limitations by a) presenting the Conflict Escalation Resolution (CONFER) Database, a set of excerpts from audio–visual recordings of televised political debates where conflicts naturally arise, and b) reporting baseline experiments on audio–visual conflict intensity estimation. The database contains approximately 142   min of recordings in  Greek language , split over 120 non-overlapping episodes of naturalistic conversations that involve two or three interactants. Subject- and session-independent experiments are conducted on continuous-time (frame-by-frame) estimation of real-valued conflict intensity, as opposed to binary conflict/non-conflict classification. For the problem at hand, the efficiency of various audio and visual features and fusion of them as well as various regression frameworks is examined. Experimental results suggest that there is much room for improvement in the design and development of automated multi-modal approaches to continuous conflict analysis. The CONFER Database is publicly available for non-commercial use at  http://ibug.doc.ic.ac.uk/resources/confer/ .",
    "citation_count": "8",
    "year": "2017/09/01",
    "authors": [
        {
            "name": "Christos Georgakis",
            "country": ""
        },
        {
            "name": "Yannis Panagakis",
            "country": ""
        },
        {
            "name": "Stefanos Zafeiriou",
            "country": ""
        },
        {
            "name": "Maja Pantic",
            "country": ""
        }
    ],
    "keywords": []
}