{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300150",
    "title": "Two-stage quality adaptive fingerprint image enhancement using Fuzzy C-means clustering based fingerprint quality analysis",
    "abstract": "Fingerprint recognition  techniques are dependent on the quality of  fingerprint images . An efficient enhancement algorithm improves the performance of  recognition algorithms  for poor quality images.  Performance improvement  of the recognition algorithms will be more if the enhancement process is adaptive to the fingerprint qualities (wet, dry or normal). In this paper, a quality adaptive fingerprint enhancement algorithm is proposed. The proposed fingerprint quality assessment (FQA) algorithm assigns the appropriate quality class of dry, wet, normal dry, normal wet, and good quality using Fuzzy C-means  clustering technique  to each fingerprint image. It considers seven features namely, mean, moisture, variance, uniformity, contrast, ridge valley area uniformity (RVAU), and ridge valley uniformity (RVU) to cluster the  fingerprint images  into suitable quality class. Fingerprint images of each quality class undergo through a two-stage fingerprint quality enhancement (FQE) process. In the first stage, a quality adaptive preprocessing (QAP) method is used to preprocess the fingerprint images. Next, fingerprint images are enhanced with Gabor, short-term  Fourier transform  (STFT), and oriented  diffusion filtering  (ODF) based enhancement techniques in the second stage. Experimental evaluations are performed on a quality driven database of FVC 2004. Results show that the performance improvement of 1.54% to 50.62% for NBIS matcher and 1.66% to 8.95% for VeriFinger matcher are achieved while the QAP based approaches are used in comparison to the current state-of-the-art enhancement techniques. In addition, the experimentation is also performed on FVC 2002 database to validate the robustness and efficacy of the proposed method.",
    "citation_count": "33",
    "year": "2019/03/01",
    "authors": [
        {
            "name": "Ram Prakash Sharma",
            "country": ""
        },
        {
            "name": "Somnath Dey",
            "country": ""
        }
    ],
    "keywords": []
}