{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003226",
    "title": "Underwater image restoration based on light attenuation prior and color-contrast adaptive correction",
    "abstract": "Underwater imaging is uniquely beset by issues such as color distortion and diminished contrast due to the intricate behavior of light as it traverses water, being attenuated by processes of absorption and scattering. Distinct from traditional underwater image restoration techniques, our methodology uniquely accommodates attenuation coefficients pertinent to diverse water conditions. We endeavor to recover the pristine image by approximating decay rates, focusing particularly on the blue-red and blue-green color channels. Recognizing the inherent ambiguities surrounding water type classifications, we meticulously assess attenuation coefficient ratios for an array of predefined aquatic categories. Each classification results in a uniquely restored image, and an automated selection algorithm is employed to determine the most optimal output, rooted in its color distribution. In tandem, we've innovated a color-contrast adaptive correction technique, purposefully crafted to remedy color anomalies in underwater images while simultaneously amplifying contrast and detail fidelity. Extensive trials on benchmark datasets unambiguously highlight our method's preeminence over six other renowned strategies. Impressively, our methodology exhibits exceptional resilience and adaptability, particularly in scenarios dominated by green background imagery.",
    "citation_count": "1",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Jianru Li",
            "country": ""
        },
        {
            "name": "Xu Zhu",
            "country": ""
        },
        {
            "name": "Yuchao Zheng",
            "country": ""
        },
        {
            "name": "Huimin Lu",
            "country": ""
        },
        {
            "name": "Yujie Li",
            "country": ""
        }
    ],
    "keywords": []
}