{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621000962",
    "title": "Unsupervised cross-domain person re-identification with self-attention and joint-flexible optimization",
    "abstract": "Unsupervised domain adaptation  (UDA) for person re-identication (ReID) remains a challenging task, as the trained ReID system often fails to adapting to a new dataset. Due to the lack of supervision of real labels, the performance of the UDA models suffers from inefficient  feature learning  and inevitable pseudo label noise. In this work, we tackle the problems by designing an effective dual-path mutual-learning framework which can capture effective information for better feature learning and mitigate the impact of label noise. Firstly, to reduce the impact of occlusion and viewpoints, we introduce the self-attention mechanism in a two-stage strategy making the models focus on the key areas of identifying people. Secondly, considering that UDA is an open-set task, we leverage density-based spatial clustering of applications with noise (DBSCAN) to avoid manually setting the number of classes of the target domain. Thirdly, for realizing  joint  and flexible optimization under the supervision of soft pseudo labels and hard pseudo labels, a joint and flexible loss (JFL) is proposed to train the network. Experiments on three large-scale datasets show that our model outperforms the state-of-the-art UDA methods in both  mAP  and top-1 evaluation protocols by large margins. Especially on task of Duke-to-Market, our method outperforms the state-of-the-art by 6.9% mAP.",
    "citation_count": "5",
    "year": "2021/07/01",
    "authors": [
        {
            "name": "Haopeng Hou",
            "country": ""
        },
        {
            "name": "Yong Zhou",
            "country": ""
        },
        {
            "name": "Jiaqi Zhao",
            "country": ""
        },
        {
            "name": "Rui Yao",
            "country": ""
        },
        {
            "name": "Ying Chen",
            "country": ""
        },
        {
            "name": "Yi Zheng",
            "country": ""
        },
        {
            "name": "Abdulmotaleb El Saddik",
            "country": ""
        }
    ],
    "keywords": []
}