{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885622000786",
    "title": "Unsupervised multi-view stereo network based on multi-stage depth estimation",
    "abstract": "In current years, supervised learning multi-view stereo (MVS) methods have achieved impressive performance. However, these methods still suffer the limitation of hard to acquire large-scale depth supervision data, which hinders the  generalization ability  in never-seen-before scenarios. Recently, some unsupervised-learning methods have been proposed, which relieved the requirement of depth supervision data. However, the generated depth map with lower resolution since the memory consumption grows cubically. In this paper, we propose a novel unsupervised multi-view stereo network based on multi-stage depth estimation, which can increase depth map resolution and generate a dense 3D model with rich details without relying on depth supervision data. To reduce the 3D cost volume highly memory consumption, the progressive coarse-to-fine multiple stages are adopted. Besides, a multi-view group-wise correlation (MV-GwC) module is designed to introduce multi-view correlation prior, which can enhance network performance and further reduce memory consumption. Qualitative and quantitative experiment results show the effectiveness of our method. We outperform some previous supervised and unsupervised MVS methods on DTU and Tanks & Temples benchmarks.",
    "citation_count": "4",
    "year": "2022/06/01",
    "authors": [
        {
            "name": "Shuai Qi",
            "country": ""
        },
        {
            "name": "Xinzhu Sang",
            "country": ""
        },
        {
            "name": "Binbin Yan",
            "country": ""
        },
        {
            "name": "Peng Wang",
            "country": ""
        },
        {
            "name": "Duo Chen",
            "country": ""
        },
        {
            "name": "Huachun Wang",
            "country": ""
        },
        {
            "name": "Xiaoqian Ye",
            "country": ""
        }
    ],
    "keywords": []
}