{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001609",
    "title": "Unsupervised person re-identification by dynamic hybrid contrastive learning",
    "abstract": "Unsupervised person re-identification (re-ID) aims at cross-camera pedestrian retrieval without manual annotation. Recently, the  contrastive learning  has been introduced into the field of unsupervised person re-ID. However, existing methods usually focus only on mining the intra-category similarity and neglect the negative effects of clustering noise, which limits the performance in unsupervised person re-ID. In this paper, we propose a Dynamic Hybrid Contrastive Learning (DHCL) method for unsupervised person re-ID. Specifically, we perform the  clustering algorithm  and the dynamic  refinement policy  to divide the unlabeled training dataset into two subsets, i.e., clustered samples with pseudo labels and un-clustered independent instances, at each training epoch. Then, the proposed DHCL guides the  feature extraction network  to mine the intra-category similarity from the clustered samples by applying attraction within samples of the same cluster. Meanwhile, the inter-instance discrimination is also mined by pushing away different instances. Besides, we integrate the two levels of contrastive learning into an end-to-end framework and exploit the complementarity between them to improve the separability of the feature space. To reduce the negative effect of over-focusing on positive samples, a penalty item is added to the hybrid  contrastive loss . Extensive experiments demonstrate the effectiveness of the proposed method in unsupervised person re-ID.",
    "citation_count": "6",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Yu Zhao",
            "country": ""
        },
        {
            "name": "Qiaoyuan Shu",
            "country": ""
        },
        {
            "name": "Xi Shi",
            "country": ""
        },
        {
            "name": "Jian Zhan",
            "country": ""
        }
    ],
    "keywords": []
}