{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620301487",
    "title": "Variance-guided attention-based twin deep network for cross-spectral periocular recognition",
    "abstract": "Periocular region is considered as an important  biometric trait  due to its ease of  collectability  and high  acceptability  in our society. Recent advancements in surveillance applications require infra-red (IR) sensing equipments to be deployed in order to capture the activities occurring in low-light conditions. This gives rise to the problem of matching periocular images in heterogeneous environments as it is difficult to avail large enrollment datasets in IR modality within a short span of time. Although a number of approaches have studied cross-spectral matching of periocular images where a probe IR image is matched against enrolled dataset images in visible (VIS) domain and vice versa, significant amount of challenges still exists for such matching. In this paper, we propose an attention-based twin  deep convolutional neural network  (CNN) with shared parameters in order to match the periocular images in heterogeneous modality. We introduce a novel variance-guided objective function in conjunction with the attention module in order to guide the network to focus more into the relevant regions of the periocular images. The weights of the twin model based on the new objective function are learned so as to reduce the intra-class variance and to increase the inter-class variance of the cross-spectral image pairs. Ablation studies and experimental results on three publicly available cross-spectral periocular datasets containing images from VIS, near-infrared (NIR), and night vision domains show that the proposed deep network achieves the state-of-the-art recognition performances on all three datasets.",
    "citation_count": "17",
    "year": "2020/12/01",
    "authors": [
        {
            "name": "Sushree S. Behera",
            "country": ""
        },
        {
            "name": "Sapna S. Mishra",
            "country": ""
        },
        {
            "name": "Bappaditya Mandal",
            "country": ""
        },
        {
            "name": "Niladri B. Puhan",
            "country": ""
        }
    ],
    "keywords": []
}