{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620301402",
    "title": "Vehicle re-identification based on unsupervised local area detection and view discrimination",
    "abstract": "Vehicle re-identification is an important part of  intelligent transportation . Although much work has been done on this subject in recent years, vehicle re-identification is still a challenging task due to its obvious illumination change, high similarity between inter-class and great changes under different views. As discriminatory local areas and vehicle view information is the key to improving the above issues, it is desirable to create a model which considers both local details and cross-view situation. In this paper, we built a vehicle re-identification framework based on unsupervised local area detection and view discrimination. First, we combine the convolution features of multiple vehicle images by channel to generate  joint  channel features, and constructs a discriminating region detector unsupervised by clustering the channel covariance vectors generated between the joint channel features. In the next stage, the irregular shape detection results are converted to rectangular discriminative region by using a novel local region  integration algorithm . These rectangular discriminative regions are fed into a multi-branch network to extract the local–global features which contains rich detail information. Furthermore, we generate the view features by regarding the detected discriminative areas as  keypoints  and construct the unsupervised view  discriminator . By using the view information of the vehicle, we designed a view-discrimination based reranking algorithm, which effectively reduces the error rate of identification due to view variant. In order to prove the validity of our method, we have done extensive experiments on VehicleID and VERI-Wild dataset. Experimental results show that our method is superior to other existing vehicle re-identification algorithms.",
    "citation_count": "4",
    "year": "2020/12/01",
    "authors": [
        {
            "name": "Yuefeng Wang",
            "country": ""
        },
        {
            "name": "Huadong Li",
            "country": ""
        },
        {
            "name": "Ying Wei",
            "country": ""
        },
        {
            "name": "Chuyuan Wang",
            "country": ""
        },
        {
            "name": "Lin Wang",
            "country": ""
        }
    ],
    "keywords": []
}