{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1065-4",
    "title": "A Discretized Approach to Air Pollution Monitoring Using UAV-based Sensing",
    "abstract": "Recently, Unmanned Aerial Vehicles (UAVs) have become a cheap alternative to sense pollution values in a certain area due to their flexibility and ability to carry small sensing units. In a previous work, we proposed a solution, called Pollution-driven UAV Control (PdUC), to allow UAVs to autonomously trace pollutant sources, and monitor air quality in the surrounding area. However, despite operational, we found that the proposed solution consumed excessive time, especially when considering the battery lifetime of current multi-rotor UAVs. In this paper, we have improved our previously proposed solution by adopting a space discretization technique. Discretization is one of the most efficient mathematical approaches to optimize a system by transforming a continuous domain into its discrete counterpart. The improvement proposed in this paper, called PdUC-Discretized (PdUC-D), consists of an optimization whereby UAVs only move between the central tile positions of a discretized space, avoiding monitoring locations separated by small distances, and whose actual differences in terms of air quality are barely noticeable. We also analyze the impact of varying the tile size on the overall process, showing that smaller tile sizes offer high accuracy at the cost of an increased flight time. Taking into account the obtained results, we consider that a tile size of 100 × 100 meters offers an adequate trade-off between flight time and monitoring accuracy. Experimental results show that PdUC-D drastically reduces the convergence time compared to the original PdUC proposal without loss of accuracy, and it also increases the performance gap with standard mobility patterns such as Spiral and Billiard.",
    "citation_count": 31,
    "year": "2018/12",
    "authors": [
        {
            "name": "Alvear, Oscar",
            "country": "Ecuador"
        },
        {
            "name": "Calafate, Carlos T.",
            "country": "Spain"
        },
        {
            "name": "Zema, Nicola Roberto",
            "country": "Spain"
        },
        {
            "name": "Natalizio, Enrico",
            "country": "France"
        },
        {
            "name": "Hernández-Orallo, Enrique",
            "country": "France"
        },
        {
            "name": "Cano, Juan-Carlos",
            "country": "Spain"
        },
        {
            "name": "Manzoni, Pietro",
            "country": "Spain"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}