{
    "url": "https://link.springer.com/article/10.1007/s11036-006-0052-3",
    "title": "A Framework for JRRM with Resource Reservation and Multiservice Provisioning in Heterogeneous Networks",
    "abstract": "Inter-working and convergence of heterogeneous wireless networks are paving the way to scenarios in which end users will be capable of using simultaneously services through different Radio Access Technologies (RATs), by means of reconfigurable mobile terminals and different network elements. In order to exploit the potential of these heterogeneous networks scenarios, optimal RAT selection and resource utilization mechanisms are required. As a result, the heterogeneous networks are introducing a new dimension to the Radio Resource Management (RRM) problem, so that new algorithms dealing with the dissimilarities and complementarities of the multiple RATs from a joint perspective have to be considered. In this sense, this paper proposes a Joint Radio Resource Management (JRRM) strategy in a multi-RAT, multicellular and multiservice scenario. An approach based on Fuzzy Neural methodology is presented. Firstly, the way how the proposed Fuzzy Neural framework deals with the multiservice allocation in a heterogeneous scenario is presented. A reinforcement learning algorithm based on neural networks allows guaranteeing a multidimensional QoS focusing on those QoS requirements which mainly affect the user perception of the service. In addition to this, the performances obtained by the Fuzzy Neural JRRM for both real-time and non real-time services, are compared to the ones offered by alternative JRRM strategies. Secondly, special attention is paid to real-time services and to mechanisms to improve their performances. An approach based on predicting future JRRM decisions and on accordingly reserving radio resources for handoff calls is presented. Simulation results will show improvements in terms of both new connection blocking and handoff call dropping probabilities. Finally, the full set of results provides the sufficient insight into the problem to allow stating that the present Fuzzy Neural framework can be a firm candidate for JRRM.",
    "citation_count": 30,
    "year": "2006/12",
    "authors": [
        {
            "name": "Giupponi, Lorenza",
            "country": "Spain"
        },
        {
            "name": "Agustí, Ramon",
            "country": "Spain"
        },
        {
            "name": "Pérez-Romero, Jordi",
            "country": "Spain"
        },
        {
            "name": "Sallent, Oriol",
            "country": "Spain"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}