{
    "url": "https://link.springer.com/article/10.1007/BF01193264",
    "title": "A hybrid handover protocol for local area wireless ATM networks",
    "abstract": "While handovers of voice calls in a wide area mobile environment are well understood, handovers of multi-media traffic in a local area mobile environment is still in its early stage of investigation. Unlike the public wireless networks, handovers for multi-media Wireless LANs (WLANs) have special requirements. In this paper, the problems and challenges faced in a multi-media WLAN environment are outlined and a multi-tier wireless cell clustering architecture is introduced. Design issues for multi-media handovers are specified and a fast, continuous and efficient hybrid handover protocol is proposed. The protocol is scalable and supports source and destination mobile handovers in a mutually exclusive manner. Crossover switch (CX) discovery is also introduced to support fast inter-cluster handovers with consideration given to Mobile Quality of Service (M-QoS). The resulting wireless ATM LAN exhibits a distributed mobile location management, call admission control and handover management architecture. A prototype of the proposed handover protocol is implemented into a Cambridge Fairisle ATM switch and the results of handovers for a single Mobile Host (MH) with a single on-going connection are evaluated. It was found that implementing transport mobility for a wireless ATM environment is not practical as the cell re-routing function changes the traffic characteristics and is not scalable to increasing cell rate and to the number of mobile connections. The data-link layer mobility implementation however, is found to work well. The protocol provides symmetric data disruption to traffic flows in both directions and up to seventy-five intra-cluster handovers can be supported in a second. Throughout the experiment, cells arrive in sequence with no cell loss observed during the handover, up to the capacity limit of the ATM switch. Finally, ‘zig-zag’ handovers and handovers for a single MH with multiple on-going unicast connections are performed in order to evaluate the robustness and performance of the protocol under different MHs' migration and communication environment.",
    "citation_count": 46,
    "year": "1996/10",
    "authors": [
        {
            "name": "Toh, Chai-Keong",
            "country": "UK"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}