{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02172-0",
    "title": "A Model for Digital Education Management Information System Using Wireless Communication and BP Neural Networks",
    "abstract": "With the popularity of wireless communication and different mobile intelligent terminals, digital education management information systems are becoming increasingly popular among students. The problem of modernized teaching has significantly influenced and altered teaching quality evaluation methodologies and models. However, the findings revealed that the existing intelligent teaching quality diagnostic still needs to improve design and execution. As a result, creating an education management information system is critical, and establishing a digital education management information system has become a critical undertaking. To address these problems, this research paper presents a model for a digital education management information system (DEMIS) that utilizes wireless communication and BP neural networks (BPNNs) to manage digital education in schools. The paper highlights the significance of wireless communication and DEMIS in modern education. The study employs a grey prediction model and a BP neural network model to predict the trend of education development. The DEMIS is set up using MATLAB simulation with management constraint parameters, and the sample data originate from 85 instructors’ digital education assessment ratings. The experiment is carried out in two parts: using the grey prediction model and the BPNNs, which verify the suggested method’s efficacy in managing digital education in schools. The experimental findings suggest that, by combining wireless communication and BPNNs, the system can handle the campus network’s information in a unified manner and give decision assistance to managers, which is very practicable. Therefore, the suggested DEMIS may effectively enhance students’ learning experiences and education quality.",
    "citation_count": 26,
    "year": "2023/12",
    "authors": [
        {
            "name": "Wangang, Cai",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}