{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01213-x",
    "title": "A Novel Visual Medical Image Encryption for Secure Transmission of Authenticated Watermarked Medical Images",
    "abstract": "Secure medical data transmission is the important criteria in tele-medicine. It is helpful for getting the exact medical information at the remote specialist’s side from the local doctor. The medical image watermarking technique is used for secure medical data transmission. Electronic patient record (EPR) is embedded within the original medical image to produce the watermarked medical image for protecting the patient information. The watermarked medical image visually looks like the original medical image. Hence the attacker visually knows the medical image transmission and easily attacks the system. To avoid this situation, image encryption technique is used to change the visual structure of the watermarked medical image. Normal image encryption gives the noise-like or texture-like unknown image format which indicates an existence of some secret information as the encrypted image. To overcome this problem, this paper proposed a visual medical image encryption technique to protect the existence of the watermarked medical image. And to ensure the source authentication, a biometric based authentication is also proposed. The watermarked medical image is encrypted using the proposed visually meaning full image encryption along with the fingerprint image. Experimental results prove that the proposed method yields good results and mitigate the attacker challenges.",
    "citation_count": 31,
    "year": "2021/12",
    "authors": [
        {
            "name": "Priya, S.",
            "country": "India"
        },
        {
            "name": "Santhi, B.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}