{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01384-7",
    "title": "A Statistical Lower UWB Channel Model for in Body Communications",
    "abstract": "Applications of implantable micro-level wireless devices in the instantaneous collection and observation of body potentials of patients is becoming prominent nowadays. The license free radio band that is reserved internationally for industrial, scientific, and medical purposes (ISM) is being used currently for the above telemedicine applications. However, for short distance higher bit rate applications such as capsule endoscopy, the ultra-wide band (UWB) of frequencies is found as much suitable, since base band communication with less complex transceivers is possible due to its noise like behavior. But before developing any wireless network, it is necessary to characterize the radio channel accurately. In Body Area Network (BAN) with implantable low power and high data rate transceivers, on site measurement is not practically feasible. Therefore, easy to use statistical models that are derived from the measurement data are preferred. In this paper, authors introduce honey as an easily available and less expensive base, through a study of its dielectric properties, for preparing body mimicking liquid phantoms. In addition, this paper proposes an empirical in-body UWB channel model to determine the possible pathloss in the human abdominal region. The empirical pathloss data, which have been collected with the above liquid phantoms that mimic the biological tissues in lower UWB i.e. 3.1&nbsp;GHz – 9&nbsp;GHz frequency range are used to derive the proposed model.",
    "citation_count": 21,
    "year": "2019/12",
    "authors": [
        {
            "name": "Thirumaraiselvan, P.",
            "country": "India"
        },
        {
            "name": "Sakthidasan @ Sankaran, K.",
            "country": "India"
        },
        {
            "name": "Geo, V. Beslin",
            "country": "India"
        },
        {
            "name": "Prakash, V. R.",
            "country": "India"
        },
        {
            "name": "Vasudevan, N.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}