{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02272-x",
    "title": "A Task Offloading Algorithm using Multi-Objective Optimization under Hybrid Mode in Mobile Edge Computing",
    "abstract": "In mobile edge computing (MEC), edge clients have the capability to offload their computing tasks to edge servers or other edge clients, aiming to reduce their energy consumption and latency. However, the process of offloading introduces additional energy consumption and time due to long-distance network transmission, which presents a significant challenge in jointly minimizing energy consumption and latency for edge clients. To address this challenge, we formulate the problem as a constrained multi-objective optimization problem and propose an enhanced multi-objective evolutionary algorithm, named MOEA-TOMEC, to determine optimal task offloading strategies in MEC. The proposed algorithm aims to minimize both the extra energy consumption and latency. To overcome the limitations of a single offloading mode in complex network environments, we introduce a hybrid offloading mode within our algorithm. This hybrid approach combines partial offloading and full offloading to achieve lower energy consumption and latency. Additionally, we propose a device classification algorithm that plays a crucial role in initializing the population. This algorithm incorporates low-battery devices as relays in the offloading decisions, thereby enhancing population diversity. By generating a superior initial population and expanding the breadth of the learning space, our proposed algorithm achieves improved performance. Experimental results demonstrate the effectiveness of our proposed algorithm. In comparison to existing algorithms, our approach reduces the energy consumption and latency of edge clients by an average of 9.13% and 13.91%, respectively.",
    "citation_count": 51,
    "year": "2024/10",
    "authors": [
        {
            "name": "Hou, Haole",
            "country": "China"
        },
        {
            "name": "Chai, Zhengyi",
            "country": "China"
        },
        {
            "name": "Liu, Xu",
            "country": "China"
        },
        {
            "name": "Li, Yalun",
            "country": "China"
        },
        {
            "name": "Zeng, Yue",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}