{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0824-y",
    "title": "A Two-Stages Relay Selection and Resource Allocation with Throughput Balance Scheme in Relay-Assisted D2D System",
    "abstract": "Introducing relay node to Device-to-Device (D2D) technology can extend the cell coverage range and improve the system performance. In this paper, we discuss a relay-assisted D2D communication underlaying cellular network from two aspects. Firstly, we discuss relay selection problem. A two-stages relay selection and resource allocation method is proposed. The stage 1 determines the range of candidate relay UEs through an area division method. Through this way, signaling overhead and measurement overhead can be reduced. The stage 2 selects an optimal relay UE from candidate relay UEs and determines the resource allocation method using an optimal bipartite matching theory with a pretty low complexity. Secondly, we find that the two-stages method causes a throughput unbalance and resource waste problem. Therefore, throughput balance is investigated in this paper. Eight throughput balance options are discussed in details. Then, three throughput balance schemes are proposed. The two-stages method and three throughput balance schemes are evaluated by simulation. Simulation results show that the proposed two-stages method can improve the throughput of relay-assisted D2D communication with a low signaling overhead and measurement overhead. Three proposed throughput balance schemes can improve system throughput performance further.",
    "citation_count": 22,
    "year": "2017/12",
    "authors": [
        {
            "name": "Gu, Xinyu",
            "country": "China"
        },
        {
            "name": "Zhao, Ming",
            "country": "China"
        },
        {
            "name": "Ren, Luming",
            "country": "China"
        },
        {
            "name": "Wu, Di",
            "country": "China"
        },
        {
            "name": "Nie, Shiwen",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}