{
    "url": "https://link.springer.com/article/10.1007/s11036-006-0050-5",
    "title": "Adaptive Resource Management Platform for Reconfigurable Networks",
    "abstract": "Users’ expectations towards technology, in terms of quality, service availability and accessibility are ever increasing. Aligned with this, the wireless world is rapidly moving towards the next generation of systems, featuring cooperating and reconfiguring capabilities for coexisting (and upcoming) Radio Access Technologies (RATs), so that to improve connectivity and reduce costs. In this respect, conventional planning and management techniques ought to be replaced by advanced schemes that consider multidimensional characteristics, increased complexity and high speeds. To this effect, means are needed capable to support scalability and to cater for advanced service features, provided to users at high rates and cost-effectively. This article provides a scheme to optimize resource management in future systems, by describing a platform that accommodates engineering mechanisms that deal with dynamic, demand driven planning and managing of spectrum and radio resources in reconfigurable networks. To do so, it first discusses the fundamentals and the approach followed in the proposed architecture and then investigates the basic functional modules. The architecture is validated through a set of use-cases that exemplify the operational applicability and efficiency in a wide range of communication scenarios.",
    "citation_count": 29,
    "year": "2006/12",
    "authors": [
        {
            "name": "Dimitrakopoulos, George",
            "country": "Greece"
        },
        {
            "name": "Moessner, Klaus",
            "country": "UK"
        },
        {
            "name": "Kloeck, Clemens",
            "country": "Germany"
        },
        {
            "name": "Grandblaise, David",
            "country": "France"
        },
        {
            "name": "Gault, Sophie",
            "country": "France"
        },
        {
            "name": "Sallent, Oriol",
            "country": "Spain"
        },
        {
            "name": "Tsagkaris, Kostas",
            "country": "Greece"
        },
        {
            "name": "Demestichas, Panagiotis",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}