{
    "url": "https://link.springer.com/article/10.1007/s11036-008-0093-x",
    "title": "An Inter-cluster Communication based Energy Aware and Fault Tolerant Protocol for Wireless Sensor Networks",
    "abstract": "The ambient intelligence paradigm is built upon Ubiquitous Computing (UC), in which the computing devices are embedded in the environment with the purpose of enhancing the human experience at home, workplace/office, learning, health care etc. The UC applications aim at providing services to the users anywhere, anytime in an unobtrusive, seemingly invisible way. Wireless sensor networks (WSNs) have great potential for UC applications and are envisioned to revolutionize them. This paper presents a clustering routing protocol for event-driven, query-based and periodic WSNs. The protocol aims at optimizing energy dissipation in the network as well as providing network’s fault tolerance and connectivity. Message propagation is accomplished by using short distance transmissions by employing nearest neighbor nodes between neighboring clusters. Moreover, the algorithm proposes using an energy efficient approach by alternating the nodes responsible for inter-cluster communication inside one cluster. The algorithm also aims at even energy dissipation among the nodes in the network by alternating the possible routes to the Sink. This helps to balance the load on sensor nodes and increases the network lifetime, while avoiding congested links at the same time. We discuss the implementation of our protocol, present its proof of correctness as well as the performance evaluation through an extensive set of simulation experiments.",
    "citation_count": 18,
    "year": "2008/12",
    "authors": [
        {
            "name": "Boukerche, Azzedine",
            "country": "Canada"
        },
        {
            "name": "Martirosyan, Anahit",
            "country": "Canada"
        },
        {
            "name": "Pazzi, Richard",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}