{
    "url": "https://link.springer.com/article/10.1023/B:MONE.0000042495.27538.af",
    "title": "Auction-Based Resource Reservation in 2.5/3G Networks",
    "abstract": "We consider UMTS networks in which users request services other than telephony that last for long time intervals: e.g., video clips that last for several minutes. The duration of network time-slots over which resource units are allocated is much shorter. This complicates consistent reservation of resources over longer time scales, where consistent reservation is required to ensure that service quality is constant throughout the entire service session. In this paper, we define an auction-based mechanism for nearly consistent reservation of the resources of a UMTS (or GPRS) network by the users that value them the most, in order to satisfy the longer time scale requirements of their service sessions. Each of these sessions has a fixed target bit-rate. The mechanism is based on a series of Generalized Vickrey Auctions and a set of predefined user utility functions that we propose. Bidding is performed automatically on behalf of the users on the basis of each user's selection of one of these utility functions and his declaration of a total willingness to pay. We argue that under our mechanism the user does not have a clear incentive of not performing a truthful selection of a bidding function according to his own utility. The utility functions we define express appropriately the preferences of the users with respect to the resource allocation pattern in the cases where perfectly consistent allocation cannot be attained. We also provide a mapping of these functions to the UMTS service classes. The effectiveness of our resource reservation mechanism is demonstrated by means of experiments. It appears that most of the users either are served very satisfactorily or essentially are not served at all. The mechanism is implemented at the network base station, and is applicable in practical cases of networks with large numbers of users whose sessions last for many slots.",
    "citation_count": 12,
    "year": "2004/12",
    "authors": [
        {
            "name": "Dramitinos, Manos",
            "country": "Greece"
        },
        {
            "name": "Stamoulis, George D.",
            "country": "Greece"
        },
        {
            "name": "Courcoubetis, Costas",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}