{
    "url": "https://link.springer.com/article/10.1007/s11036-024-02347-3",
    "title": "Comparative analysis of fractal antennae for sub-6 GHz and 5G bands for wireless and IoT applications",
    "abstract": "This paper proposes a comparative analysis of fractal antennas with a height of 1.6&nbsp;mm for use in multiple bands; simulation results show that the gain of the proposed antenna is increased to 5 dBi. The proposed antenna covers high gain characteristics due to its 5dBi gain. The designed antenna radiates power with a directivity of 7.44 dBi. The proposed antenna with quad bands has more radiation concerning frequencies 2.2&nbsp;GHz, 2.92&nbsp;GHz, 4.1&nbsp;GHz, and 7.5&nbsp;GHz with Phi = 0° and Phi = 90°. The proposed antenna has four resonate notches at 2.2&nbsp;GHz, 2.92&nbsp;GHz, 4.1&nbsp;GHz, and 7.5&nbsp;GHz, respectively. The return loss of the proposed antenna is 14.3&nbsp;dB, 16.9&nbsp;dB, 16.4&nbsp;dB, and 21&nbsp;dB. The bandwidth percentages for applications covered as S-band, C-band, 5G band, etc., in the frequency range of 2.1&nbsp;GHz and 2.3&nbsp;GHz, 2.8&nbsp;GHz and 3.1&nbsp;GHz, 3.6&nbsp;GHz and 4.6&nbsp;GHz, and 7.1&nbsp;GHz-7.9&nbsp;GHz are 9%, 10.1%, 24%, and 10.6%, respectively. It also covers 4G, S-band like weather radar and satellite communications, and X-band applications in the frequency range of 2.1&nbsp;GHz to 2.3&nbsp;GHz, 2.8&nbsp;GHz to 3.1&nbsp;GHz,3.6&nbsp;GHz to 4.6&nbsp;GHz and 7.1&nbsp;GHz to 7.9&nbsp;GHz. The proposed antenna has been designed using IE3D, and has been verified using the Key-Sight VNA and Spectrum analyzer in presense of absorber.",
    "citation_count": 51,
    "year": "2023/12",
    "authors": [
        {
            "name": "Raj, Arun",
            "country": "India"
        },
        {
            "name": "Mandal, Durbadal",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}