{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01338-z",
    "title": "Control Code Multiple Encryption Algorithm on Satellite-to-ground Communication",
    "abstract": "The transmission security between ground station and satellite is challenging. Some existing multistep algorithms leave lots of loopholes for eavesdropping and attacking in satellite-to-ground communication. For high security, optical communication is a promising solution. In this paper, we propose a control code multiple encryption algorithm (CCMEA) for the single-photon-transmission between satellite and ground station. CCMEA can utilize the control code to respectively encrypt three cognitive optimization sections: loop iteration, polarization coding and order rearrangement, and simulation shows that CCMEA can realize one step transmission to decrease loopholes compared with multistep encryption algorithm. In addition, we design a security detection method by combining the decoy photon analysis and the quantum bit error rate (QBER) analysis. The numerical results show that CCMEA can reduce the security threshold by 27% compared with multistep encryption algorithm of BB84 scheme. Finally, for satellite-to-ground communication, we construct an analytic QBER model on CCMEA with four factors: quantum channel transmission rate, single-photon acquisition probability, measurement factor and data filtering factor. The result demonstrates the effectiveness of CCMEA on satellite-to-ground communication.",
    "citation_count": 33,
    "year": "2019/12",
    "authors": [
        {
            "name": "Liu, Jinlong",
            "country": "China"
        },
        {
            "name": "Yang, Zhutian",
            "country": "China"
        },
        {
            "name": "Wu, Zhilu",
            "country": "China"
        },
        {
            "name": "Yin, Zhendong",
            "country": "China"
        },
        {
            "name": "Jiang, Xu",
            "country": "China"
        },
        {
            "name": "Fu, Yanyuan",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}