{
    "url": "https://link.springer.com/article/10.1007/s11036-020-01656-7",
    "title": "Deep Learning and Dempster-Shafer Theory Based Insider Threat Detection",
    "abstract": "Organizations’ own personnel now have a greater ability than ever before to misuse their access to critical organizational assets. Insider threat detection is a key component in identifying rare anomalies in context, which is a growing concern for many organizations. Existing perimeter security mechanisms are proving to be ineffective against insider threats. As a prospective filter for the human analysts, a new deep learning based insider threat detection method that uses the Dempster-Shafer theory is proposed to handle both accidental as well as intentional insider threats via organization’s channels of communication in real time. The long short-term memory (LSTM) architecture together with multi-head attention mechanism is applied in this work to detect anomalous network behavior patterns. Furthermore, belief is updated with Dempster’s conditional rule and utilized to fuse evidence to achieve enhanced prediction. The CERT Insider Threat Dataset v6.2 is used to train the behavior model. Through performance evaluation, our proposed method is proven to be effective as an insider threat detection technique.",
    "citation_count": 50,
    "year": "2024/10",
    "authors": [
        {
            "name": "Tian, Zhihong",
            "country": "China"
        },
        {
            "name": "Shi, Wei",
            "country": "Canada"
        },
        {
            "name": "Tan, Zhiyuan",
            "country": "UK"
        },
        {
            "name": "Qiu, Jing",
            "country": "China"
        },
        {
            "name": "Sun, Yanbin",
            "country": "China"
        },
        {
            "name": "Jiang, Feng",
            "country": "China"
        },
        {
            "name": "Liu, Yan",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}