{
    "url": "https://link.springer.com/article/10.1007/s11036-020-01609-0",
    "title": "Doppler Compensation of Orthogonal Frequency Division Multiplexing for Ocean Intelligent Multimodal Information Technology",
    "abstract": "The era of intelligence has arrived. Intelligent multimodal information is essential for underwater engineering. Sound is an indispensable medium in underwater multi-modal information technology. Orthogonal frequency division multiplexing underwater acoustic communication technology can achieve high bit rate communication. However, the time-varying Doppler of the underwater acoustic channel will cause inter carrier interference in the OFDM system, destroy the orthogonality between subcarriers, and affect system performance. In this paper, we propose a method based on wavelet function to compensate for the Doppler distortions of the underwater acoustic channel for OFDM data. This method uses a set of orthogonal polynomials to perform channel estimation in both the time and frequency domains and uses the matched filtering for channel equalization. Compared with the traditional polynomials, the smoothly varying polynomials in Wavelet FFT greatly reduces the correlation of the processed data, enable more accurate channel estimation and equalization. Finally, this paper verifies the feasibility of the algorithm through the Songhua Lake underwater experiment.",
    "citation_count": 26,
    "year": "2020/12",
    "authors": [
        {
            "name": "Ma, Xuefei",
            "country": "China"
        },
        {
            "name": "Wang, Tingting",
            "country": "China"
        },
        {
            "name": "Li, Lei",
            "country": "China"
        },
        {
            "name": "Raza, Waleed",
            "country": "China"
        },
        {
            "name": "Wu, Zhiqiang",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}