{
    "url": "https://link.springer.com/article/10.1007/s11036-022-02027-0",
    "title": "Dynamic Emergency Transit Forecasting with IoT Sequential Data",
    "abstract": "Medical emergency transit counts minutes as real human lives. It is important to plan emergency transport routes according to real-time traffic flow status which leads to the the essential requirement of correct dynamic traffic prediction. Many Internet of Things (IoT) devices have been employed to assist emergency transit. Dynamic traffic flow patterns can be better predicted using data given by those devices. In small cities, however, the data are sent into separated management offices or just saved inside edge devices due to system compatibility or the cost of mobile network to computer centres. This condition leads to small and local datasets. Making full use of small local data to conduct prediction is one way to solve local emergency planning problems. In this work, we design a dynamic graph structure to work with Graph Neural Network (GNN) algorithm to forecast traffic flow levels considering this scenario. The proposed graph considers both geographical and time information with the potential to grow within a local mobile communication network. The commonly used Extreme Gradient Boosting (XGBoost) is included in the comparison. Experimental results show that our new design provides high prediction efficiency and accuracy.",
    "citation_count": 41,
    "year": "2023/12",
    "authors": [
        {
            "name": "Sun, Bin",
            "country": "China"
        },
        {
            "name": "Geng, Renkang",
            "country": "China"
        },
        {
            "name": "Shen, Tao",
            "country": "China"
        },
        {
            "name": "Xu, Yuan",
            "country": "China"
        },
        {
            "name": "Bi, Shuhui",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}