{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02158-y",
    "title": "Enhancing Security of Medical Images Using Deep Learning, Chaotic Map, and Hash Table",
    "abstract": "The advancement in technology with high computing power leads to many security attacks. Thus, the demand for innovative security algorithms is also rising. In the healthcare system, medical images are very important to diagnose many diseases and these images are being sent over the internet. As a result, they must be secured from cyber-attacks. Therefore, concerns about security and storage volume must be efficiently addressed in medical images by developing a secure cryptography algorithm. The traditional cryptographic techniques for medical images are inefficient, as well as algorithmic complexity is high. This paper proposes a novel Generative Adversarial Network (GAN) model to enhance the security of medical images by using a 2D chaotic map, hash-table, and Deep Learning (DL). Here, the proposed method uses the hash-table-based equation with a 2D-chaotic map to improve the entropy of the key. In the proposed encryption process, two levels of confusion and diffusion are performed using Mersenne Twister (MT) and the Hénon map. Here, the Differential Huffman Compression (DHC) method is used for lossless compression of encrypted medical images. The proposed model has been tested on different medical images, and it has been evaluated using different performance metrics, such as key space, entropy, correlation analysis, robustness analysis, and similarity analysis. The results of the proposed model outperform the other related schemes.",
    "citation_count": 44,
    "year": "2024/10",
    "authors": [
        {
            "name": "Kumar, Piyush",
            "country": "India"
        },
        {
            "name": "Rahman, Mobashshirur",
            "country": "India"
        },
        {
            "name": "Namasudra, Suyel",
            "country": "India"
        },
        {
            "name": "Moparthi, Nageswara Rao",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}