{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1111-2",
    "title": "Extraction of GGO Candidate Regions on Thoracic CT Images using SuperVoxel-Based Graph Cuts for Healthcare Systems",
    "abstract": "In this paper, we propose a method to reduce artifacts on temporal difference images by improving the conventional method using a non-rigid registration method for ground glass opacification (GGO), which is light in concentration and difficult to detect early. In this method, global matching, local matching, and 3D elastic matching are performed on the current image and past image, and an initial temporal difference image is generated. After that, we use an Iris filter, which is the gradient vector concentration degree filter, to determine the initial GGO candidate regions and perform segmentation using SuperVoxel and Graph Cuts in which a superpixel is extended to three dimensions for each region of interest. For each extracted region, a support vector machine (SVM) is used to reduce the over-segmentation. Finally, in the method that greatly reduces artifacts other than the remaining GGO candidate regions, Voxel Matching is applied to generate the final temporal difference image, emphasizing the GGO regions while reducing the artifact. The resulting ratio of artifacts to lung volume is 0.101 with an FWHM of 28.3, which is an improvement over the conventional method and shows the proposed method’s effectiveness.",
    "citation_count": 25,
    "year": "2018/12",
    "authors": [
        {
            "name": "Lu, Huimin",
            "country": "Japan"
        },
        {
            "name": "Kondo, Masashi",
            "country": "Japan"
        },
        {
            "name": "Li, Yujie",
            "country": "Japan"
        },
        {
            "name": "Tan, JooKooi",
            "country": "Japan"
        },
        {
            "name": "Kim, Hyoungseop",
            "country": "Japan"
        },
        {
            "name": "Murakami, Seiichi",
            "country": "Japan"
        },
        {
            "name": "Aoki, Takotoshi",
            "country": "Japan"
        },
        {
            "name": "Kido, Shoji",
            "country": "Japan"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}