{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02168-w",
    "title": "Fault Tolerance in Electric Vehicles Using Deep Learning for Intelligent Transportation Systems",
    "abstract": "Intelligent transportation systems (ITS) such as hybrid electric vehicles make use of sensing technologies to improve mobility, safety and efficiency. Automated manual transmission (AMT) is a mechatronic device consisting of Internet of Things (IoT)-enabled sensors and actuators responsible for automatic gear shifting in hybrid electric vehicles. Any failure in these sensors or actuators can affect the normal operation of vehicles. Therefore, this study aims to discuss the characteristics of AMT when it breaks down and its impact on the whole hybrid electric vehicle system. Firstly, this paper briefly introduces the relevant overview of hybrid electric vehicles and AMT. Next, analytical redundancy analysis is used to find out the possible faults of each part of AMT and the causes of each fault. The normal and faulty signals are then passed to a reduced depth kernel extreme learning machine (RDK-ELM) algorithm, which combines the deep learning network structure with the kernel-based selection of support vectors from the training samples. The RDK-ELM is a fault diagnosis algorithm that classifies the normal and faulty signals, which represent whether the sensor is faulty or not. Simulation results show that the algorithm has high classification accuracy of 97.12% and it requires less time for training the model.",
    "citation_count": 20,
    "year": "2023/12",
    "authors": [
        {
            "name": "Liu, Huanxue",
            "country": "China"
        },
        {
            "name": "Ke, Fengqin",
            "country": "China"
        },
        {
            "name": "Zhang, Zhenzhong",
            "country": "China"
        },
        {
            "name": "Gao, Yanan",
            "country": "China"
        },
        {
            "name": "Zhang, Quanyu",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}