{
    "url": "https://link.springer.com/article/10.1007/s11036-020-01590-8",
    "title": "Gesture Recognition Through sEMG with Wearable Device Based on Deep Learning",
    "abstract": "It is conducive to the application of sEMG signals in helping disabled people through combining wearable devices with deep learning. Therefore, design of sEMG gesture recognition system using deep learning based on wearable device is proposed in this paper. The system is mainly consisted of wearable sEMG acquisition device and sEMG gesture recognition method based on deep learning. In the wearable sEMG acquisition device, the sEMG signal sensor is mainly used to convert the human bioelectrical signal into an analog electrical signal. Then it can be acquired using an analog to digital converter. We also use 2.4 GHz wireless communication for data transmission, and use the micro-controller as the core of system control and data processing. In the sEMG gesture recognition method, we designed a model of sEMG signal gesture classification based on convolutional neural network (CNN). It can avoid omission of important feature information and improve accuracy of recognition, effectively. In the experimental part, we collected the sEMG signals of three different gestures using our own wearable sEMG acquisition device. Then, we trained and evaluated on the designed sEMG gesture recognition model using these data. A recognition accuracy of about 79.43% can be achieved in three gestures. Finally, we trained and tested the sEMG gesture recognition model on the Ninapro DB5 dataset and can reach about 74.51% accuracy on 52 gestures. In the case that there are more types of gestures recognized, our accuracy is still 5.02%, 6.61%, and 2.58% higher than Linear Discriminant Analysis (LDA), Support Vector Machine (SVM), and Long Short Term Memory-CNN (LCNN), respectively. Also, the accuracy rate is 5.47% higher than SVM and Random Forests.",
    "citation_count": 21,
    "year": "2020/12",
    "authors": [
        {
            "name": "Shen, Shu",
            "country": "China"
        },
        {
            "name": "Gu, Kang",
            "country": "China"
        },
        {
            "name": "Chen, Xin-Rong",
            "country": "China"
        },
        {
            "name": "Lv, Cai-Xia",
            "country": "China"
        },
        {
            "name": "Wang, Ru-Chuan",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}