{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0979-6",
    "title": "Intelligent Technique for Seamless Vertical Handover in Vehicular Networks",
    "abstract": "Seamless mobility is a challenging issue in the area of research of vehicular networks that are supportive of various applications dealing with the intelligent transportation system (ITS). The conventional mobility management plans for the Internet and the mobile ad hoc network (MANET) is unable to address the needs of the vehicular network and there is severe performance degradation because of the vehicular networks’ unique characters such as high mobility. Thus, vehicular networks require seamless mobility designs that especially developed for them. This research provides an intelligent algorithm in providing seamless mobility using the media independent handover, MIH (IEEE 802.21), over heterogeneous networks with different access technologies such as Worldwide Interoperability for Microwave Access (WiMAX), Wireless Fidelity (Wi-Fi), as well as the Universal Mobile Telecommunications System (UMTS) for improving the quality of service (QoS) of the mobile services in the vehicular networks. The proposed algorithm is a hybrid model which merges the biogeography-based optimization or BBO with the Markov chain. The findings of this research show that our method within the given scenario can meet the requirements of the application as well as the preferences of the users.",
    "citation_count": 56,
    "year": "2018/12",
    "authors": [
        {
            "name": "Goudarzi, Shidrokh",
            "country": "Malaysia"
        },
        {
            "name": "Hassan, Wan Haslina",
            "country": "Malaysia"
        },
        {
            "name": "Anisi, Mohammad Hossein",
            "country": "UK"
        },
        {
            "name": "Khan, Muhammad Khurram",
            "country": "Saudi Arabia"
        },
        {
            "name": "Soleymani, Seyed Ahmad",
            "country": "Malaysia"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}