{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0923-9",
    "title": "Joint Active Duty Scheduling and Encoding Rate Allocation Optimized Performance of Wireless Multimedia Sensor Networks in Smart Cities",
    "abstract": "In smart cities, wireless multimedia sensor networks (WMSNs) and mobile cellular networks (MCNs) play an important role in surveillance and management of living environment, i.e., structural health of buildings, urban transportation, and potential locations of future crime, etc. In WMSNs, the camera sensors (CSs) can capture multimedia contents from particular areas, packetize and transmit them to the cluster heads (CHs). The multimedia contents are then forwarded by the CHs, to the base stations (BSs) in MCNs, for monitoring and analyzing. The most challenge is that on the one hand, streaming multimedia contents at high data rate for high playback quality demands, particularly in video streaming applications, requires huge amounts of bandwidth and energy consumption. On the other hand, the wireless channels are inherently varying lossy and the CSs and the CHs are equipped with energy- and bandwidth-constrained capacity. In addition, due to high density of CSs deployed, many of them may monitor the same areas and capture many videos with high correlation, causing numerous redundant contents sent to the BSs, and thus more energy and bandwidth resources are wasted. In this paper, we propose a joint active duty scheduling and encoding rate allocation (ADS-ERA) model to optimize the performance of WMSNs. In particular, the ADS-ERA can minimize the capture, packetization, and transmission energy consumption while satisfying given limited bandwidth and high playback quality constraints. The ADS optimization problem is formulated and solved for optimally scheduling the active duties of the CSs to capture the videos with minimum capture energy consumption. By taking into the constraints on bandwidth and quality, we further formulate the ERA optimization problem and solve it for optimally allocating the encoding rates of the captured videos so that they are packetized and transmitted with minimum energy consumption. Simulation results demonstrate that the proposed ADS-EAR model significantly gain high performance of WMSNs, i.e., minimizing the consumption of capture, packetization, and transmission energy, utilizing the limited bandwidth efficiently, and providing high playback quality of received videos at the BSs.",
    "citation_count": 33,
    "year": "2018/12",
    "authors": [
        {
            "name": "Vo, Nguyen-Son",
            "country": "Vietnam"
        },
        {
            "name": "Nguyen, Thanh-Hieu",
            "country": "Vietnam"
        },
        {
            "name": "Nguyen, Huu Khuong",
            "country": "Vietnam"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}