{
    "url": "https://link.springer.com/article/10.1007/s11036-005-4442-8",
    "title": "Lightweight Deployment-Aware Scheduling for Wireless Sensor Networks",
    "abstract": "Wireless sensor networks consist of a large number of tiny sensors that have only limited energy supply. One of the major challenges in constructing such networks is to maintain long network lifetime as well as sufficient sensing areas. To achieve this goal, a broadly-used method is to turn off redundant sensors. In this paper, the problem of estimating redundant sensing areas among neighbouring wireless sensors is analysed. We present simple methods to estimate the degree of redundancy without the knowledge of location or directional information. We also provide tight upper and lower bounds on the probability of complete redundancy and on the average partial redundancy. With random sensor deployment, our analysis shows that partial redundancy is more realistic for real applications, as complete redundancy is expensive, requiring up to 11 neighbouring sensors to provide a 90 percent chance of complete redundancy. Based on the analysis, we propose a scalable Lightweight Deployment-Aware Scheduling (LDAS) algorithm, which turns off redundant sensors without using accurate location information. Simulation study demonstrates that the LDAS algorithm can reduce network energy consumption and provide desired QoS requirement effectively.",
    "citation_count": 22,
    "year": "2005/12",
    "authors": [
        {
            "name": "Wu, Kui",
            "country": "Canada"
        },
        {
            "name": "Gao, Yong",
            "country": "Canada"
        },
        {
            "name": "Li, Fulu",
            "country": "USA"
        },
        {
            "name": "Xiao, Yang",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}