{
    "url": "https://link.springer.com/article/10.1007/s11036-020-01615-2",
    "title": "Local Statistics-based Speckle Reducing Bilateral Filter for Medical Ultrasound Images",
    "abstract": "One of the most widely used medical modality by healthcare industry is ultrasound imaging, which is often corrupted by multiplicative noise (known as speckle). The reduction of such kind of noise from ultrasound images is highly desirable for providing the proper diagnosis of a disease in real-time. The classical bilateral filter (CBF) is well known as most effective edge preserving and denoising filter for Gaussian noise reduction. Therefore, in this paper, a new speckle denoising filter is designed which is based on local statistics, Chi-square-based distance measure and box-based kernel function in bilateral filter framework for application and use in real time. The proposed speckle denoising scheme is tested on various synthetic, B-mode, simulated and real ultrasound images. The various quantitative and qualitative results suggest that the proposed local statistics-based bilateral filter (LSBF) outperforms the various existing speckle noise suppression techniques in term of denoising and restoration of fine textural information in the denoised images. The proposed LSBF method is compared with existing speckle noise reduction methods and experimental results demonstrate that, the proposed LSBF method have better noise removing and structure preserving capability as compared to existing standard denoising filters for speckle noise.",
    "citation_count": 43,
    "year": "2020/12",
    "authors": [
        {
            "name": "Singh, Karamjeet",
            "country": "India"
        },
        {
            "name": "Sharma, Bhisham",
            "country": "India"
        },
        {
            "name": "Singh, Jaiteg",
            "country": "India"
        },
        {
            "name": "Srivastava, Gautam",
            "country": "Canada"
        },
        {
            "name": "Sharma, Suchita",
            "country": "Republic of China"
        },
        {
            "name": "Aggarwal, Ashutosh",
            "country": "India"
        },
        {
            "name": "Cheng, Xiaochun",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}