{
    "url": "https://link.springer.com/article/10.1007/s11036-022-02068-5",
    "title": "Logistic Regression Analysis of Targeted Poverty Alleviation with Big Data in Mobile Network",
    "abstract": "In order to improve the identification accuracy and shorten the analysis time of poor households in poverty alleviation, this paper studies a logistic regression analysis algorithm of targeted poverty alleviation based on mobile big data. Based on the theories related to big poverty alleviation data, Apriori algorithm is used to mine the basic information of households collected through mobile network based on Maslow's hierarchy of needs theory. A multi-dimensional item data of poverty detection is obtained by analyzing the frequent itemsets of association rules in poor areas, and the poverty characteristics of poor areas from different dimensions are analyzed. Taking the big data platform of targeted poverty alleviation in Jiangxi Province, China, as an example, the economic assistance data is selected and sent into the k-means algorithm to cluster by taking the village as the unit. Then, combined with the correlation of poverty characteristics, the abnormal phenomena in poverty alleviation are found, and the effectiveness of the targeted assistance to poverty alleviation target areas is analyzed. Based on nonlinear logistic regression, the identification model of poor households is built, and the Spark frame is used to extract, transform and read the characteristics of samples respectively. Finally, the poor households are identified with the logistic regression algorithm. Experimental results show that the average recognition accuracy of poor households reaches 92%, and the mining time of poverty feature analysis is only 18&nbsp;s, which improves the efficiency of data analysis than current algorithms.",
    "citation_count": 23,
    "year": "2022/12",
    "authors": [
        {
            "name": "Zhao, Wei",
            "country": "China"
        },
        {
            "name": "Herencsar, Norbert",
            "country": "Czechia"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}