{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01231-9",
    "title": "Mapping the Evolution of Intellectual Structure in Information Management Using Author Co-citation Analysis",
    "abstract": "The current big data era has placed new challenges for the study and application of information management (IM). In this paper we visualized how IM evolved over thirty-six years (1980–2015). An author co-citation analysis was applied to a dataset extracted from Web of Science Core Collection®. To map the evolution, a longitudinal perspective was carried out by partitioning three homogeneous sub-periods of twelve years (1980–1991, 1992–2003, and 2004–2015). The 10% of most cited authors in each sub-period were clustered in bibliometric networks and then labeled into research areas. Likewise, we constructed a strategic diagram in order to describe internal relations within clusters and their interactions. Our findings evidenced 14 clusters from 1980 to 2015, representing several topics like management information systems, database systems, library automation, information management foundations, technology-based strategy, information technology management, health information management, personal information management, and motivated information management. The socio-intellectual structure shows a transition from an organizational to an individual approach in the study and application of IM. Our findings also point to an evolution from a technological orientation towards an informational orientation, since in the last sub-period there are mostly information scientists related to the study of information behavior and information retrieval. This study is the most comprehensive bibliometric research oriented to visualize the overall evolution IM.",
    "citation_count": 85,
    "year": "2021/12",
    "authors": [
        {
            "name": "González-Valiente, Carlos Luis",
            "country": "Cuba"
        },
        {
            "name": "León Santos, Magda",
            "country": "Cuba"
        },
        {
            "name": "Arencibia-Jorge, Ricardo",
            "country": "Cuba"
        },
        {
            "name": "Noyons, Ed",
            "country": "The Netherlands"
        },
        {
            "name": "Costas, Rodrigo",
            "country": "The Netherlands"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}