{
    "url": "https://link.springer.com/article/10.1007/s11036-016-0711-y",
    "title": "Optimal Energy Harvesting-based Weighed Cooperative Spectrum Sensing in Cognitive Radio Network",
    "abstract": "In cognitive radio (CR) network, to improve spectrum sensing performance to primary user (PU) and decrease energy wastage of secondary user (SU) in cooperative spectrum sensing, an energy harvesting-based weighed cooperative spectrum sensing is proposed in this paper. The SU harvests the radio frequency (RF) energy of the PU signal and then converts the RF energy into the electric energy to supply the power used for energy detection and cooperation. The time switching model and power splitting model are developed to realize the notion. In the time switching model, the SU performs either spectrum sensing or energy harvesting at any time, while in the power splitting model, the received PU signal is split into two signal streams, one for spectrum sensing and the other one for energy harvesting. A joint optimization problem is formulated to maximize the spectrum access probability of the SU by jointly optimizing sensing time, number of cooperative SUs and splitting factor. The simulation results have shown that compared to the traditional cooperative spectrum sensing, the proposed energy harvesting-based weighed cooperative spectrum sensing can decrease the energy wastage obviously while guaranteeing the maximum spectrum access probability.",
    "citation_count": 16,
    "year": "2016/12",
    "authors": [
        {
            "name": "Liu, Xin",
            "country": "China"
        },
        {
            "name": "Chen, Kunqi",
            "country": "China"
        },
        {
            "name": "Yan, Junhua",
            "country": "China"
        },
        {
            "name": "Na, Zhenyu",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}