{
    "url": "https://link.springer.com/article/10.1007/s11036-016-0715-7",
    "title": "QoS Guaranteed Resource Allocation Scheme for Cognitive Femtocells in LTE Heterogeneous Networks with Universal Frequency Reuse",
    "abstract": "In this paper, we propose a novel resource allocation scheme for co-channel interference avoidance in LTE heterogeneous networks with universal spectrum reuse where both macro users (MUs) and cognitive femto base stations (FBSs) within the same macrocell coverage can dynamically reuse whole spectrum. Specifically, resource blocks (RBs) are shared between cognitive FBSs in underlay mode while the resource sharing among FBSs and MUs is in overlay mode. The macrocell is divided into inner and outer regions with the inner region further divided into three sectors. The proposed scheme addresses co-channel interference (CCI) by employing fractional frequency reuse (FFR) for RB allocation in the outer region of the macrocell and increase the distance of users that reuse the same RB within the macrocell. Part of RBs are allocated to the outer region of the macrocell with a FFR factor of 1/3, while the remaining RBs are dynamically allocated to each sector in the inner region of macrocell based on MUs demand to efficiently utilize the available spectrum. A basic macro base station (MBS) assistance is required by the FBS in selection of suitable RB to avoid interference with MU in each sector. With the proposed solution, both macro and femto users can dynamically access the whole spectrum while having minimum bandwidth guarantee even under fully congested scenarios. Moreover, the proposed scheme practically eliminates the cross-tier interference and the CCI problem in heterogeneous network reduces to inter-femtocell interference. The throughput and outage performances of the proposed scheme are validated through extensive simulations under LTE network parameters. Simulation results show that the proposed scheme achieves a performance gain of more than 1.5 dB in terms of SINRs of both macro user and femto user compared to traditional cognitive and non-cognitive schemes without bandwidth guarantee for femtocells.",
    "citation_count": 38,
    "year": "2016/12",
    "authors": [
        {
            "name": "Saadat, Salman",
            "country": "China"
        },
        {
            "name": "Chen, Da",
            "country": "China"
        },
        {
            "name": "Jiang, Tao",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}