{
    "url": "https://link.springer.com/article/10.1007/s11036-015-0575-6",
    "title": "Reliable Machine-to-Machine Multicast Services with Multi-Radio Cooperative Retransmissions",
    "abstract": "The 3GPP is working towards the definition of service requirements and technical solutions to provide support for energy-efficient Machine Type Communications (MTC) in the forthcoming generations of cellular networks. One of the envisioned solutions consists in applying group management policies to clusters of devices in order to reduce control signaling and improve upon energy efficiency, e.g., multicast Over-The-Air (OTA) firmware updates. In this paper, a Multi-Radio Cooperative Retransmission Scheme is proposed to efficiently carry out multicast transmissions in MTC networks, reducing both control signaling and improving energy-efficiency. The proposal can be executed in networks composed by devices equipped with multiple radio interfaces which enable them to connect to both a cellular access network, e.g., LTE, and a short-range MTC area network, e.g., Low-Power Wi-Fi or ZigBee, as foreseen by the MTC architecture defined by ETSI. The main idea is to carry out retransmissions over the M2M area network upon error in the main cellular link. This yields a reduction in both the traffic load over the cellular link and the energy consumption of the devices. Computer-based simulations with ns-3 have been conducted to analyze the performance of the proposed scheme in terms of energy consumption and assess its superior performance compared to non-cooperative retransmission schemes, thus validating its suitability for energy-constrained MTC applications.",
    "citation_count": 26,
    "year": "2015/12",
    "authors": [
        {
            "name": "Laya, Andres",
            "country": "Sweden"
        },
        {
            "name": "Alonso, Luis",
            "country": "Spain"
        },
        {
            "name": "Chatzimisios, Periklis",
            "country": "Spain"
        },
        {
            "name": "Alonso-Zarate, Jesus",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}