{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02169-9",
    "title": "River Ecological Protection and Restoration Using Multi-source Remote Sensing Data",
    "abstract": "In the modern era, remote sensing capabilities of wireless sensor networks have enabled the preservation and restoration of river ecology. Remote sensing can detect changes and anomalies in river ecosystems, identify areas vulnerable to flooding, erosion, or sedimentation, and measure the effectiveness of restoration efforts over time by providing real-time monitoring and data collection. As a result, remote sensing technology can significantly improve our ability to protect and restore river ecosystems, resulting in improved sustainability and biodiversity conservation. However, adequate supervision is challenging due to technical bottlenecks encountered by river ecological protection and restoration and the wide range of river ecological protection areas. Firstly, this paper examines river ecological protection using multi-source remote sensing data. Secondly, it restores the appearance of river ecological protection by formulating monitoring targets, extracting river ecological remote sensing feature information, and using multiple remote sensing data for fusion and dynamic river ecology monitoring. Finally, this paper takes a river ecological protection restoration project as a research pilot. It establishes a multi-remote sensing monitoring mechanism for river protection and restoration in China by optimizing the indicators of river ecological protection and restoration and improving the accuracy of remote sensing’s data mining and analysis. This paper conducts several experiments that demonstrate that the proposed platform can improve the restoration effect of river ecology as well as the richness of river ecology. As a result, using multi-source remote sensing data for river ecological protection and restoration is critical to improving river ecological status.",
    "citation_count": 33,
    "year": "2023/12",
    "authors": [
        {
            "name": "Zhang, Xiangyong",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}