{
    "url": "https://link.springer.com/article/10.1023/A:1019175605040",
    "title": "Routing in wireless/mobile ad‐hoc networks via dynamic group construction",
    "abstract": "An ad-hoc network is temporarily formed by a group of mobile hosts communicating over wireless channels without any fixed network interaction and centralized administration. When a mobile host communicates with other mobile hosts in an ad-hoc network, the routes are established via the intermediate mobile hosts as forwarding nodes. Under such a network environment an adaptive approach for routing management will be proposed in this paper. In this approach, at first the network infrastructure is constructed by several communication groups, which are called routing groups. A routing group communicates with other routing groups via the boundary mobile hosts as forwarding nodes. In a routing group the mobile hosts are divided, by means of the dominating values, into two groups – one positive cluster and several non-positive clusters. The nodes in the positive cluster maintain the topology information of the routing group. Under such a construction environment, intra-group routing performs unicasting and gets multiple paths, while inter-group routing performs on group level by propagating the route requests to the boundary clusters, which are called bridge clusters. This routing scheme massively reduces the message complexity that is especially important for system performance under such a resource constraint environment. As far as the dynamic topology characteristics of ad-hoc networks are concerned, this approach also provides a more efficient infrastructure update. Finally, simulation results show that the routing via dynamic group construction outperforms the previous works in message complexity and infrastructure update efficiency.",
    "citation_count": 24,
    "year": "2004/04",
    "authors": [
        {
            "name": "Chang, Yu‐Liang",
            "country": "Taiwan"
        },
        {
            "name": "Hsu, Ching‐Chi",
            "country": "Taiwan"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}