{
    "url": "https://link.springer.com/article/10.1007/s11036-014-0540-9",
    "title": "Seamless Mobility Management Schemes for IPv6-based Wireless Networks",
    "abstract": "Mobility management is one major challenge for wireless network design. Advanced wireless technologies provide mobile nodes with multi-mode radio interfaces, so subscribers can benefit from disparate mobile communication systems. Meanwhile, researchers are putting efforts into standardization of IPv6-based mobility protocols. Hence, wireless networks can offer more flexible mobility support than ever before. However, as the demands for high-speed Internet access and multimedia services increase, guaranteeing host mobility with quality of service provisioning becomes more difficult. Both network connectivity and session continuity need to be carefully handled during handover. This paper proposes a new mobility protocol, called seamless mobile IPv6 (SMIPv6). Its novelty consists of pre-configuring bidirectional secure tunnels among access routers before handoff, as well as using such tunnels to guarantee handoff seamlessness. To evaluate the performance, simulations are conducted using OPNET Modeler v.12.0, of which results demonstrate that SMIPv6 delivers better performance than MIPv6 in terms of handoff latency and packet losses.",
    "citation_count": 36,
    "year": "2014/12",
    "authors": [
        {
            "name": "Zhang, Li Jun",
            "country": "USA"
        },
        {
            "name": "Chen, Wei Kian",
            "country": "USA"
        },
        {
            "name": "Zhang, Yan",
            "country": "USA"
        },
        {
            "name": "Quintero, Alejandro",
            "country": "Canada"
        },
        {
            "name": "Pierre, Samuel",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}