{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0980-0",
    "title": "Signal Ratio Detection and Approximate Performance Analysis for Ambient Backscatter Communication Systems with Multiple Receiving Antennas",
    "abstract": "Recently, ambient backscatter attracts much attention since it can utilize ambient radio frequency signals to enable battery-free devices to communicate with others. Most existing studies about ambient backscatter assume that the reader is equipped with one receiving antenna. In practice, the reader can utilize multiple antennas to overcome channel fading. In this paper, we investigate the problem of signal detection for ambient backscatter systems with multiple receiving antennas. Specifically, we formulate a new transmission model where the reader is equipped with at least two antennas and propose a ratio detector that exploits the ratio of the signal strength received at each antenna. It is shown that the closed-form expression of the optimal detection threshold for this detector is difficult to derive. Therefore, we derive a reasonable approximate expression for the optimal detection threshold. Moreover, we obtain the closed-form expression for approximate bit error rate (BER). Furthermore, we propose an antenna selection scheme if the reader is equipped with more than two antennas. The selection scheme is investigated through the BER performance. It is found that the largest gain in BER can be achieved when the antenna number increases from two to three, and that much less gain is obtained from enlarging the antenna number when the reader already has four antennas. Finally, simulation results are provided to corroborate our theoretical studies.",
    "citation_count": 25,
    "year": "2018/12",
    "authors": [
        {
            "name": "Ma, Shuo",
            "country": "China"
        },
        {
            "name": "Wang, Gongpu",
            "country": "China"
        },
        {
            "name": "Wang, Yanwen",
            "country": "China"
        },
        {
            "name": "Zhao, Zhuyan",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}