{
    "url": "https://link.springer.com/article/10.1007/s11036-013-0476-5",
    "title": "Spectrum-aware Beaconless Geographical Routing Protocol for Cognitive Radio Enabled Vehicular Networks",
    "abstract": "The FCC and ETSI have allocated spectrum in the 5.9 GHz band for intelligent transportation systems. However, this spectrum supports short-range transmissions (up to 1000 m) and limited bandwidth (up to 75 MHz), which are not enough to meet the increasing demand for in-car infotainment services. In this paper, we propose a distributed routing protocol for vehicular ad hoc networks, where cognitive radio enabled vehicles (CRVs) dynamically share the TV-band channels. In the proposed protocol, CRVs jointly select relay nodes, channels, transmission powers, and transmission rates so that their total transmission rates are maximized while meeting their rate demands and power constraints. This selection process is carefully executed so that ongoing communications between primary radios (PRs) and between other CRVs are not disrupted. Once the relay nodes are selected, they continue to relay more messages as long as they stay in a predefined forwarding area. By doing so, the overhead for selecting relay nodes can be substantially reduced. Channels, powers, and rates are changed on a per-packet and per-hop basis so that the proposed protocol can efficiently adapt to spectrum dynamics. Simulation results show that our protocol increases the end-to-end network throughput by up to 250 % and decreases the end-to-end delay by up to 400 % compared with other geographical routing protocols.",
    "citation_count": 25,
    "year": "2013/12",
    "authors": [
        {
            "name": "Kim, Junseok",
            "country": "USA"
        },
        {
            "name": "Krunz, Marwan",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}