{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1110-3",
    "title": "Telesurgery Robot Based on 5G Tactile Internet",
    "abstract": "With the development of modern medical technology, the emerging 5G, tactile Internet, robot, and artificial intelligence technology have enabled the interdisciplinary innovations facilitating the development of the surgical treatment technology, and enhancing the treatment efficiency of various diseases. In the medical field, the introduction of robot technology has contributed to the telesurgery. Moreover, the telesurgery robot allocated with the 5G tactile Internet as infrastructure, and AI technology as core competitiveness can promote the audio, visual and tactile perceptions of a doctor during the surgery process and solve the problems of resource scheduling; accordingly, it has become the research hotspot. Therefore, this paper introduces a telesurgery robot based on the 5G tactile Internet and artificial intelligence technology. The architecture, composition, characteristics, and advantages of telesurgery are explained in detail from two aspects, the intelligent tactile feedback, and human-machine interaction data. On this basis, a human-machine interaction optimization scheme during the telesurgery process is presented from four aspects, i.e., Edge-Cloud Integration, network slice, and intelligent edge-cloud. Finally, this paper discusses the open issues of the presented telesurgery system regarding the ultra-high reliability, AI-enabled surgery robot, communication, and security, to provide the reference for the promotion of the telesurgery robot performance.",
    "citation_count": 33,
    "year": "2018/12",
    "authors": [
        {
            "name": "Miao, Yiming",
            "country": "China"
        },
        {
            "name": "Jiang, Yingying",
            "country": "China"
        },
        {
            "name": "Peng, Limei",
            "country": "South Korea"
        },
        {
            "name": "Hossain, M. Shamim",
            "country": "Saudi Arabia"
        },
        {
            "name": "Muhammad, Ghulam",
            "country": "Saudi Arabia"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}