{
    "url": "https://link.springer.com/article/10.1007/s11036-018-01210-6",
    "title": "The Analysis of the Slovak Citizens’ Awareness about the Smart City Concept",
    "abstract": "An icreasing number of citizens living in cities and their demands for high quality of life and standard of living requires the implementation of smart solutions. Not only the world metropolis but also cities in the Slovak Republic implement the elements of the concept into their cities. Despite the efforts of local governments to improve residents’ lives through various projects oriented on smart elements, the issue of the lack of citizens’ awareness about the Smart City concept and the possibility of their engaging in building a better and smarter city remains. The mentioned issue also results from the survey conducted by the authors of the paper. The main aim of the paper is to analyze the awareness of regional cities’ citizens in the Slovak Republic about the Smart City concept and to propose the recommendations for improving the implementation of the Smart City elements into cities. The survey showed that almost 65 % of the respondents do not know what the term Smart City stands for. Based on the results, the authors recommend better enlightenment and publicity of the Smart City concept among citizens. Only informed and actively involved citizens can bring creative and innovative solutions that can make Smart City implementation more efficient or effective. A questionnaire was created to collect the necessary data. The questionnaire was distributed by the improbable quote selection of randomly addressed citizens in regional cities of the Slovak Republic. The collected data were evaluated by using the statistical program SPSS and MS Excel.",
    "citation_count": 19,
    "year": "2019/12",
    "authors": [
        {
            "name": "Cagáňová, Dagmar",
            "country": "Slovakia"
        },
        {
            "name": "Stareček, Augustín",
            "country": "Slovakia"
        },
        {
            "name": "Horňáková, Natália",
            "country": "Slovakia"
        },
        {
            "name": "Hlásniková, Petra",
            "country": "Slovakia"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}