{
    "url": "https://link.springer.com/article/10.1023/A:1019111218243",
    "title": "WaveVideo – An integrated approach to adaptive wireless video",
    "abstract": "The transmission of wireless video in acceptable quality is only possible by following an end-to-end approach. WaveVideo is an integrated, adaptive video coding architecture designed for heterogeneous wireless networks. It includes basic video compression algorithms based on wavelet transformations, an efficient channel coding, a filter architecture for receiver-based media scaling, and error-control methods to adapt video transmissions to the wireless environment. Using a joint source/channel coding approach, WaveVideo offers a high degree of error tolerance on noisy channels, still being competitive in terms of compression. Adaptation to channel conditions and user requirements is implemented on three levels. The coding itself features spatial and temporal measures to conceal transmission errors. Additionally, the amount of introduced error-control information is controlled by feedback. The video stream coding, applied to multicast capable networks, can serve different user's needs efficiently at the same time by scaling the video stream in the network according to receivers' quality requirements. The WaveVideo architecture is unique in terms of its capability to use QoS mapping and adaptation functions across all network nodes providing the same uniform interface.",
    "citation_count": 39,
    "year": "1999/12",
    "authors": [
        {
            "name": "Fankhauser, George",
            "country": "Switzerland"
        },
        {
            "name": "Dasen, Marcel",
            "country": "Switzerland"
        },
        {
            "name": "Weiler, Nathalie",
            "country": "Switzerland"
        },
        {
            "name": "Plattner, Bernhard",
            "country": "Switzerland"
        },
        {
            "name": "Stiller, Burkhard",
            "country": "Switzerland"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}