{
    "url": "https://link.springer.com/article/10.1007/s10044-018-0731-2",
    "title": "A comprehensive survey on word recognition for non-Indic and Indic scripts",
    "abstract": "The term handwriting recognition is used to describe the capability of a computer system to transform human handwriting into machine processable text. Handwriting recognition has many applications in various fields such as bank-cheque processing, postal-address interpretation, document archiving, mail sorting and form processing in administration, insurance offices. A collection of different scripts is employed in writing languages throughout the world. Many researchers have done work for handwriting recognition of various non-Indic and Indic scripts from the most recent couple of years. But, only a limited number of systems are offered for word recognition for these scripts. This paper presents an extensive systematic survey of word recognition techniques. This survey of word recognition is classified broadly based on different scripts in which a word is written. Experimental evaluation of word recognition tools/techniques is presented in this paper. Different databases have been surveyed to evaluate the performance of techniques used to recognize words, and the achieved recognition accuracies have been reported. The efforts in two directions (non-Indic and Indic scripts) are reflected in this paper. We increased awareness of the potential benefits of word recognition techniques and identify the need to develop an efficient word recognition technique. Recommendations are also provided for future research. It is also observed that the research in this area is quietly thin and still more research is to be done, particularly in the case of word recognition of printed/handwritten documents in Indic scripts.",
    "citation_count": 82,
    "year": "2018/11",
    "authors": [
        {
            "name": "Kaur, Harmandeep",
            "country": "India"
        },
        {
            "name": "Kumar, Munish",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}