{
    "url": "https://link.springer.com/article/10.1007/s10044-017-0666-z",
    "title": "A method for liver segmentation in perfusion MR images using probabilistic atlases and viscous reconstruction",
    "abstract": "Magnetic resonance (MR) tomographic images are routinely used in diagnosis of liver pathologies. Liver segmentation is needed for these types of images. It is therefore an important requirement for later tasks such as comparison among studies of different patients, as well as studies of the same patient (including those taken during the diffusion of a contrast, as in perfusion MR imaging). However, automatic segmentation of the liver is a challenging task due to certain reasons such as the high variability of liver shapes, similar intensity values and unclear contours between the liver and surrounding organs, especially in perfusion MR images. In order to overcome these limitations, this work proposes the use of a probabilistic atlas for liver segmentation in perfusion MR images, and the combination of the information gathered with that provided by level-based segmentation methods. The process starts with an under-segmented shape that grows slice by slice using morphological techniques (namely, viscous reconstruction); the result of the closest segmented slice and the probabilistic information provided by the atlas. Experiments with a collection of manually segmented liver images are provided, including numerical evaluation using widely accepted metrics for shape comparison.",
    "citation_count": 39,
    "year": "2018/11",
    "authors": [
        {
            "name": "Dura, Esther",
            "country": "Spain"
        },
        {
            "name": "Domingo, Juan",
            "country": "Spain"
        },
        {
            "name": "Göçeri, Evgin",
            "country": "Turkey"
        },
        {
            "name": "Martí-Bonmatí, Luis",
            "country": "Spain"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}