{
    "url": "https://link.springer.com/article/10.1007/s10044-012-0281-y",
    "title": "A new radial symmetry measure applied to photogrammetry",
    "abstract": "This work presents a new measure for radial symmetry and an algorithm for its computation. This measure identifies radially symmetric blobs as locations with contributions from all orientations at some scale. Hence, at a given scale, radial symmetry is computed as the product of the responses of a set of even symmetric feature detectors, with different orientations. This operator presents low sensitivity to shapes lacking radial symmetry, is robust to noise, contrast changes and strong perspective distortions, and shows a narrow point spread function. A multi-resolution measure is provided, computed as the maximum of the symmetry measure evaluated over a set of scales. We have applied this measure in the field of photogrammetry for the detection of circular coded fiducial targets. The detection of local maxima of multi-resolution radial symmetry is combined with a step of false-positive rejection, based on elliptical model fitting. In our experiments, the efficiency of target detection with this method is improved regarding a well-known commercial system, which is expected to improve the performance of bundle adjustment techniques. In order to fulfill all steps previous to bundle adjustment, we have also developed our own method for recognition of coded targets. This is accomplished by a standard procedure of segmentation and decoding of the ring sequence. Nevertheless, we have included a step for the verification of false positives of decoding based on correlation with reference targets. As far as we know, this approach cannot be found in literature.",
    "citation_count": 15,
    "year": "2013/11",
    "authors": [
        {
            "name": "Dosil, Raquel",
            "country": "Spain"
        },
        {
            "name": "Pardo, Xosé M.",
            "country": "Spain"
        },
        {
            "name": "Fdez-Vidal, Xosé R.",
            "country": "Spain"
        },
        {
            "name": "García-Díaz, Antón",
            "country": "Spain"
        },
        {
            "name": "Leborán, Víctor",
            "country": "Spain"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}