{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01448-3",
    "title": "A novel fusion approach with a robust ParallelNet model for diabetic retinopathy diagnosis",
    "abstract": "Diabetic Retinopathy (DR) is a serious diabetes-related complication that can lead to significant retinal damage and irreversible vision loss if not detected and treated early. While numerous deep learning algorithms have recently been developed for DR diagnosis, however they often focus on specific symptoms like exudates, vessels, or hemorrhages, overlooking a comprehensive analysis of all relevant indicators. Though, previous studies have shown high performance on benchmark public datasets but have struggled with real-time data. This paper introduces a diagnostic system that systematically incorporates all detectable symptoms of diabetic retinopathy and has demonstrated reliable performance on 108 test images from Lahore General Hospital, showcasing its robustness in real-world scenarios. Additionally, a novel algorithm for extracting retinal exudates is proposed, outperforming existing methods. The study categorizes retinal fundus images into both 2-class and multi-class diabetic retinopathy. Evaluation of current models on a local hospital dataset shows significant accuracy improvements. We also present ParallelNet, a model for classifying Diabetic Retinopathy stages: No DR, NPDR, PDR. ParallelNet outperforms established models, achieving 96% accuracy on the APTOS dataset and 90.16% on the local dataset for binary classification. For multi-classification, it achieves 90% accuracy on the APTOS dataset and 87.05% on the local dataset. These results highlight the improved performance achieved by combining our extraction algorithms with the ParallelNet model, demonstrating robustness across both public and local real-time hospital datasets.",
    "citation_count": 52,
    "year": "2025/06",
    "authors": [
        {
            "name": "Mahmood, Haroon",
            "country": "United Arab Emirates"
        },
        {
            "name": "Ather, Saad",
            "country": "Pakistan"
        },
        {
            "name": "Wali, Aamir",
            "country": "Pakistan"
        },
        {
            "name": "Ali, Arshad",
            "country": "Pakistan"
        },
        {
            "name": "Malik, Tayyaba Gul",
            "country": "Pakistan"
        },
        {
            "name": "Kafeel, Wardah",
            "country": "Pakistan"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}