{
    "url": "https://link.springer.com/article/10.1007/s10044-020-00877-6",
    "title": "Accurate quaternion radial harmonic Fourier moments for color image reconstruction and object recognition",
    "abstract": "Orthogonal moments have become a powerful tool for object representation and image analysis. Radial harmonic Fourier moments (RHFMs) are one of such image descriptors based on a set of orthogonal projection bases, which outperform other moments because of their computational efficiency. However, the conventional computational framework of RHFMs produces geometric error and numerical integration error, which will affect the accuracy of RHFMs, thus degrading the image reconstruction performance. To overcome this shortcoming, we propose a new computational framework of RHFMs, namely accurate quaternion radial harmonic Fourier moments (AQRHFMs), for color image processing, and also analyze the properties of AQRHFMs. Firstly, we propose a precise computation method of RHFMs to reduce the geometric and numerical errors. Secondly, by using the algebra of quaternions, we extend the accurate RHFMs to AQRHFMs in order to deal with the color images in a holistic manner. Experimental results show the proposed AQRHFMs achieve promising performance in image reconstruction and object recognition in both noise-free and noisy conditions.",
    "citation_count": 37,
    "year": "2020/11",
    "authors": [
        {
            "name": "Liu, Yunan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Shanshan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Li, Guangyu",
            "country": "People’s Republic of China"
        },
        {
            "name": "Wang, Houjun",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yang, Jian",
            "country": ""
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}