{
    "url": "https://link.springer.com/article/10.1007/s10044-022-01071-6",
    "title": "Accurate quaternion fractional-order pseudo-Jacobi–Fourier moments",
    "abstract": "Pseudo-Jacobi–Fourier moments (PJFMs) are a set of orthogonal moments which have been successfully applied in the fields of image processing and pattern recognition. In this paper, we present a new set of quaternion fractional-order orthogonal moments for color images, named accurate quaternion fractional-order pseudo-Jacobi–Fourier moments (AQFPJFMs). We initially propose a fast and accurate algorithm for the PJFMs computation of an image using new recursive approach and polar pixel tiling scheme. Then, we define a new set of orthogonal moments, named accurate fractional-order pseudo-Jacobi–Fourier moments, which is characterized by the generic nature and time–frequency analysis capability. We finally extend the gray-level fractional-order PJFMs to color images and present the quaternion fractional-order pseudo-Jacobi–Fourier moments. In addition, we develop a new color image representation for enhancing simultaneously the discriminability and robustness, called mixed low-order moments feature. We conduct extensive experiments to evaluate the performance of the proposed AQFPJFMs, in which the encouraging results demonstrate the efficacy and superiority of the proposed scheme.",
    "citation_count": 57,
    "year": "2022/11",
    "authors": [
        {
            "name": "Wang, Xiangyang",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Yuyang",
            "country": "People’s Republic of China"
        },
        {
            "name": "Tian, Jialin",
            "country": "People’s Republic of China"
        },
        {
            "name": "Niu, Panpan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yang, Hongying",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}