{
    "url": "https://link.springer.com/article/10.1007/s10044-017-0618-7",
    "title": "An automatic decision approach to coal–rock recognition in top coal caving based on MF-Score",
    "abstract": "Aiming at the problem of the absence of effective coal–rock recognition methods during top coal caving, we propose a new multi-class feature selection approach to detecting full coal falling/30% rock mixture falling/50% rock mixture falling/full rock falling recognition during caving. The method is based on vibration and acoustic sensors fixed under the tail beam of the hydraulic as well as signal processing techniques. Distinctive vibration and acoustic signals generate during caving that depend on the state of coal–rock mixed. Via a contribution threshold $$\\lambda_{0}$$ and classification accuracy P, the optimal combination of feature attributes can be automatically and sequentially decided by using the multi-class F-score (MF-Score) feature reduction approach proposed in this paper. The main idea of the MF-Score is to construct the within-class scatter matrix with a membership function based on the aggregation degree within the sample. The support vector machine classifier has been employed to test the proposed algorithm and identified the state of the coal–rock mixed. The contribution threshold is readjusted according to the calculated feature selection criterion J(k) and user requirement, and then a feedback loop is developed to keep the dynamic of the samples. Experimental results show the good generality and effectiveness of this new approach.",
    "citation_count": 39,
    "year": "2017/11",
    "authors": [
        {
            "name": "Song, Qingjun",
            "country": "China"
        },
        {
            "name": "Jiang, Haiyan",
            "country": "China"
        },
        {
            "name": "Zhao, Xieguang",
            "country": "China"
        },
        {
            "name": "Li, Dongmin",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}