{
    "url": "https://link.springer.com/article/10.1007/s10044-016-0573-8",
    "title": "Applying particle swarm optimisation to the morphological segmentation of words from Ancient Greek texts",
    "abstract": "The present article investigates the effectiveness of evolutionary computation algorithms in a specific optimisation task, namely morphological segmentation of words into subword segments, focusing on the definition of stems and endings. More precisely, particle swarm optimisation (PSO) is compared to an earlier study on the same task using ant colony optimisation (ACO), using a number of different optimisation criteria, for each of which independent experiments are run. In the present article, the system architecture has been revised over earlier implementations, to allow substantially faster simulation times (by several orders of magnitude), which in turn allows the realisation of more iterations. The effect of local search to the PSO final segmentation quality is investigated in detail, with different local search processes being compared in terms of their effectiveness. In addition, issues involving the convergence of PSO are examined, encompassing variants which adopt global versus local training schemes. Experimental results show that, for different datasets, as a rule both PSO and ACO achieve higher segmentation accuracies than manual tuning. A comparison between ACO and PSO is made, over the different criteria used. When focusing on the highest performing criteria, ACO and PSO are comparable, while the system revisions allow the process to be completed much faster. In terms of the highest segmentation accuracy obtained for a specific system configuration, PSO is more effective, by achieving the highest segmentation accuracy amongst all optimisation methods tested.",
    "citation_count": 35,
    "year": "2016/11",
    "authors": [
        {
            "name": "Tambouratzis, George",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}