{
    "url": "https://link.springer.com/article/10.1007/s10044-021-01027-2",
    "title": "Assessing task understanding in remote ultrasound diagnosis via gesture analysis",
    "abstract": "This work presents a gesture-based approach to estimate task understanding and performance during remote ultrasound tasks. Our approach is&nbsp;comprised of two main components. The first component uses the Multi-Agent Gestural Instruction Comparer (MAGIC) framework to represent and compare the gestures performed by collaborators. Through MAGIC, gestures can be compared based in their morphology, semantics, and pragmatics. The second component computes the Physical Instructions Assimilation (PIA) metric, a score representing how well are gestures being used to communicate and execute physical instructions. To evaluate our hypothesis, 20 participants performed a remote ultrasound task consisting of three subtasks: vessel detection, blood extraction, and foreign body detection. MAGIC’s gesture comparison approaches were compared against two other approaches based on how well they replicated human-annotated gestures matchings. Our approach outperformed the others, agreeing with the human baseline over 76% of the times. Subsequently, a correlation analysis was performed to compare PIA’s task understanding insights with those of three other metrics: error rate, idle time rate, and task completion percentage. Significant correlations ( $$p\\,\\le \\,0.04$$ ) were found between PIA and all the other metrics, positioning PIA as an effective metric for task understanding estimation. Finally, post-experiment questionnaires were used to subjectively evaluate the participants’ perceived understanding. The PIA score was found to be significantly correlated with the participants’ overall task understanding ( $$p\\le 0.05$$ ), hinting to the relation between the assimilation of physical instructions and self-perceived understanding. These results demonstrate that gestures an be used to estimate task understanding in remote ultrasound tasks, which can improve how these tasks are performed and assessed.",
    "citation_count": 61,
    "year": "2021/11",
    "authors": [
        {
            "name": "Rojas-Muñoz, Edgar",
            "country": "USA"
        },
        {
            "name": "Wachs, Juan P.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}