{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01419-8",
    "title": "Bidirectional feature fusion via cross-attention transformer for chrysanthemum classification",
    "abstract": "Chrysanthemums hold significant ornamental, economic, and medicinal value, with their quality and economic worth heavily influenced by geographic origin. Accurate classification of chrysanthemums is crucial for ensuring product authenticity, boosting consumer trust, and promoting sustainable industry growth. Traditional classification methods, however, suffer from inefficiency and high costs. To address these challenges, we propose a novel chrysanthemum classification method utilizing a bidirectional feature fusion approach via cross-attention and two-stream network fusion. Our method preprocesses front and back images of chrysanthemums from diverse regions, employing the powerful Swin Transformer as the backbone to extract features. The cross-attention mechanism effectively integrates features from both image sides, and a secondary training strategy further enhances the model’s generalization capabilities. Experimental results demonstrate that our method achieves higher accuracy, precision, recall, and F1 score compared to state-of-the-art models, highlighting its potential for accurate chrysanthemum origin tracing. The code and datasets are openly available at https://github.com/dart-into/CCMCAM , ensuring transparency and reproducibility of our findings.",
    "citation_count": 46,
    "year": "2025/06",
    "authors": [
        {
            "name": "Chen, Yifan",
            "country": "China"
        },
        {
            "name": "Yang, Xichen",
            "country": "China"
        },
        {
            "name": "Yan, Hui",
            "country": "China"
        },
        {
            "name": "Liu, Jia",
            "country": "China"
        },
        {
            "name": "Jiang, Jian",
            "country": "China"
        },
        {
            "name": "Mao, Zhongyuan",
            "country": "China"
        },
        {
            "name": "Wang, Tianshu",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}