{
    "url": "https://link.springer.com/article/10.1007/s10044-021-01017-4",
    "title": "Depth and edge auxiliary learning for still image crowd density estimation",
    "abstract": "Crowd counting plays a significant role in crowd monitoring and management, which suffers from various challenges, especially in crowd-scale variations and background interference issues. Therefore, we propose a method named depth and edge auxiliary learning for still image crowd density estimation to cope with crowd-scale variations and background interference problems simultaneously. The proposed multi-task framework contains three sub-tasks including the crowd head edge regression, the crowd density map regression and the relative depth map regression. The crowd head edge regression task outputs distinctive crowd head edge features to distinguish crowd from complex background. The relative depth map regression task perceives crowd-scale variations and outputs multi-scale crowd features. Moreover, we design an efficient fusion strategy to fuse the above information and make the crowd density map regression generate high-quality crowd density maps. Various experiments were conducted on four main-stream datasets to verify the effectiveness and portability of our method. Experimental results indicate that our method can achieve competitive performance compared with other superior approaches. In addition, our proposed method improves the counting accuracy of the baseline network by $$15.6\\%$$ .",
    "citation_count": 46,
    "year": "2021/11",
    "authors": [
        {
            "name": "Peng, Sifan",
            "country": "China"
        },
        {
            "name": "Yin, Baoqun",
            "country": "China"
        },
        {
            "name": "Hao, Xiaoliang",
            "country": "China"
        },
        {
            "name": "Yang, Qianqian",
            "country": "China"
        },
        {
            "name": "Kumar, Aakash",
            "country": "China"
        },
        {
            "name": "Wang, Luyang",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}