{
    "url": "https://link.springer.com/article/10.1007/s10044-008-0103-4",
    "title": "Diversity-based combination of non-parametric classifiers for EMG signal decomposition",
    "abstract": "Non-parametric classification procedures based on a certainty measure and nearest neighbour rule for motor unit potential classification (MUP) during electromyographic (EMG) signal decomposition were explored. A diversity-based classifier fusion approach is developed and evaluated to achieve improved classification performance. The developed system allows the construction of a set of non-parametric base classifiers and then automatically chooses, from the pool of base classifiers, subsets of classifiers to form candidate classifier ensembles. The system selects the classifier ensemble members by exploiting a diversity measure for selecting classifier teams. The kappa statistic is used as the diversity measure to estimate the level of agreement between base classifier outputs, i.e., to measure the degree of decision similarity between base classifiers. The pool of base classifiers consists of two kinds of classifiers: adaptive certainty-based classifiers (ACCs) and adaptive fuzzy k-NN classifiers (AFNNCs) and both utilize different types of features. Once the patterns are assigned to their classes, by the classifier fusion system, firing pattern consistency statistics for each class are calculated to detect classification errors in an adaptive fashion. Performance of the developed system was evaluated using real and simulated EMG signals and was compared with the performance of the constituent base classifiers and the performance of the fixed ensemble containing the full set of base classifiers. Across the EMG signal data sets used, the diversity-based classifier fusion approach had better average classification performance overall, especially in terms of reducing classification errors.",
    "citation_count": 66,
    "year": "2008/09",
    "authors": [
        {
            "name": "Rasheed, Sarbast",
            "country": "Canada"
        },
        {
            "name": "Stashuk, Daniel W.",
            "country": "Canada"
        },
        {
            "name": "Kamel, Mohamed S.",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}