{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01451-8",
    "title": "Dual stream deep attention networks for annual population projection",
    "abstract": "Accurate population projections are essential for local and state governments planning and decision-making processes, as they directly influence the development of local infrastructure and services. Recent advancements in time series forecasting, particularly through machine learning applied to diverse social and economic factors, have improved predictive accuracy, enabling more informed decision-making at local and state levels. Therefore, researchers have explored various statistical, machine learning, and deep learning methods. However, these approaches often rely on standalone models or simple feature integration, which results need to be improved. Furthermore, the existing methods lack hybrid methods with attention mechanisms to effectively capture rich intricate features. To tackle these challenges, we designed a hybrid method, a dual-stream deep attention network namely Deep Population Network (DPNET) for annual population forecasting. The first stream employs convolutional layers to capture spatial patterns while the second stream extracts the temporal information. The output of these two streams is then concatenated and fed to the self-attention module for feature refinement followed by a fully connected layer. The DPNET showcases promising performance in small-area population projection across multiple datasets collected from Korea, Australia, and New Zealand for 10-year and 5-year forecasting periods. Compared to existing approaches, DPNET significantly reduced the error rate, achieving the lowest Mean Absolute Percentage Error (MAPE) of 5.30% and Median Absolute Percentage Error (MedAPE) of 3.03% for the Korean dataset, 6.02% MAPE and 4.09% MedAPE for the Australian dataset, and 3.99% MedAPE for the New Zealand dataset.",
    "citation_count": 32,
    "year": "2025/06",
    "authors": [
        {
            "name": "Hussain, Adnan",
            "country": "Republic of Korea"
        },
        {
            "name": "Yar, Hikmat",
            "country": "Republic of Korea"
        },
        {
            "name": "Khan, Noman",
            "country": "Republic of Korea"
        },
        {
            "name": "Khan, Zulfiqar Ahmad",
            "country": "Republic of Korea"
        },
        {
            "name": "Kim, Min Je",
            "country": "Republic of Korea"
        },
        {
            "name": "Baik, Sung Wook",
            "country": "Republic of Korea"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}