{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01461-6",
    "title": "Dynamic fire and smoke detection module with enhanced feature integration and attention mechanisms",
    "abstract": "Effective fire and smoke detection mechanisms are essential to early fire warning systems. The need for annotated datasets, the complexity of fire environments, the unique characteristics of fire and smoke, and the presence of noise in images necessitate further enhancements despite the optimistic results of object detection-based technologies. We propose the Dynamic Fire and Smoke Detection Model (DFDM), an optimized YOLOv7-tiny architecture to address these challenges. Our model incorporates an asymptotic feature pyramid network (AFPN) to bridge semantic gaps and a cross-level dual attention (CDA) mechanism to improve the detection of critical fire and smoke features. Additionally, we developed a novel partial selective block (PSB) that enhances parameter efficiency and reduces redundant information. Extensive experiments on two datasets, DFS and UMA, validate the effectiveness of DFDM in diverse environments. DFDM achieves a significant mAP improvement, reaching 0.240 on the DFS dataset and 0.669 on the UMA dataset while maintaining a low parameter count of 4.34M and FLOPs of 5.697G. Furthermore, the model excels in real-time performance, processing frames at 153.8 FPS with an inference time of 6.5 milliseconds, making it ideal for real-world applications requiring fast and accurate detection. Visualizations confirm that DFDM reduces background noise and provides a wider field of view compared to baseline models, demonstrating its robustness in complex fire and smoke detection scenarios.",
    "citation_count": 67,
    "year": "2025/06",
    "authors": [
        {
            "name": "Amjad, Ammar",
            "country": "ROC"
        },
        {
            "name": "Huroon, Aamer Mohamed",
            "country": "ROC"
        },
        {
            "name": "Chang, Hsien-Tsung",
            "country": "Sudan"
        },
        {
            "name": "Tai, Li-Chia",
            "country": "ROC"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}