{
    "url": "https://link.springer.com/article/10.1007/s10044-014-0366-x",
    "title": "Evaluating classifier combination in object classification",
    "abstract": "Classifier combination is used in object classification to combine the strength of multiple complementary classifiers and yield better performance than any single classifier. While various optimization-based combination methods have been presented in literature, their real effectiveness in practice has been called in question. This prompts us to investigate the behavior of classifiers in combination with the simple average combination method. Specifically, we investigate the influence of some issues on average classifier combination performance with extensive experiments on four diverse datasets. As a result, we find that the behavior of features and kernel functions in feature combination, and of soft labels and classifiers in classifier fusion, can be elegantly explained in the framework of the kNN method in instance-based learning. This framework shows that by proper selection of features, kernel functions, soft labels and classifiers, an enhanced average combination is able to perform much better than the average combination of all features, kernel functions, soft labels and classifiers. Furthermore, this framework gives rise to the descending combination performance curve (DCPC) as a new performance evaluation criterion of combination methods. Unlike the ordinary criterion of comparing only the final classification rate, DCPC also captures the ability of combination methods to combine the strength and avoid the drawbacks of multiple classifiers.",
    "citation_count": 55,
    "year": "2015/11",
    "authors": [
        {
            "name": "Hou, Jian",
            "country": "China"
        },
        {
            "name": "E, Xu",
            "country": "China"
        },
        {
            "name": "Xia, Qi",
            "country": "China"
        },
        {
            "name": "Qi, Nai-Ming",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}