{
    "url": "https://link.springer.com/article/10.1007/s10044-023-01195-3",
    "title": "Expanded relative density peak clustering for image segmentation",
    "abstract": "The density peak clustering (DPC) is one of the most popular algorithms for segmenting images due to its simplicity and efficiency. Since DPC and its variants are not specifically designed for image segmentation, their segmentation results do not necessarily meet both subjective and objective metrics. We propose an expanded relative density-based clustering algorithm as a solution to the above problems, which can automatically determine the cluster number and make the image segmentation results more consistent with subjective criteria. First, the image is pre-segmented into superpixels using the simple linear iterative clustering algorithm, and the superpixels are represented by feature vectors containing color and texture information. Secondly, the expanded relative density of the data point is obtained by comparing the tightness of a mini-cluster with its neighboring mini-clusters. The Sigmoid function is then applied to the data point with small density but large relative distance to further adjust its relative distance so that the distribution of cluster centers matches the characteristics of the image. Next, the optimal cluster number is determined by the rate of change of the sum of squared errors. Finally, the cluster center pairs with smaller distances are merged using the cluster center merging algorithm. The experiments conducted on synthetic and real datasets demonstrate that the performance of the proposed algorithm outperforms the compared algorithms.",
    "citation_count": 36,
    "year": "2023/11",
    "authors": [
        {
            "name": "Li, Miao",
            "country": "China"
        },
        {
            "name": "Ma, Yan",
            "country": "China"
        },
        {
            "name": "Huang, Hui",
            "country": "China"
        },
        {
            "name": "Wang, Bin",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}