{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01408-3",
    "title": "Kernelized multi-view graph clustering via graph structure preserving and consensus affinity graph learning",
    "abstract": "Recently, kernelized multi-view clustering has garnered significant attention due to its powerful ability to effectively cluster multi-view data characterized by non-linear structures. However, most existing methods focus more on kernel learning while neglecting graph structure learning in the kernel space, resulting in the creation of an affinity graph that is suboptimal for clustering purposes. To address this issue, this paper proposes a novel kernelized multi-view graph clustering method via graph structure preserving and consensus affinity graph learning. The proposed method first designs a predefined kernel matrix for each individual view. Subsequently, it learns a view-specific candidate affinity graph that preserves both the local and global structures of the input data within the kernel space. Next, a reliable and robust consensus affinity graph, which accurately captures the underlying cluster structure and is resistant to noise, is jointly learned from all the candidate affinity graphs and their shared latent representation. Finally, we integrate graph structure learning in kernel space, shared latent representation learning, and consensus affinity graph learning into a unified framework, enabling them to mutually reinforce each other during iterative optimization. Experiments conducted on benchmark datasets have demonstrated that the proposed method outperforms some state-of-the-art multi-view clustering methods.",
    "citation_count": 42,
    "year": "2025/06",
    "authors": [
        {
            "name": "Gui, Zhongyan",
            "country": "China"
        },
        {
            "name": "Yang, Jing",
            "country": "China"
        },
        {
            "name": "Xie, Zhiqiang",
            "country": "China"
        },
        {
            "name": "Ye, Cuicui",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}