{
    "url": "https://link.springer.com/article/10.1007/s10044-020-00874-9",
    "title": "Local binary pattern-based on-road vehicle detection in urban traffic scene",
    "abstract": "For intelligent traffic monitoring systems and related applications, detecting vehicles on roads is a vital step. However, robust and efficient vehicles detection is still a challenging problem due to variations in the appearance of the vehicles and complicated background of the roads. In this paper, we propose a simple and effective vehicle detection method based on local vehicle's texture and appearance histograms feed into clustering forests. The interdependency of vehicle's parts locations is incorporating within a clustering forests framework. Local binary pattern-like descriptors are utilized for texture feature extraction. Through utilizing the LBP descriptors, the local structures of vehicles, such as edge, contour and flat region can be effectively depicted. The align set of histograms generated concurrence with LBPs spatial for random sampled local regions are used to measure the dissimilarity between regions of all training images. Evaluating the fit between histograms is built in clustering forests. That is, clustering discriminative codebooks of latent features are used to search between different LBP features of the random regions utilizing the Chi-square dissimilarity measure. Besides, saliency maps built by the learnt latent features are adopted to determine the vehicles locations in test image. Effectiveness of the proposed method is evaluated on different car datasets stressing various imaging conditions and the obtained results show that the method achieves significant improvements compared to published methods.",
    "citation_count": 67,
    "year": "2020/11",
    "authors": [
        {
            "name": "Hassaballah, M.",
            "country": "Egypt"
        },
        {
            "name": "Kenk, Mourad A.",
            "country": "Egypt"
        },
        {
            "name": "El-Henawy, Ibrahim M.",
            "country": "Egypt"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}