{
    "url": "https://link.springer.com/article/10.1007/s10044-017-0616-9",
    "title": "New dissimilarity measures for image phylogeny reconstruction",
    "abstract": "Image phylogeny is the problem of reconstructing the structure that represents the history of generation of semantically similar images (e.g., near-duplicate images). Typical image phylogeny approaches break the problem into two steps: (1) estimating the dissimilarity between each pair of images and (2) reconstructing the phylogeny structure. Given that the dissimilarity calculation directly impacts the phylogeny reconstruction, in this paper, we propose new approaches to the standard formulation of the dissimilarity measure employed in image phylogeny, aiming at improving the reconstruction of the tree structure that represents the generational relationships between semantically similar images. These new formulations exploit a different method of color adjustment, local gradients to estimate pixel differences and mutual information as a similarity measure. The results obtained with the proposed formulation remarkably outperform the existing counterparts in the literature, allowing a much better analysis of the kinship relationships in a set of images, allowing for more accurate deployment of phylogeny solutions to tackle traitor tracing, copyright enforcement and digital forensics problems.",
    "citation_count": 47,
    "year": "2017/11",
    "authors": [
        {
            "name": "Costa, Filipe",
            "country": "Brazil"
        },
        {
            "name": "Oliveira, Alberto",
            "country": "Brazil"
        },
        {
            "name": "Ferrara, Pasquale",
            "country": "Italy"
        },
        {
            "name": "Dias, Zanoni",
            "country": "Brazil"
        },
        {
            "name": "Goldenstein, Siome",
            "country": "Brazil"
        },
        {
            "name": "Rocha, Anderson",
            "country": "Brazil"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}