{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01459-0",
    "title": "Occlusion-aware appearance and shape learning for occluded cloth-changing person re-identification",
    "abstract": "In recent years, Person Re-Identification (Re-ID) has seen remarkable progress in addressing the issue of clothing changes. However, in real-world scenarios, Re-ID is often further challenged by occlusions, while very little research has been conducted to explicitly tackle these two challenges simultaneously. To this end, we propose a method for Occluded Cloth-Changing Person Re-ID (OCCRe-ID) termed “OASL: Occlusion-aware Appearance and Shape Learning”. OASL introduces a plug-and-play occlusion handling strategy which can be seamlessly integrated into existing Re-ID methods, enabling them to reason discriminative appearance and shape features under occlusions. Specifically, our approach leverages occlusion type information to achieve two key objectives for occlusion-awareness: (1) guide the backbone to focus on extracting identity-aware appearance features from non-occluded image regions and reason features from occluded ones, and (2) recover pose keypoints from occluded regions for mitigating occlusions in shape encoding. Additionally, we construct E-PRCC, the first dataset for OCCRe-ID, with the aim of facilitating further research in this practical domain. Extensive experiments conducted on E-PRCC, LTCC, Occluded-REID, DeepChange, and Market-1501 datasets demonstrate that OASL achieves state-of-the-art performance, offering a robust solution to the dual challenges of occlusions and clothing changes in Person Re-ID.",
    "citation_count": 72,
    "year": "2025/06",
    "authors": [
        {
            "name": "Nguyen, Vuong D.",
            "country": "USA"
        },
        {
            "name": "Mantini, Pranav",
            "country": "USA"
        },
        {
            "name": "Shah, Shishir K.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}