{
    "url": "https://link.springer.com/article/10.1007/s10044-008-0126-x",
    "title": "Probabilistic classification of acute myocardial infarction from multiple cardiac markers",
    "abstract": "Logistic regression and Gaussian mixture model (GMM) classifiers have been trained to estimate the probability of acute myocardial infarction (AMI) in patients based upon the concentrations of a panel of cardiac markers. The panel consists of two new markers, fatty acid binding protein (FABP) and glycogen phosphorylase BB (GPBB), in addition to the traditional cardiac troponin I (cTnI), creatine kinase MB (CKMB) and myoglobin. The effect of using principal component analysis (PCA) and Fisher discriminant analysis (FDA) to preprocess the marker concentrations was also investigated. The need for classifiers to give an accurate estimate of the probability of AMI is argued and three categories of performance measure are described, namely discriminatory ability, sharpness, and reliability. Numerical performance measures for each category are given and applied. The optimum classifier, based solely upon the samples take on admission, was the logistic regression classifier using FDA preprocessing. This gave an accuracy of 0.85 (95% confidence interval: 0.78–0.91) and a normalised Brier score of 0.89. When samples at both admission and a further time, 1–6&nbsp;h later, were included, the performance increased significantly, showing that logistic regression classifiers can indeed use the information from the five cardiac markers to accurately and reliably estimate the probability AMI.",
    "citation_count": 26,
    "year": "2009/12",
    "authors": [
        {
            "name": "Wilson, Paul C.",
            "country": "UK"
        },
        {
            "name": "Irwin, George W.",
            "country": "UK"
        },
        {
            "name": "Lamont, John V.",
            "country": "UK"
        },
        {
            "name": "Harrison, Robert F.",
            "country": "UK"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}