{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01368-8",
    "title": "Research on distance measurement of vehicles in front of campus patrol vehicles based on monocular vision",
    "abstract": "The technology of intelligent vehicle perception system based on vision sensor is becoming more and more mature, and many distance measurement methods based on monocular vision have been proposed. However, less attention has been paid to the experiment and application of the distance measurement of the vehicle in front of the campus intelligent patrol vehicle. In this paper, two monocular visual distance measurement methods based on the width of the target detection object and the distance between the target detection object and the ground contact point are proposed. Two distance measurement models are proposed according to the principle of camera imaging model and the principle of coordinate system transformation. Then, two kinds of distance measurement experiments are designed and compared. The experimental results show that the measurement method based on the contact point between the target and the ground is poor, but the absolute error is less than 0.67&nbsp;m. The overall error of distance measurement method based on license plate width is the smallest, and the absolute error is less than 0.15&nbsp;m. The distance measurement error of the detection box based on the width of the vehicle body is large, and the absolute error is kept within 0.31&nbsp;m. The measurement accuracy of the two methods for the distance measurement of the vehicle in front of the campus patrol vehicle meets the detection requirements. This work is significant to the research on the distance measurement of the vehicle in front of campus patrol vehicles and it is of great significance to enhance the safety of the campus patrol vehicle.",
    "citation_count": 46,
    "year": "2024/12",
    "authors": [
        {
            "name": "Zheng, Lei",
            "country": "China"
        },
        {
            "name": "Liu, Lei",
            "country": "China"
        },
        {
            "name": "Lu, Jingyu",
            "country": "China"
        },
        {
            "name": "Tian, Jie",
            "country": "China"
        },
        {
            "name": "Cheng, Yong",
            "country": "China"
        },
        {
            "name": "Yin, Wei",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}