{
    "url": "https://link.springer.com/article/10.1007/s10044-019-00799-y",
    "title": "Robust palm and knuckle ROI extraction in unconstrained environment",
    "abstract": "Palm and knuckle prints can be extracted from a hand using a low-cost camera in a contactless manner. This makes the process of palm and knuckle recognition fast and convenient and solves the hygiene issue for users. A number of challenges arise in such an unconstrained environment: geometric transformations, connected fingers and the existence of finger rings, hand wrist and other false objects. This paper proposes a palm and knuckle ROI extraction method that is robust to these challenges. The method consists of ten simple steps that are mainly based on blob analysis without a need for pre-training or parameters adjustment which facilitates its generalization ability. It is automatically tested on five public hand databases (DBs), four inner and one outer, that cover these challenges, namely Sfax, IITD, PolyU 3D/2D, HGC and BioChanves. Based on the proposed evaluation methodology and the generated ground truth data, the method correctly extracts the palm ROI in more than 99% and the knuckle ROIs in more than 97.8% of each DB. After a massive rotation and scaling tests, the average drop in the accuracy is bounded by 0.01% for palm and 0.7% for knuckles when fingers are separated (first three DBs). The robustness of the proposed method to such challenges facilitates the recognition of palms and knuckles in an unconstrained environment. To make the results fully reproducible, both ground truth data and related source code are made publicly available (All materials are publicly available at https://www.dropbox.com/sh/z84897stmcw0zr0/AADcWvf2_KF5L3xRDCIDsZ5La?dl=0 .)",
    "citation_count": 43,
    "year": "2019/11",
    "authors": [
        {
            "name": "ELSayed, Ahmed S.",
            "country": "Egypt"
        },
        {
            "name": "Ebeid, Hala M.",
            "country": "Egypt"
        },
        {
            "name": "Roushdy, Mohamed",
            "country": "Egypt"
        },
        {
            "name": "Fayed, Zaki T.",
            "country": "Egypt"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}