{
    "url": "https://link.springer.com/article/10.1007/s10044-022-01078-z",
    "title": "Segmentation based 6D pose estimation using integrated shape pattern and RGB information",
    "abstract": "Point cloud is currently the most typical representation in describing the 3D world. However, recognizing objects as well as the poses from point clouds is still a great challenge due to the property of disordered 3D data arrangement. In this paper, a unified deep learning framework for 3D scene segmentation and 6D object pose estimation is proposed. In order to accurately segment foreground objects, a novel shape pattern aggregation module called PointDoN is proposed, which could learn meaningful deep geometric representations from both Difference of Normals (DoN) and the initial spatial coordinates of point cloud. Our PointDoN is flexible to be applied to any convolutional networks and shows improvements in the popular tasks of point cloud classification and semantic segmentation. Once the objects are segmented, the range of point clouds for each object in the entire scene could be specified, which enables us to further estimate the 6D pose for each object within local region of interest. To acquire good estimate, we propose a new 6D pose estimation approach that incorporates both 2D and 3D features generated from RGB images and point clouds, respectively. Specifically, 3D features are extracted via a CNN-based architecture where the input is XYZ map converted from the initial point cloud. Experiments showed that our method could achieve satisfactory results on the publicly available point cloud datasets in both tasks of segmentation and 6D pose estimation.",
    "citation_count": 67,
    "year": "2022/11",
    "authors": [
        {
            "name": "Gu, Chaochen",
            "country": "China"
        },
        {
            "name": "Feng, Qi",
            "country": "China"
        },
        {
            "name": "Lu, Changsheng",
            "country": "China"
        },
        {
            "name": "Zhao, Shuxin",
            "country": "China"
        },
        {
            "name": "Xu, Rui",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}