{
    "url": "https://link.springer.com/article/10.1007/s10044-015-0462-6",
    "title": "Simplified parameters model of PCNN and its application to image segmentation",
    "abstract": "Pulse-coupled neural network (PCNN), which simulates the synchronous oscillation phenomenon in the visual cortex of small mammals, has become a useful model for image processing. In the model, several parameters were usually required to properly set for adjusting the behavior of neurons. However, undesired behavior may occur owing to inappropriate parameters setting. To alleviate this problem, we propose to simplify some parameters of PCNN, and apply it into image segmentation. First, exponential delay factors are abandoned for adjusting the neuron input, and the neural input is then associated with image information as well as pulse output. In addition, neural threshold inherent in PCNN is simplified as an adaptive threshold related to image properties, allowing our model to easily alter the behavior of neurons. Particularly, the characteristic of synchronous pulse is thereby kept by introducing a fuzzy clustering method, instead of linking coefficient for grouping pixels with similarity and spatial proximity through iterative computation. Experimental results on synthetic and real infrared images show that the proposed model has high performance of segmentation. Furthermore, our model has better adaptability for segmenting real-world images when compared with several existing PCNN-based methods and some classic segmentation methods.",
    "citation_count": 32,
    "year": "2016/11",
    "authors": [
        {
            "name": "Zhou, Dongguo",
            "country": "China"
        },
        {
            "name": "Zhou, Hong",
            "country": "China"
        },
        {
            "name": "Gao, Chao",
            "country": "China"
        },
        {
            "name": "Guo, Yongcai",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}