{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01442-9",
    "title": "Source screen identification using difference image mask obtained from images recaptured through screenshots based on spatial rich features",
    "abstract": "As images are integral to many sectors in the digital age, it is essential to ensure their authenticity and integrity. However, the ease of digital image creation and sharing also exposes them to manipulation and misrepresentation, heightening concerns about privacy and misinformation. The process of recapturing, a prevalent anti-forensic technique, poses challenges to tampering detection methods, necessitating effective countermeasures to uphold image credibility. Monitor-screenshots, facilitated by the simplicity of capturing screenshots of Original images displayed on monitors, pose unique challenges in source identification. Addressing this, we propose a novel approach to unveil the screen fingerprint, capturing distinctive irregularities associated with blur exist in Monitor-screenshots for accurate source identification. Leveraging image registration, difference image masking, and sophisticated feature extraction techniques, our method enables precise identification of specific screens, enhancing the authentication of digital content. By scrutinizing screen-specific characteristics and artifacts left during recapture, proposed model can verify the claimed origin of Screenshots, tested on a Screenshot dataset using SVM classifier, offers a robust framework to authenticate digital content and trace its source with precision and reliability, mitigating risks associated with image manipulation and misrepresentation in the digital domain.",
    "citation_count": 58,
    "year": "2025/06",
    "authors": [
        {
            "name": "Anjum, Areesha",
            "country": "India"
        },
        {
            "name": "Islam, Saiful",
            "country": "India"
        },
        {
            "name": "Saleem, Mahreen",
            "country": "India"
        },
        {
            "name": "Siddiqui, Nadia",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}