{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01375-9",
    "title": "Steel surface defect detection based on sparse global attention transformer",
    "abstract": "The detection of surface defects in steel is a fundamental technique for verifying the quality of the material. Despite the widespread use of transformer-based detection methods in defect detection, the precision and speed are still far from satisfactory according to industry standards. A detection model based on sparse global attention is presented in this paper. We proposed a simple sparse sliding-window attention, which localizes self attention for each pixel to its near neighbors. By adjusting dilation values, a larger receptive field can be obtained to improve the detection effect of large-size defects. Then we use the Content-Aware ReAssembly of FEatures (CARAFE) feature upsampling operator, which can aggregate contextual information in the large receptive field and generate features in the predefined region in the way of content-aware to improve the effect of feature fusion. Finally, the EIOU loss is introduced to solve the problem of scale consistency of the bounding box. Through ablation experiments, we analyze the effect of different dilation values on object detection performance. The proposed algorithm achieves the Mean Average Precision (mAP) of 83.7% on the NEU-DET dataset. Through experimentation with the aluminum defect dataset, we have demonstrated that our approach is applicable to other types of defects.",
    "citation_count": 38,
    "year": "2024/12",
    "authors": [
        {
            "name": "Li, Yinghao",
            "country": "China"
        },
        {
            "name": "Han, Zhiyong",
            "country": "China"
        },
        {
            "name": "Wang, Wenmeng",
            "country": "China"
        },
        {
            "name": "Xu, Heping",
            "country": "China"
        },
        {
            "name": "Wei, Yongpeng",
            "country": "China"
        },
        {
            "name": "Zai, Guangjun",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}