{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01444-7",
    "title": "Structured regularization with object size selection using mathematical morphology",
    "abstract": "We propose a novel way to incorporate morphology operators through structured regularization of machine learning models. Specifically, we introduce a feature map in the models that performs structured variable selection. The feature map is automatically processed by approximate morphology operators and is learned together with the model coefficients. Experiments were conducted with linear regression on both synthetic data, demonstrating that the proposed methods are effective in selecting groups of parameters with much less noise than baseline models, and on three-dimensional T1-weighted brain magnetic resonance images (MRI) for age prediction, demonstrating that the proposed methods enforce sparsity and select homogeneous regions of non-zero and relevant regression coefficients. The proposed methods improve interpretability in pattern analysis. The minimum size of features in the structured variable selection can be controlled by adjusting the structuring element in the approximate morphology operator, tailored to the specific study of interest. With these added benefits, the proposed methods still perform on par with commonly used variable selection and structured variable selection methods in terms of the coefficient of determination and the Pearson correlation coefficient.",
    "citation_count": 39,
    "year": "2025/06",
    "authors": [
        {
            "name": "Lin, Disi",
            "country": "Sweden"
        },
        {
            "name": "Hägg, Linus",
            "country": "Sweden"
        },
        {
            "name": "Wadbro, Eddie",
            "country": "Sweden"
        },
        {
            "name": "Berggren, Martin",
            "country": "Sweden"
        },
        {
            "name": "Löfstedt, Tommy",
            "country": "Sweden"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}