{
    "url": "https://link.springer.com/article/10.1007/s10044-008-0128-8",
    "title": "The use of Hartley transform in OCR with application to printed Arabic character recognition",
    "abstract": "Fast Hartley transform (FHT) is an integral transform which shares some features with the Fourier transform. Fourier transform is used successfully in computing the Fourier descriptors which are used in the recognition of characters and objects. In this paper, printed Arabic optical character recognition using Hartley transform is presented. The Hartley descriptors are estimated by applying the FHT to the Arabic printed characters. The contour of the Arabic character primary part is extracted and then FHT is applied to the extracted contours. Hartley features are extracted from the FHT domain. These features are used for the recognition of Arabic characters. It was experimentally proven that the use of 10–20 descriptors gives the best recognition rate. Hence, ten descriptors were used to save computation and processing times. Experimental results using ten Hartley descriptors resulted in a recognition rate of 97% and an error rate of 3%. Arabic characters’ dots and holes were used in addition to the ten Hartley descriptors to enhance the recognition rate. The use of these features resulted in a 97.3 recognition rate, 2% rejection rate, and 0.7% error rate. The dot feature was also used to reduce the number of classes of the Arabic characters without affecting the recognition rate or the number of recognized characters. This technique, based on Hartley descriptors, was compared with the Fourier descriptors calculated from the fast Fourier transform (FFT) and with modified Fourier spectrum (MFS) descriptors. Experimental results have shown that the Hartley descriptors are comparable to the FFT-based Fourier descriptors in terms of recognition rate. The Hartley and FFT-based descriptors are better than the MFS descriptors in terms of recognition rate.",
    "citation_count": 29,
    "year": "2009/12",
    "authors": [
        {
            "name": "Mahmoud, Sabri A.",
            "country": "Saudi Arabia"
        },
        {
            "name": "Mahmoud, Ashraf S.",
            "country": "Saudi Arabia"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}