{
    "url": "https://link.springer.com/article/10.1007/s10044-021-01009-4",
    "title": "Vehicle object detection method based on candidate region aggregation",
    "abstract": "Multi-scale vehicle detection is an important application in the field of object detection, and Feature Pyramid Network (FPN) is an important means to deal with multi-scale object detection tasks. However, baseline method is the common method used in most of the existing network structure, which represents the input image information by selecting one from the output layer of FPN, and discard other layers. This not only limits the performance of the network structure, but also performs poorly when dealing with the problem of excessive scale differences. To solve this problem, a novelty candidate region aggregation network (CRAN) is proposed in this paper. The candidate regions of different feature layers are effectively aggregated to improve the network generalization performance. Specifically, calculate the similarity between different feature layers through a feature quality score module, and use this as a quantity factor to determine the number of candidate regions reserved for the corresponding feature layer. Finally, they are aggregated into a more comprehensive candidate region group. Further, in order to improve the detection efficiency of small objects, an area cross entropy loss function is proposed. It makes the model pay more attention to small targets by adding a monotonic decrease based on the area. Finally, the proposed CRAN and the area cross entropy loss function are applied to the advanced detectors. The experimental results in the KITTI and UA-DETRAC datasets show that this method has good performance on vehicle objects in different scenarios, and can meet the requirements of practical application.",
    "citation_count": 41,
    "year": "2021/11",
    "authors": [
        {
            "name": "Zhang, Luyang",
            "country": "China"
        },
        {
            "name": "Wang, Haitao",
            "country": "China"
        },
        {
            "name": "Wang, Xinyao",
            "country": "China"
        },
        {
            "name": "Liu, Qiang",
            "country": "China"
        },
        {
            "name": "Wang, Huaibin",
            "country": "China"
        },
        {
            "name": "Wang, Hailong",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}