{
    "url": "https://link.springer.com/article/10.1007/s10878-019-00499-7",
    "title": "A multi-objective and multi-period optimization model for urban healthcare waste’s reverse logistics network design",
    "abstract": "Various types of healthcare waste (or medical waste) generated by urban healthcare activities have increased due to the expansion of urban population and medical needs. As healthcare wastes are harmful to both the environment and human health, managing medical waste is becoming progressively more important. Constructing an optimized medical waste recycling network is one of the key problems in the management of urban healthcare waste. This paper conducts a two-stage reverse logistics network design for urban healthcare waste. The first stage involves the prediction of the amount of medical waste. Based on the Grey GM(1,1) prediction model, the amount of medical waste in multi-period of the target hospitals is predicted. In the second stage, a multi-objective model aimed at minimizing operating costs and minimizing environmental impact is developed for facilities allocation decisions, which include the configuration of key facilities such as hospitals, collection centers, transshipment centers, processing centers, and disposal sites, as well as medical waste flow control among facilities. A dynamic approach for the healthcare waste reverse logistics network is constructed by combining the Grey GM(1,1) prediction method with multi-objective optimization model. Sensitivity analysis of key parameters has been performed to analyze their impact on network performance. Some insightful management practices have been revealed.",
    "citation_count": 58,
    "year": "2021/11",
    "authors": [
        {
            "name": "Wang, Zhiguo",
            "country": "People’s Republic of China"
        },
        {
            "name": "Huang, Lufei",
            "country": "People’s Republic of China"
        },
        {
            "name": "He, Cici Xiao",
            "country": "New Zealand"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}