{
    "url": "https://link.springer.com/article/10.1007/s10878-021-00710-8",
    "title": "A simple method for proving lower bounds in the zero-visibility cops and robber game",
    "abstract": "Cops and Robbers is a classical pursuit and evasion game in graph theory, which was introduced by Nowakowski and Winkler and independently by Quilliot. In this paper, we study the zero-visibility cops and robber game, which is a variant of Cops and Robbers. In the zero-visibility cops and robber game, the robber is invisible to the cops throughout the game. We introduce a simple method for proving lower bounds on the zero-visibility cop number. This lower bound method is based on a connection between the zero-visibility cop number and the matching number. Using this technique, we investigate graph joins, lexicographic products of graphs, complete multipartite graphs and split graphs. For each of these classes of graphs, we prove lower bounds and upper bounds on the zero-visibility cop number. We also present a linear time approximation algorithm for computing the lexicographic product of a tree and a graph G. The approximation ratio of this algorithm is bounded by $$|V(G)| / (\\nu (G) + |V(G) {\\setminus } V(\\mathcal {M}(G))| )$$ , where V(G) is the vertex set of G, $$\\nu (G)$$ is the matching number of G, $$\\mathcal {M}(G)$$ is a maximum matching of G and $$V(\\mathcal {M}(G))$$ is the vertex set of $$\\mathcal {M}(G)$$ .",
    "citation_count": 24,
    "year": "2022/07",
    "authors": [
        {
            "name": "Xue, Yuan",
            "country": "Canada"
        },
        {
            "name": "Yang, Boting",
            "country": "Canada"
        },
        {
            "name": "Zilles, Sandra",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}