{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01090-x",
    "title": "Algorithmic and complexity aspects of problems related to total restrained domination for graphs",
    "abstract": "Let G be a graph with vertex set V and a subset $$D\\subseteq V$$ . D is a total dominating set of G if every vertex in V is adjacent to a vertex in D. D is a restrained dominating set of G if every vertex in $$V\\setminus D$$ is adjacent to a vertex in D and another vertex in $$V\\setminus D$$ . D is a total restrained dominating set if D is both a total dominating set and a restrained dominating set. The minimum cardinality of total dominating sets (resp. restrained dominating sets, total restrained dominating sets) of G is called the total domination number (resp. restrained domination number, total restrained domination number) of G, denoted by $$\\gamma _{t}(G)$$ (resp. $$\\gamma _{r}(G)$$ , $$\\gamma _{tr}(G)$$ ). The MINIMUM TOTAL RESTRAINED DOMINATION (MTRD) problem for a graph G is to find a total restrained dominating set of minimum cardinality of G. The TOTAL RESTRAINED DOMINATION DECISION (TRDD) problem is the decision version of the MTRD problem. In this paper, firstly, we show that the TRDD problem is NP-complete for undirected path graphs, circle graphs, S-CB graphs and C-CB graphs, respectively, and that, for a S-CB graph or C-CB graph with n vertices, the MTRD problem cannot be approximated within a factor of $$(1-\\epsilon )\\textrm{ln} n$$ for any $$\\epsilon &gt;0$$ unless $$NP\\subseteq DTIME(n^{O(\\textrm{loglog}n)})$$ . Secondly, for a graph G, we prove that the problem of deciding whether $$\\gamma _{r}(G) =\\gamma _{tr}(G)$$ is NP-hard even when G is restricted to planar graphs with maximum degree at most 4, and that the problem of deciding whether $$\\gamma _{t}(G) =\\gamma _{tr}(G)$$ is NP-hard even when G is restricted to planar bipartite graphs with maximum degree at most 5. Thirdly, we show that the MTRD problem is APX-complete for bipartite graphs with maximum degree at most 4. Finally, we design a linear-time algorithm for solving the MTRD problem for generalized series–parallel graphs.",
    "citation_count": 21,
    "year": "2023/12",
    "authors": [
        {
            "name": "Yang, Yu",
            "country": "China"
        },
        {
            "name": "Wang, Cai-Xia",
            "country": "China"
        },
        {
            "name": "Xu, Shou-Jun",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}