{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0346-y",
    "title": "An approximation algorithm for genome sorting by reversals to recover all adjacencies",
    "abstract": "Genome rearrangement problems have been extensively studied for more than two decades, intended to understand the species evolutionary relationships in terms of the long range genetic mutations at the genome level. While most earlier studies focus on the simplified genomes ignoring gene duplicates, thousands of whole genome sequencing projects reveal that a genome typically carries multiple gene duplicates distributed in various ways along the genome. Given a source genome and a target genome such that one is a re-ordering of the genes in the other, we measure the evolutionary distance by the minimum number of reversals applied on the source genome to recover all the gene adjacencies in the target genome. We define this optimization problem as sorting by reversals to recover all adjacencies, or SBR2RA in short. We show that SBR2RA is APX-hard and uncover some similarities and differences to the classic counterpart, the sorting by reversals problem. From the approximability perspective, we present a $$2 \\alpha $$ -approximation algorithm, where $$\\alpha \\in [1, 2]$$ is the best approximation ratio for a related optimization problem which is suspected to be NP-hard.",
    "citation_count": 19,
    "year": "2019/05",
    "authors": [
        {
            "name": "Zhai, Shanshan",
            "country": "China"
        },
        {
            "name": "Zhang, Peng",
            "country": "China"
        },
        {
            "name": "Zhu, Daming",
            "country": "China"
        },
        {
            "name": "Tong, Weitian",
            "country": "USA"
        },
        {
            "name": "Xu, Yao",
            "country": "Canada"
        },
        {
            "name": "Lin, Guohui",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}