{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0351-1",
    "title": "Balanced tree partition problems with virtual nodes",
    "abstract": "We study two variants of the Balanced Tree Partition (BTP for short) problem, whose goal is to find the minimum number of edges such that a partition of vertices into sets of equal size can be obtained after deleting those edges. We consider the BTP problem over trees with virtual nodes, which is motivated by the real applications in storing tree structured data distributively. Different from the traditional BTP problem, after deleting an edge from the tree, two virtual nodes must be added to provide the ability to recover the edge when computing, which will increase the size of some set in the partition and the set may become too large and need further splitting. Depending on whether or not to consider the partition set number k to be a parameter, to investigate the balanced tree partition methods over trees with virtual nodes, we formally defined two specific problems, $$k$$ -VBTP and VBTP. The computational complexity and inapproximability of $$k$$ -VBTP are analyzed, for the VBTP problem, a polynomial time algorithm is designed to find the optimal solution based on dynamic programming. Finally, the connections between $$k$$ -VBTP and VBTP are built, and based the algorithm for VBTP, we design a heuristic algorithm for $$k$$ -VBTP with performance guarantee.",
    "citation_count": 32,
    "year": "2019/05",
    "authors": [
        {
            "name": "Ning, Baoling",
            "country": "China"
        },
        {
            "name": "Li, Jianzhong",
            "country": "China"
        },
        {
            "name": "Jiang, Shouxu",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}