{
    "url": "https://link.springer.com/article/10.1007/s10878-021-00721-5",
    "title": "Capacitated inverse optimal value problem on minimum spanning tree under bottleneck Hamming distance",
    "abstract": "We consider the capacitated inverse optimal value problem on minimum spanning tree under Hamming distance. Given a connected undirected network $$G=(V,E)$$ and a spanning tree $$T^0$$ , we aim to modify the weights of the edges such that $$T^0$$ is not only the minimum spanning tree under the new weights but also the weight of $$T^0$$ is equal to a given value K. The objective is to minimize the modification cost under bottleneck Hamming distance. We add a lower bound l and an upper bound u on the modification of weights and consider three cases (uncapacitated, lower bounded, capacitated) of the problem based on the bound vectors. Suppose $$l=-\\,\\infty , u=+\\,\\infty $$ in the uncapacitated problem, $$l&gt;-\\,\\infty , u=+\\,\\infty $$ in the lower bounded problem and $$l&gt;-\\,\\infty , u&lt;+\\,\\infty $$ in the capacitated problem. We present three mathematical models of these problems. After analyzing the properties, we develop three strongly polynomial time algorithms based on binary search to solve the problems. The time complexities for solving the uncapacitated, the lower bounded and capacitated problems are all $$O(|V| |E| \\log |E|)$$ time. Finally, we do some numerical experiments to show the effectiveness of the algorithms.",
    "citation_count": 24,
    "year": "2021/05",
    "authors": [
        {
            "name": "Wang, Hui",
            "country": "China"
        },
        {
            "name": "Guan, Xiucui",
            "country": "China"
        },
        {
            "name": "Zhang, Qiao",
            "country": "China"
        },
        {
            "name": "Zhang, Binwu",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}