{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01052-3",
    "title": "Cloud model for new energy vehicle supply chain management based on growth expectation",
    "abstract": "The goal of supply chain management is to enhance output levels through the integration and collaboration of supply chain members. As such, identifying high-quality cooperative members is critical. However, many decision-making models for supply chain management neglect the consideration of growth expectations for these members, resulting in an unstable decision-making process. Therefore, it is essential to incorporate growth expectations into the decision-making process. To reduce ambiguity, we propose using cloud theory to quantify growth expectations and establish a cloud model of growth expectations. Our study underscores the importance of considering growth expectations when selecting supply chain cooperative members. By utilizing the cloud model of growth expectations, we provide a more comprehensive decision-making approach that enables decision-makers to assess the suitability of potential cooperative members and select the best member based on a multi-attribute decision-making process. We demonstrate the effectiveness of our method through case studies, which ensures its practicality and usability in real-world applications. Ultimately, our method offers a more efficient means of selecting cooperative members, which is expected to enhance output levels and increase supply chain efficiency.",
    "citation_count": 39,
    "year": "2023/07",
    "authors": [
        {
            "name": "Zhu, Qingsheng",
            "country": "China"
        },
        {
            "name": "Gao, Kai",
            "country": "China"
        },
        {
            "name": "Liu, Jia-Bao",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}