{
    "url": "https://link.springer.com/article/10.1007/s10878-011-9403-5",
    "title": "Dispatching design for storage-centric wireless sensor networks",
    "abstract": "In a large-scale storage-centric wireless sensor network (SWSN) where data from different clusters are archived at distributed storage nodes, the dispatching design problem is to determine one or multiple storage nodes for each cluster. To achieve high data fidelity in SWSNs, the dispatching design should aim to reduce the data loss due to the network congestion and, at the same time, to prolong the network lifetime by avoiding sending excessive traffic to some particular storage nodes in order to achieve energy consumption balance among the relaying sensors around the storage node. In this paper, we propose an h-peak dispatching design for SWSN. Under such a design, regular traffic volume from each cluster will receive guaranteed data fidelity, and over-expectation traffic will receive best-effort data fidelity. We use an h-peak model to characterize the traffic deviation which assumes that at most h clusters may have over-expectation traffic simultaneously at a storage node. By incorporating h into the dispatching decision rather than assuming that all clusters may reach their traffic spikes simultaneously, the proposed h-peak dispatching design can achieve high data fidelity in SWSNs.",
    "citation_count": 10,
    "year": "2012/11",
    "authors": [
        {
            "name": "Li, Minming",
            "country": "Hong Kong"
        },
        {
            "name": "Liu, Qin",
            "country": "P.R. China"
        },
        {
            "name": "Wang, Jianping",
            "country": "Hong Kong"
        },
        {
            "name": "Zhao, Yingchao",
            "country": "Hong Kong"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}