{
    "url": "https://link.springer.com/article/10.1007/s10878-025-01280-9",
    "title": "Exact and approximation algorithms for the multi-depot data mule scheduling with handling time and time span constraints",
    "abstract": "In this paper, we investigate the data mule scheduling with handling time and time span constraints (DMSTC) in which the goal is to minimize the number of data mules dispatched from a depot that are used to serve target sensors located on a wireless sensor network. Each target sensor is associated with a handling time and each dispatched data mule must return to the original depot before time span $$D$$ . We also study a variant of the DMSTC, denoted by DMSTC $$_l$$ in which the objective is to minimize the total travel distance of the data mules dispatched. We give exact and approximation algorithms for the DMSTC/DMSTC $$_l$$ on a path and their multi-depot version. For the DMSTC, we show an $$O(n^4)$$ polynomial time algorithm for the uniform 2-depot DMSTC on a path with at least one depot being on the endpoint of the path, where $$n$$ indicates the number of target sensors and an instance of the DMSTC is called uniform if all the handling times are identical. We present a new 2-approximation algorithm for the non-uniform DMSTC on a path and conduct extensive computational experiments on randomly generated instances to show its good practical performance. For the DMSTC $$_l$$ , we derive an $$O((n+k)^{2})$$ -time algorithm for the uniform multi-depot DMSTC $$_l$$ on a path, where $$k$$ is the number of depots. For the non-uniform multi-depot DMSTC $$_l$$ on a path or cycle, we give a 2-approximation algorithm.",
    "citation_count": 14,
    "year": "2025/04",
    "authors": [
        {
            "name": "Liu, Minqin",
            "country": "China"
        },
        {
            "name": "Yu, Wei",
            "country": "China"
        },
        {
            "name": "Liu, Zhaohui",
            "country": "China"
        },
        {
            "name": "Guo, Xinmeng",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}