{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9849-y",
    "title": "How patient compliance impacts the recommendations for colorectal cancer screening",
    "abstract": "Colorectal cancer (CRC) is one of the most common cancers and the second leading cause of cancer death in the U.S. As a measure of prevention, timely screening is necessary for patients as it can spell the difference between life and death. Fecal occult blood tests (FOBTs) is used for the average-risk patient. Colonoscopy is used for the high-risk and the average-risk patient whose outcome of FOBTs is positive. While colonoscopy is considered to be the most accurate test for detecting colorectal cancer, its side-effects have serious consequences that could result in intestinal perforation and even death. As a result, some patients do not follow the physicians’ advices. It is therefore important to design a good screening schedule that balances the risk of CRC and the side-effects of colonoscopy, and at the same time to take the patient’s personal characteristics and compliance into account. We formulate a finite-horizon, partially observable Markov decision process model to optimize the CRC screening program for both average and high-risk patients. Our model incorporates information of prior screening history, patient compliance and more personal risk factors. We find that the patients with low compliance rate should be recommended to undergo colonoscopy more frequently.",
    "citation_count": 23,
    "year": "2015/11",
    "authors": [
        {
            "name": "Li, Jing",
            "country": "People’s Republic of China"
        },
        {
            "name": "Dong, Ming",
            "country": "People’s Republic of China"
        },
        {
            "name": "Ren, Yijiong",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yin, Kaiqi",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}