{
    "url": "https://link.springer.com/article/10.1007/s10878-025-01270-x",
    "title": "Improved black widow optimization algorithm for multi-objective hybrid flow shop batch-scheduling problem",
    "abstract": "Sustainable scheduling is getting more and more attention with economic globalization and sustainable manufacturing. However, fewer studies on the batch scheduling problem consider energy consumption. This paper conducts an investigation into the multi-objective hybrid flow shop batch-scheduling problem with the objectives of minimizing both the makespan and electrical energy consumption. The study aims to select the optimal scheduling solution for the problem by considering batch splitting for all products. In this paper, we propose an improved black widow optimization (IBWO) algorithm to study the problem, which incorporates procreation, cannibalism, and mutation behaviors to maintain the population’s diversity and stability. To achieve our objectives, we use the dynamic entropy weight topsis method to select individual spiders. Finally, we use the nature theorem construction method, which relies on the property theorem, to solve the Pareto solution set and derive the optimization scheme for the hybrid flow shop batch scheduling problem. We verify the effectiveness of the proposed IBWO on instances of varying sizes. When we keep all other factors and cases constant, we compare the IBWO to the NSGA2 algorithm and find that it converges faster for both goals and has lower goals than the NSGA2.",
    "citation_count": 62,
    "year": "2025/04",
    "authors": [
        {
            "name": "Liu, Xiyang",
            "country": "China"
        },
        {
            "name": "Luan, Fangjun",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}