{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0345-z",
    "title": "Improved bounds for the greedy strategy in optimization problems with curvature",
    "abstract": "Consider the problem of choosing a set of actions to optimize a real-valued polymatroid function subject to matroid constraints. The greedy strategy, an approximate solution, is known to satisfy some bounds in terms of the total curvature. The total curvature depends on function values on sets outside the constraint matroid. If the function is defined only on the matroid, the problem still makes sense, but the existing bounds involving the total curvature do not apply, which is puzzling. This motivates an alternative formulation of such bounds. The first question we address is whether it is possible to extend a polymatroid function defined on a matroid to one on the entire power set. This was recently shown to be negative in general. Here, we provide necessary and sufficient conditions for the existence of an incremental extension of a polymatroid function defined on the uniform matroid of rank k to one with rank $$k+1$$ , together with an algorithm for constructing the extension. Whenever a polymatroid function defined on a matroid can be extended to the entire power set, the bounds involving the total curvature of the extension apply. However, these bounds still depend on sets outside the constraint matroid. Motivated by this, we define a new notion of curvature called partial curvature, involving only sets in the matroid. We derive necessary and sufficient conditions for an extension to have a total curvature equal to the partial curvature. Moreover, we prove that the bounds in terms of the partial curvature are in general improved over the previous ones. We illustrate our results with two contrasting examples motivated by practical problems.",
    "citation_count": 12,
    "year": "2019/05",
    "authors": [
        {
            "name": "Liu, Yajing",
            "country": "USA"
        },
        {
            "name": "Chong, Edwin K. P.",
            "country": "USA"
        },
        {
            "name": "Pezeshki, Ali",
            "country": "USA"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}