{
    "url": "https://link.springer.com/article/10.1007/s10878-020-00623-y",
    "title": "Joint optimal pricing and advertising policies in a fashion supply chain under the ODM strategy considering fashion level and goodwill",
    "abstract": "The original design manufacturing (ODM) strategy has become popular in the fashion supply chain field. We consider apparel’s fashion level and advertising effort as important influential factors on goodwill, and present a differential game involving a fashion brand and a supplier. The supplier controls the design improvement effort applied to the apparel and sells it to end consumers through the fashion brand, which controls the advertising effort and retail price. In the case in which the demand for products is affected by goodwill, retail price and promotion, centralised and decentralised differential game models are constructed. The dynamic wholesale price contract is then introduced to solve the external coordination problem. Furthermore, a sensitivity analysis of the related parameters is conducted using the numerical simulation method. It is found that the introduction of the dynamic wholesale price contract increases design investment, promotion effort, and goodwill towards and demand for the products. We also derive the feasible region of wholesale prices in which both members are willing to implement the commitment scenario. The win–win region becomes larger as the effectiveness of design innovation increases, whereas it becomes smaller as price sensitivity increases.",
    "citation_count": 55,
    "year": "2022/07",
    "authors": [
        {
            "name": "Chen, Qi",
            "country": "China"
        },
        {
            "name": "Xu, Qi",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}