{
    "url": "https://link.springer.com/article/10.1007/s10878-011-9397-z",
    "title": "Min-energy broadcast in mobile ad hoc networks with restricted motion",
    "abstract": "This paper concerns about energy-efficient broadcasts in mobile ad hoc networks, yet in a model where each station moves on the plane with uniform rectilinear motion. Such restriction is imposed to discern which issues arise from the introduction of movement in the wireless ad hoc networks. Given a transmission range assignment for a set of n stations S, we provide an polynomial O(n 2)-time algorithm to decide whether a broadcast operation from a source station could be performed or not. Additionally, we study the problem of computing a transmission range assignment for S that minimizes the energy required in a broadcast operation. An O(n 3log n)-time algorithm for this problem is presented, under the assumption that all stations have equally sized transmission ranges. However, we prove that the general version of such problem is NP-hard and not approximable within a (1−o(1))ln n factor (unless NP⊂DTIME(n O(log log n))). We then propose a polynomial time approximation algorithm for a restricted version of that problem.",
    "citation_count": 13,
    "year": "2012/11",
    "authors": [
        {
            "name": "Díaz-Báñez, J. M.",
            "country": "Spain"
        },
        {
            "name": "Fabila-Monroy, R.",
            "country": "México"
        },
        {
            "name": "Flores-Peñaloza, D.",
            "country": "México"
        },
        {
            "name": "Heredia, M. A.",
            "country": "México"
        },
        {
            "name": "Urrutia, J.",
            "country": "México"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}