{
    "url": "https://link.springer.com/article/10.1007/s10878-024-01224-9",
    "title": "Non-submodular maximization with a decomposable objective function",
    "abstract": "We study the non-submodular maximization problem, whose objective function can be expressed as the Difference between two Set (DS) functions or the Ratio between two Set (RS) functions. For the cardinality-constrained and unconstrained DS maximization problems, we present several deterministic algorithms and our analysis shows that the algorithms can provide provable approximation guarantees. As an application, we manage to derive an improved approximation bound for the DS minimization problem under certain conditions compared with existing results. As for the RS maximization problem, we show that there exists a polynomial-time reduction from the approximation of RS maximization to the approximation of DS maximization. Based on this reduction, we derive the first approximation bound for the cardinality-constrained RS maximization problem. We also devise algorithms for the unconstrained problem and analyze their approximation guarantees. By applying our results to the problem of optimizing the ratio between two supermodular functions, we give an answer to the question posed by Bai et al. (in Proceedings of The 33rd international conference on machine learning (ICML), 2016). Moreover, we give an example to illustrate that whether the set function is normalized has an effect on the approximability of the RS optimization problem.",
    "citation_count": 22,
    "year": "2024/12",
    "authors": [
        {
            "name": "Lu, Cheng",
            "country": "China"
        },
        {
            "name": "Yang, Wenguo",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}