{
    "url": "https://link.springer.com/article/10.1007/s10878-020-00678-x",
    "title": "Novel distribution-free model and method for stochastic disassembly line balancing with limited distributional information",
    "abstract": "Recycling of end-of-life (EOL) products has drawn much attention from both researchers and practitioners over the recent decades due to the environmental protection, sustainable development and economic benefits. For an EOL product recycling system, a core problem is to separate their useful and hazardous parts by an efficient disassembly line in which there exist uncertain factors, such as stochastic task processing time. The corresponding combinatorial optimization problems aim to optimally choose alternative task processes, determine the number of workstations to be opened, and assign the disassembly tasks to the opened workstations. In most existing studies, the probability distribution of task processing time is assumed to be known. However, the complete information of probability distribution is often unavailable due to various factors. In this study, we address a disassembly line balancing problem to minimize the total disassembly cost in which only limited information of probability distribution, i.e., the mean, lower and upper bounds of task processing time, is known. Based on problem analysis, some properties are derived for the construction of a new distribution-free model. Furthermore, an effective second-order cone program approximation-based method is developed to solve the proposed model. Experimental results of benchmark examples and newly generated instances demonstrate the effectiveness and efficiency of the proposed method in dealing with stochastic disassembly line balancing with limited distributional information. Finally, managerial insights and future research are discussed.",
    "citation_count": 40,
    "year": "2022/07",
    "authors": [
        {
            "name": "Hu, Peng",
            "country": "China"
        },
        {
            "name": "Chu, Feng",
            "country": "France"
        },
        {
            "name": "Fang, Yunfei",
            "country": "China"
        },
        {
            "name": "Wu, Peng",
            "country": "France"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}