{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0358-7",
    "title": "On operations preserving semi-transitive orientability of graphs",
    "abstract": "We consider the class of semi-transitively orientable graphs, which is a much larger class of graphs compared to transitively orientable graphs, in other words, comparability graphs. Ever since the concept of a semi-transitive orientation was defined as a crucial ingredient of the characterization of alternation graphs, also known as word-representable graphs, it has sparked independent interest. In this paper, we investigate graph operations and graph products that preserve semi-transitive orientability of graphs. The main theme of this paper is to determine which graph operations satisfy the following statement: if a graph operation is possible on a semi-transitively orientable graph, then the same graph operation can be executed on the graph while preserving the semi-transitive orientability. We were able to prove that this statement is true for edge-deletions, edge-additions, and edge-liftings. Moreover, for all three graph operations, we show that the initial semi-transitive orientation can be extended to the new graph obtained by the graph operation. Also, Kitaev and Lozin explicitly asked if certain graph products preserve the semi-transitive orientability. We answer their question in the negative for the tensor product, lexicographic product, and strong product. We also push the investigation further and initiate the study of sufficient conditions that guarantee a certain graph operation to preserve the semi-transitive orientability.",
    "citation_count": 8,
    "year": "2019/05",
    "authors": [
        {
            "name": "Choi, Ilkyoo",
            "country": "Republic of Korea"
        },
        {
            "name": "Kim, Jinha",
            "country": "Republic of Korea"
        },
        {
            "name": "Kim, Minki",
            "country": "Israel"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}