{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9833-6",
    "title": "Optimization techniques for robust multivariate location and scatter estimation",
    "abstract": "Computation of typical statistical sample estimates such as the median or least squares fit usually require the solution of an unconstrained optimization problem with a convex objective function, that can be solved efficiently by various methods. The presence of outliers in the data dictates the computation of a robust estimate, which can be defined as the optimum statistical estimate for a subset that contains at least half of the observations. The resulting problem is now a combinatorial optimization problem which is often computationally intractable. Classical statistical methods for multivariate location $$\\varvec{\\mu }$$ and scatter matrix $$\\varvec{\\varSigma }$$ estimation are based on the sample mean vector and covariance matrix, which are very sensitive in the presence of outlier observations. We propose a new method for robust location and scatter estimation which is composed of two stages. In the first stage an unbiased multivariate $$L_{1}$$ -median center for all the observations is attained by a novel procedure called the least trimmed Euclidean deviations estimator. This robust median defines a coverage set of observations which is used in the second stage to iteratively compute the set of outliers which violate the correlational structure of the data set. Extensive computational experiments indicate that the proposed method outperforms existing methods in accuracy, robustness and computational time.",
    "citation_count": 25,
    "year": "2016/05",
    "authors": [
        {
            "name": "Chatzinakos, C.",
            "country": "Greece"
        },
        {
            "name": "Pitsoulis, L.",
            "country": "Greece"
        },
        {
            "name": "Zioutas, G.",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}