{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9846-1",
    "title": "Prioritized surgery scheduling in face of surgeon tiredness and fixed off-duty period",
    "abstract": "In this paper, we apply a scheduling model to address the single day surgery scheduling problem for single operating room (OR). The OR operational cost and patients’ satisfaction need to be balanced. We optimize the scheduling of surgeries with two priority levels in an integrated manner, given the OR is off-duty for a fixed period. Surgeon’s accumulated tiredness during working hours, and controllable surgery durations are modeled. After deriving the NP-hardness of the problem, we first solve optimally two special cases in pseudo-polynomial time, and then design a hybrid evolutionary multi-objective algorithm for the general case. Iterated local search is embedded into the elitist non-dominated sorting genetic algorithm (NSGA-II) framework, and Pareto optimal property is utilized to guide evolution towards promising areas in solution space. Finally computational studies with data from a hospital in P.R. China are performed to verify the value of algorithm hybridization against the commercial solver and original NSGA-II, and to verify the value of integrated optimization against sequential decision-making.",
    "citation_count": 20,
    "year": "2015/11",
    "authors": [
        {
            "name": "Wang, Dujuan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Liu, Feng",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yin, Yunqiang",
            "country": "People’s Republic of China"
        },
        {
            "name": "Wang, Jianjun",
            "country": "People’s Republic of China"
        },
        {
            "name": "Wang, Yanzhang",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}