{
    "url": "https://link.springer.com/article/10.1007/s10878-019-00505-y",
    "title": "Research on dispatch of drugs and consumables in SPD warehouse of large scale hospital under uncertain environment: take respiratory consumables as an example",
    "abstract": "This paper studies the supply chain management of medical supply-processing-distribution (SPD) and models the logistics scheduling of drugs and consumables in SPD warehouse under uncertain environment. Firstly, the key management materials are determined, and then SPD distributors are set up for the key management materials to speed up the turnover of drugs and consumables, reduce the loss and unnecessary wastage, and reduce and control the operating costs of hospital departments. This paper establishes an optimization model for achieving the highest total efficiency of drug or consumables distribution and receipt on the premise of sending the least SPD distributors to release the nurses who plan to apply for, count and keep the materials in the second-level warehouse, and return the nursestime to patients. Through the example of SPD distribution of infusion devices consumed by respiratory consumables in a large scale A hospital, the feasibility of using this model to calculate the optimal allocation method of SPD material distributors and the establishment of SPD material distributors in each department is verified. Finally, this paper compares the effects before and after practice and verifies the correctness and effectiveness of the model.",
    "citation_count": 21,
    "year": "2021/11",
    "authors": [
        {
            "name": "Lin, Huidan",
            "country": "China"
        },
        {
            "name": "Li, Qun",
            "country": "China"
        },
        {
            "name": "Xu, Xueguo",
            "country": "China"
        },
        {
            "name": "Zhang, Ying",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}