{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0325-3",
    "title": "Scheduling with interjob communication on parallel processors",
    "abstract": "Consider a scheduling problem in which a set of tasks needs to be scheduled on m parallel processors. Each task $$T_i$$ consists of a set of jobs with interjob communication demands, represented by a weighted, undirected graph $$G_i$$ . The processors are assumed to be interconnected by a shared communication channel, which can be used by jobs to communicate among each other while being processed in parallel. In each time step, the scheduler assigns jobs to the processors and allows any processed job to use a certain capacity of the channel in order to satisfy (parts of) its communication demands to adjacent jobs processed in the same step. The goal is to find a schedule with minimum length in which the communication demands of all jobs are satisfied. We show that this problem is NP-hard in the strong sense even if the number of processors is constant and the underlying graph is a single path or a forest with arbitrary constant maximum degree. Consequently, we design and analyze approximation algorithms with asymptotic approximation ratio $$\\min \\{1.8, 1.5 \\frac{m}{m-1}\\}+1$$ if the underlying graph G, the union of the $$G_i$$ , is a forest. For general graphs it is $$\\min \\left\\{ 1.8, \\frac{1.5m}{m-1}\\right\\} \\cdot \\left( \\text {arb}(G) + \\frac{5}{3}\\right) $$ , where $$\\text {arb}(G)$$ denotes the arboricity of G.",
    "citation_count": 14,
    "year": "2018/11",
    "authors": [
        {
            "name": "König, Jürgen",
            "country": "Germany"
        },
        {
            "name": "Mäcker, Alexander",
            "country": "Germany"
        },
        {
            "name": "Meyer auf der Heide, Friedhelm",
            "country": "Germany"
        },
        {
            "name": "Riechers, Sören",
            "country": "Germany"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}