{
    "url": "https://link.springer.com/article/10.1007/s10596-022-10164-4",
    "title": "A DEIM driven reduced basis method for the diffuse Stokes/Darcy model coupled at parametric phase-field interfaces",
    "abstract": "In this article, we develop a reduced basis method for efficiently solving the coupled Stokes/Darcy equations with parametric internal geometry. To accommodate possible changes in topology, we define the Stokes and Darcy domains implicitly via a phase-field indicator function. In our reduced order model, we approximate the parameter-dependent phase-field function with a discrete empirical interpolation method (DEIM) that enables affine decomposition of the associated linear and bilinear forms. In addition, we introduce a modification of DEIM that leads to non-negativity preserving approximations, thus guaranteeing positive-semidefiniteness of the system matrix. We also present a strategy for determining the required number of DEIM modes for a given number of reduced basis functions. We couple reduced basis functions on neighboring patches to enable the efficient simulation of large-scale problems that consist of repetitive subdomains. We apply our reduced basis framework to efficiently solve the inverse problem of characterizing the subsurface damage state of a complete in-situ leach mining site.",
    "citation_count": 73,
    "year": "2022/12",
    "authors": [
        {
            "name": "Stoter, Stein K.F.",
            "country": "Germany"
        },
        {
            "name": "Jessen, Etienne",
            "country": "Germany"
        },
        {
            "name": "Niedens, Viktor",
            "country": "Germany"
        },
        {
            "name": "Schillinger, Dominik",
            "country": "Germany"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}