{
    "url": "https://link.springer.com/article/10.1023/A:1021287013566",
    "title": "A Finite-Volume Method with Hexahedral Multiblock Grids for Modeling Flow in Porous Media",
    "abstract": "This paper presents a finite-volume method for hexahedral multiblock grids to calculate multiphase flow in geologically complex reservoirs. Accommodating complex geologic and geometric features in a reservoir model (e.g., faults) entails non-orthogonal and/or unstructured grids in place of conventional (globally structured) Cartesian grids. To obtain flexibility in gridding as well as efficient flow computation, we use hexahedral multiblock grids. These grids are locally structured, but globally unstructured. One major advantage of these grids over fully unstructured tetrahedral grids is that most numerical methods developed for structured grids can be directly used for dealing with the local problems. We present several challenging examples, generated via a commercially available tool, that demonstrate the capabilities of hexahedral multiblock gridding. Grid quality is discussed in terms of uniformity and orthogonality. The presence of non-orthogonal grid and full permeability tensors requires the use of multi-point discretization methods. A flux-continuous finite-difference (FCFD) scheme, previously developed for stratigraphic hexahedral grid with full-tensor permeability, is employed for numerical flow computation. We extend the FCFD scheme to handle exceptional configurations (i.e. three- or five-cell connections as opposed to the regular four), which result from employing multiblock gridding of certain complex objects. In order to perform flow simulation efficiently, we employ a two-level preconditioner for solving the linear equations that results from the wide stencil of the FCFD scheme. The individual block, composed of cells that form a structured grid, serves as the local level; the higher level operates on the global block configuration (i.e. unstructured component). The implementation uses an efficient data structure where each block is wrapped with a layer of neighboring cells. We also examine splitting techniques [14] for the linear systems associated with the wide stencils of our FCFD operator. We present three numerical examples that demonstrate the method: (1) a pinchout, (2) a faulted reservoir model with internal surfaces and (3) a real reservoir model with multiple faults and internal surfaces.",
    "citation_count": 32,
    "year": "2002/09",
    "authors": [
        {
            "name": "Lee, S.H.",
            "country": "USA"
        },
        {
            "name": "Jenny, P.",
            "country": "USA"
        },
        {
            "name": "Tchelepi, H.A.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}