{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10316-8",
    "title": "A general approach to computing derivatives for Hessian-based seismic inversion",
    "abstract": "Full waveform inversion (FWI), a powerful geophysical technique for subsurface imaging through seismic velocity-model construction, relies on numerical optimization, thus requiring the computation of derivatives for an objective function. This paper proposes a discrete development for accurate computation of the gradient and Hessian-vector product, providing second-order optimization benefits like higher convergence rates and improved resolution. The approach is a promising alternative for computing the gradient and Hessian action in time-domain FWI, applicable to various geophysical problems. Computational costs and memory requirements are comparable to the Adjoint-State Method and more avorable than Automatic Differentiation. While efficient automatic differentiation algorithms have transformed gradient computation in applications like FWI, challenges may arise in 3D due to unforeseen memory allocations. Our approach addresses this by exploring the reverse mode differentiation algorithm, mapping temporary memory allocations and computational complexity. By means of introducing auxiliary fields all involved wavefield evolutions can be carried out with the very same evolution scheme, in this way simplifying the implementation and focusing the performance improvement effort in a single routine thus reducing the maintenance cost of these algorithms, especially when using GPU implementations.",
    "citation_count": 24,
    "year": "2024/12",
    "authors": [
        {
            "name": "Silva, Bruno S.",
            "country": "Brazil"
        },
        {
            "name": "Costa, Jessé C.",
            "country": "Brazil"
        },
        {
            "name": "Schleicher, Jörg",
            "country": "Brazil"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}