{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10314-w",
    "title": "A novel hierarchical model calibration method for deep water reservoirs under depletion and aquifer influence",
    "abstract": "An ensemble of rigorously history matched reservoir models can help better understand the interactions between heterogeneity and fluid flows, improve forecasting reliability, and locate infill-drilling opportunities to support field development plans. However, developing efficient calibration methods for complex, multi-million cell deep-water models remains a challenge. This paper presents a hierarchical global-local assisted-history matching (AHM) approach with new elements, applied to a complex deep-water reservoir. The method consists of two stages: global and local. In the global stage, the reservoir energy is matched using an evolutionary approach to calibrate the model parameters with build-up and average reservoir pressures. In the local stage, the permeability field is calibrated to production data using a novel streamline-based sensitivity-driven AHM method to ascertain the spatial variability and geologic continuity of local updates. The sensitivity for each streamline is weighted by the water fraction and constrained by a time-of-flight cutoff to focus on water intrusion regions within the near wellbore region. The proposed method is field-tested in a complex deep-water reservoir. The evolutionary approach generates an ensemble of models with well-matched oil production rates and build-up/reservoir pressure using global model parameters. Local updates using streamline-based gradients are then conducted to match the water cut for each ensemble member while maintaining overall pressure match quality. Results show that the hierarchical AHM method significantly reduces the data misfit and is well-suited to primary recovery in a deep-water setting with few producers and under the influence of mild/weak aquifers.",
    "citation_count": 45,
    "year": "2024/12",
    "authors": [
        {
            "name": "Li, Ao",
            "country": "USA"
        },
        {
            "name": "Alpak, Faruk Omer",
            "country": "USA"
        },
        {
            "name": "Jimenez, Eduardo",
            "country": "USA"
        },
        {
            "name": "Yeh, Tzu-hao",
            "country": "USA"
        },
        {
            "name": "Ritts, Andrew",
            "country": "USA"
        },
        {
            "name": "Jain, Vivek",
            "country": "USA"
        },
        {
            "name": "Chen, Hongquan",
            "country": "USA"
        },
        {
            "name": "Datta-Gupta, Akhil",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}