{
    "url": "https://link.springer.com/article/10.1007/s10596-021-10083-w",
    "title": "A pore space reconstruction method of shale based on autoencoders and generative adversarial networks",
    "abstract": "Shale oil and shale gas, as widely distributed unconventional resources, have attracted much attention at present due to the fast-increasing demands for energy. Since shale is the storage medium for shale oil and gas, its microscopic characteristics surely will influence its own storage ability and the difficulty of exploitation. The internal structures of shale can be studied based on establishing a digital core that can describe the characteristics of shale. There are two mainstream methods for the reconstruction of digital cores: the physical experimental methods and numerical reconstruction methods. The physical experimental methods usually need real rock samples as experimental materials, causing the high cost of experimental equipment and great difficulty of preparing the samples, especially the fragile samples such as shale. Numerical reconstruction methods are therefore often combined with the physical experimental methods to reconstruct digital cores, while the traditional numerical methods suffer from numerous reconstruction time. Recently, with the rapid development of deep learning and its branches, e.g., generative adversarial networks (GANs), the reconstruction method of digital cores possibly can benefit from the inherent ability of extracting characteristics by GAN. However, GAN may have slow training speed and unstable training process, so autoencoders (AEs) are introduced to address the issue of GAN. In this paper, combining the advantages of the two models (i.e., AE and GAN), a method AE-GAN is proposed to implement the 3D reconstruction of shale, and the effectiveness of this method is proven by comparing to some typical numerical methods.",
    "citation_count": 32,
    "year": "2021/12",
    "authors": [
        {
            "name": "Zhang, Ting",
            "country": "China"
        },
        {
            "name": "Li, Deya",
            "country": "China"
        },
        {
            "name": "Lu, Fangfang",
            "country": "China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}