{
    "url": "https://link.springer.com/article/10.1007/s10596-021-10089-4",
    "title": "Accelerating the multi-parameter least-squares reverse time migration using an appropriate preconditioner",
    "abstract": "Least-squares reverse time migration has proven to be the state-of-the-art for linear imaging technique of complex subsurface structures. Assuming a variable-density acoustic medium, least-squares iterations have the potential to compensate for the artifacts caused by finite frequency of the seismic source, limited acquisition aperture, uneven illumination and parameter cross-talk. The main drawback of such an iterative imaging scheme is the substantial computational expense induced by additional modeling/adjoint steps at each iteration. To accelerate the convergence rate, we propose to leverage the variable-density pseudoinverse extended Born operator as a preconditioner. Our imaging scheme consists of two main steps. We first construct a true-amplitude extended image through Conjugate Gradient iterations with/without preconditioning. Then, by applying a 2D Radon transform, we simultaneously estimate the physical parameters from the angle-domain response using a weighted least-squares method. The second step does not involve wave propagation terms. Through numerical experiments, we show that the proposed preconditioning scheme not only largely reduces the required number of iterations to achieve a given data misfit but also significantly increases the quality of the inverted images even in presence of strong parameter cross-talk and inaccurate migration background models. This is further confirmed by analyzing the shape of the multi-parameter Hessian obtained on a model with limited size.",
    "citation_count": 70,
    "year": "2021/12",
    "authors": [
        {
            "name": "Farshad, Milad",
            "country": "France"
        },
        {
            "name": "Chauris, Hervé",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}