{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9684-6",
    "title": "An application of Green’s function technique for computing well inflow without radial flow assumption",
    "abstract": "Well modeling plays an important role in numerical reservoir simulation. The main difficulty in well modeling is the difference in scale between the wellbore radius and well gridblock dimension used in the simulation. The Peaceman equation is widely used in reservoir simulation to match gridblock pressure to the local solution of the diffusivity equation describing the flow near the well. However, this approach was developed under the assumption of radial flow. At the same time, the well inflow equation can be solved within the Green’s function (GF) formalism which allows the solution to be obtained without the assumption of radial flow. The GF solution can be presented as a series over the eigenvalues of the Laplace differential operator. However, this series converges conditionally and its direct summation is time-consuming. In Posvyanskii et al. (2008), a method for fast summation of such a series was proposed and successfully applied for analyzing the pressure build up curves. In this paper, we adopt the same technique for calculating the well indices for horizontal, slanted and partially penetrated wells. Additionally, the role of different boundary conditions is considered. The semi-analytical expressions for well indices are obtained and compared to the solution of the Peaceman equation. It is shown that in some cases, the difference between these solutions can be significant. The use of the obtained expression in numerical flow simulation allows well inflow to be modeled with high accuracy even on a coarse grid.",
    "citation_count": 16,
    "year": "2017/12",
    "authors": [
        {
            "name": "Novikov, A. V.",
            "country": "Russia"
        },
        {
            "name": "Posvyanskii, V. S.",
            "country": "Russia"
        },
        {
            "name": "Posvyanskii, D. V.",
            "country": "Russia"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}