{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9651-2",
    "title": "Analysis of adaptive grid refinement technique for simulations of ES-SAGD in heavy oil reservoirs",
    "abstract": "The intrinsic advantages of hybrid steam-solvent or solvent-based thermal recovery methods for heavy oil include faster oil production, higher ultimate recovery factor, reduction of energy, and water treatment expenses, better control of GHG emission. Light hydrocarbon injection implies improved heavy oil mobilization, steam and solvent condensation, solvent to oil mixing, and oil viscosity effect at moderate temperature. Typically, field-scale reservoir simulation models are built on numerical grids with cell sizes making practically difficult accurate description of heat and mass transport at the edge of the gas chamber. Outside this zone, this typical grid can be acceptable. The adaptive grid refinement may offer a compromise solution if the numerical model accepts the necessary degree of refinement. In our current work, we present a methodology of large-scale numerical simulations for so-called expanding solvent SAGD (ES-SAGD) processes using adaptive dynamic gridding at different degrees of the refinement. The adaptive grid refinement is a Cartesian grid amalgamation process based on threshold values of predefined trigger variables. Comparison is performed between oil production mechanism interactions for typical Athabasca bitumen and illustrated with temperature and solvent concentration fields for different discretization sizes. Good adaptive grid refinement results have been obtained for the models based on adaptive implicit approach with high refinement degree, in heterogeneous reservoir (at relatively small correlation length) in vertical 2D cross-section. The numerical performance aspects including the CPU time analysis with and without the use of dynamic gridding are presented in some detail.",
    "citation_count": 14,
    "year": "2017/12",
    "authors": [
        {
            "name": "Perez-Perez, A.",
            "country": "France"
        },
        {
            "name": "Gadou, M.",
            "country": "France"
        },
        {
            "name": "Bogdanov, I.",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}