{
    "url": "https://link.springer.com/article/10.1007/s10596-010-9185-3",
    "title": "Analytical and numerical investigation of multicomponent multiphase WAG displacements",
    "abstract": "In this paper the ability of analytical solutions for four-component three-phase flow to predict displacement efficiency in water alternating gas (WAG) injection processes is studied. First analytical solutions for Riemann problems with injection compositions that are the average water and gas mixture for various WAG injection schemes are presented. These solutions are compared to numerical calculations with variable slug sizes and used to explore the effect of slug size, injecting water vs gas first, and the average injection composition on displacement efficiency in compositional WAG schemes. The example model is partially miscible WAG injection of water and CO2 into an oil reservoir containing C10 and CH4 with and without a mobile aqueous phase present initially. The trailing end of the water and gas profiles are sensitive to whether water or gas is injected first, but the magnitude of the oil bank and the breakthrough time of the injected fluids are accurately predicted by the analytical solutions, even for displacements where large water and gas slugs are injected. Fluctuations in the saturation and composition profiles resulting from the alternating injection sequence in the WAG simulations appear as super-imposed on top of the sequence of rarefaction and shock waves predicted by analytical solutions. As the number of slugs increases, the effect of alternating boundary conditions diminishes and the displacements predicted by numerical calculations converge to the analytical solutions.",
    "citation_count": 25,
    "year": "2010/09",
    "authors": [
        {
            "name": "LaForce, Tara",
            "country": "UK"
        },
        {
            "name": "Jessen, Kristian",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}