{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9690-8",
    "title": "Assisted history matching for the inversion of fractures based on discrete fracture-matrix model with different combinations of inversion parameters",
    "abstract": "Accurate prediction of fracture distribution in fractured reservoirs is important in the development process. Considering that assisted history matching technology is an effective method for the inversion of reservoir parameters, the technology can also be applied for the inversion of fractures. Because applying assisted history matching technology for the inversion of fractures has an inherent defect of multiplicity of solution, it is therefore necessary to alleviate the multiplicity for the success of inversion. Although there are many factors affecting the multiplicity, the paper focuses on the study of the inversion results of different combinations of inversion parameters which are all representative parameters of fractures and determine the distribution of fractures. Firstly, we simulate the flow behavior in fractured media based on the discrete fracture matrix (DFM) module of Matlab Reservoir Simulation Toolbox (MRST) to explicitly describe the effect of fractures on flow behavior. Secondly, history matching objective function is established based on Bayesian theory and different kinds of representative parameters of fractures are chosen as inversion parameters. Thirdly, simultaneous perturbation stochastic approximation (SPSA) algorithm is adopted to minimize the objective function to achieve the inversion of fractures corresponding to different inversion parameters. Finally, theoretical cases verify that the inversion method is effective for the accurate prediction of fracture distribution and proper inversion parameters are crucial to the success of fracture inversion.",
    "citation_count": 32,
    "year": "2017/12",
    "authors": [
        {
            "name": "Zhang, Kai",
            "country": "China"
        },
        {
            "name": "Zhang, Xiaoming",
            "country": "China"
        },
        {
            "name": "Zhang, Liming",
            "country": "China"
        },
        {
            "name": "Li, Lixin",
            "country": "China"
        },
        {
            "name": "Sun, Hai",
            "country": "China"
        },
        {
            "name": "Huang, Zhaoqin",
            "country": "China"
        },
        {
            "name": "Yao, Jun",
            "country": "China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}