{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10313-x",
    "title": "Auto-weighted Bayesian Physics-Informed Neural Networks and robust estimations for multitask inverse problems in pore-scale imaging of dissolution",
    "abstract": "In this article, we present a novel data assimilation strategy in pore-scale imaging and demonstrate that this makes it possible to robustly address reactive inverse problems incorporating Uncertainty Quantification (UQ). Pore-scale modeling of reactive flow offers a valuable opportunity to investigate the evolution of macro-scale properties subject to dynamic processes in the context of Carbon Capture and Storage (CCS). Yet, they suffer from imaging limitations arising from the associated X-ray microtomography (X-ray $$\\mu $$ CT) process, which induces discrepancies in the properties estimates. Assessment of the kinetic parameters also raises challenges, as reactive coefficients are critical parameters that can cover a wide range of values. We account for these two issues and ensure reliable calibration of pore-scale modeling, based on dynamical $$\\mu $$ CT images, by integrating uncertainty quantification in the workflow. The present method is based on a multitasking formulation of reactive inverse problems combining data-driven and physics-informed techniques in calcite dissolution. This allows quantifying morphological uncertainties on the porosity field and estimating reactive parameter ranges through prescribed PDE models, with a latent concentration field, and dynamical $$\\mu $$ CT observations. The data assimilation strategy relies on sequential reinforcement incorporating successively additional PDE constraints and suitable formulation of the heterogeneous diffusion differential operator leading to enhanced computational efficiency. We provide a robust and unbiased uncertainty quantification by straightforward adaptive weighting of Bayesian Physics-Informed Neural Networks (BPINNs), ensuring reliable micro-porosity changes during geochemical transformations. We demonstrate successful Bayesian Inference in 1D+Time calcite dissolution based on synthetic $$\\mu $$ CT images with meaningful posterior distribution on the reactive parameters and dimensionless numbers. We eventually apply this framework to a more realistic 2D+Time data assimilation problem involving heterogeneous porosity levels and synthetic $$\\mu $$ CT dynamical observations.",
    "citation_count": 82,
    "year": "2024/12",
    "authors": [
        {
            "name": "Perez, Sarah",
            "country": "France"
        },
        {
            "name": "Poncet, Philippe",
            "country": "UK"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}