{
    "url": "https://link.springer.com/article/10.1007/s10596-019-09887-8",
    "title": "Black hole particle swarm optimization for well placement optimization",
    "abstract": "Well placement optimization is a very challenging task in field development planning as it involves a large number of optimization variables resulting from the multidimensional space of well parameters. Manual assessment of the permutation of these variables yields an excessively large number of scenarios and, hence, is practically infeasible in the process of field development planning. In this paper, we introduce a new hybrid evolutionary optimization method; the black hole particle swarm optimization (BHPSO) for simultaneously optimizing well count, location, type, and trajectory. For each particle in a BHPSO “iteration”, the location of the first producer is identified using particle swarm optimization (PSO) based on a net hydrocarbon thickness (NHCT) map. The remaining wells (producers and injectors), whose number is also potentially decided by PSO as an optimization parameter, are then automatically and optimally placed using the black hole (BH) operator where wells are automatically and optimally placed using primarily a NHCT map. The NHCT map is updated after every well placement by eliminating a disk (black hole) of a radius defined by the well spacing. Different radii are used to accommodate producers and injectors. For horizontal wells, once the heel/toe of the well is placed, the method identifies the azimuth corresponding to a maximum cumulative NHCT. The computational complexity of the proposed method is, thus, independent of the number of optimized wells. This drastically reduces the number of optimization parameters and, hence, the computational requirement to converge to an optimal solution. The proposed method is systematically and thoroughly validated using the publicly available synthetic field (Olympus) that is inspired by a virgin oil field in the North Sea and developed for the purpose of a benchmark study for field development optimization. Results show a systematically superior performance of the proposed BHPSO algorithm compared to the standard PSO.",
    "citation_count": 59,
    "year": "2020/12",
    "authors": [
        {
            "name": "Harb, Ahmad",
            "country": "Lebanon"
        },
        {
            "name": "Kassem, Hussein",
            "country": "Lebanon"
        },
        {
            "name": "Ghorayeb, Kassem",
            "country": "Lebanon"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}