{
    "url": "https://link.springer.com/article/10.1007/s10596-019-09882-z",
    "title": "Combining ensemble Kalman filter and multiresolution analysis for efficient assimilation into adaptive mesh models",
    "abstract": "A new approach is developed for data assimilation into adaptive mesh models with the ensemble Kalman filter (EnKF). The EnKF is combined with a wavelet-based multiresolution analysis (MRA) scheme to enable robust and efficient assimilation in the context of reduced-complexity adaptive spatial discretization. The wavelet representation of the solution enables the use of different meshes that are individually adapted to the corresponding members of the EnKF ensemble. The analysis step of the EnKF is then performed by involving coarsening, refinement, and projection operations on its ensemble members. Depending on the choice of these operations, five variants of the MRA-EnKF are introduced, and tested on the one-dimensional Burgers equation with periodic boundary condition. The numerical results suggest that, given an appropriate tolerance value for the coarsening operation, four out of the five proposed schemes significantly reduce the computational complexity of the assimilation system, with marginal accuracy loss compared to the reference, full resolution, and EnKF solution. Overall, the proposed framework offers the possibility of capitalizing on the advantages of adaptive mesh techniques, and the flexibility of choosing suitable context-oriented criteria for efficient data assimilation.",
    "citation_count": 51,
    "year": "2019/12",
    "authors": [
        {
            "name": "Siripatana, A.",
            "country": "Saudi Arabia"
        },
        {
            "name": "Giraldi, L.",
            "country": "Saudi Arabia"
        },
        {
            "name": "Le Maître, O. P.",
            "country": "France"
        },
        {
            "name": "Knio, O. M.",
            "country": "Saudi Arabia"
        },
        {
            "name": "Hoteit, I.",
            "country": "Saudi Arabia"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}