{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9668-6",
    "title": "Combining the modified discrete element method with the virtual element method for fracturing of porous media",
    "abstract": "Simulation of fracturing processes in porous rocks can be divided into two main branches: (i) modeling the rock as a continuum enhanced with special features to account for fractures or (ii) modeling the rock by a discrete (or discontinuous) approach that describes the material directly as a collection of separate blocks or particles, e.g., as in the discrete element method (DEM). In the modified discrete element (MDEM) method, the effective forces between virtual particles are modified so that they reproduce the discretization of a first-order finite element method (FEM) for linear elasticity. This provides an expression of the virtual forces in terms of general Hook’s macro-parameters. Previously, MDEM has been formulated through an analogy with linear elements for FEM. We show the connection between MDEM and the virtual element method (VEM), which is a generalization of FEM to polyhedral grids. Unlike standard FEM, which computes strain-states in a reference space, MDEM and VEM compute stress-states directly in real space. This connection leads us to a new derivation of the MDEM method. Moreover, it enables a direct coupling between (M)DEM and domains modeled by a grid made of polyhedral cells. Thus, this approach makes it possible to combine fine-scale (M)DEM behavior near the fracturing region with linear elasticity on complex reservoir grids in the far-field region without regridding. To demonstrate the simulation of hydraulic fracturing, the coupled (M)DEM-VEM method is implemented using the Matlab Reservoir Simulation Toolbox (MRST) and linked to an industry-standard reservoir simulator. Similar approaches have been presented previously using standard FEM, but due to the similarities in the approaches of VEM and MDEM, our work provides a more uniform approach and extends these previous works to general polyhedral grids for the non-fracturing domain.",
    "citation_count": 43,
    "year": "2017/12",
    "authors": [
        {
            "name": "Nilsen, Halvor Møll",
            "country": "Norway"
        },
        {
            "name": "Larsen, Idar",
            "country": "Norway"
        },
        {
            "name": "Raynaud, Xavier",
            "country": "Norway"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}