{
    "url": "https://link.springer.com/article/10.1007/s10596-007-9056-8",
    "title": "Convergence of a symmetric MPFA method on quadrilateral grids",
    "abstract": "This paper investigates different variants of the multipoint flux approximation (MPFA) O-method in 2D, which rely on a transformation to an orthogonal reference space. This approach yields a system of equations with a symmetric matrix of coefficients. Different methods appear, depending on where the transformed permeability is evaluated. Midpoint and corner-point evaluations are considered. Relations to mixed finite element (MFE) methods with different velocity finite element spaces are further discussed. Convergence of the MPFA methods is investigated numerically. For corner-point evaluation of the reference permeability, the same convergence behavior as the O-method in the physical space is achieved when the grids are refined uniformly or when grid perturbations of order h 2 are allowed. For h 2-perturbed grids, the convergence of the normal velocities is slower for the midpoint evaluation than for the corner-point evaluation. However, for rough grids, i.e., grids with perturbations of order h, contrary to the physical space method, convergence cannot be claimed for any of the investigated reference space methods. The relations to the MFE methods are used to explain the loss of convergence.",
    "citation_count": 33,
    "year": "2007/12",
    "authors": [
        {
            "name": "Aavatsmark, I.",
            "country": "Norway"
        },
        {
            "name": "Eigestad, G. T.",
            "country": "Norway"
        },
        {
            "name": "Klausen, R. A.",
            "country": "Norway"
        },
        {
            "name": "Wheeler, M. F.",
            "country": "Norway"
        },
        {
            "name": "Yotov, I.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}