{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10233-2",
    "title": "Deep-learning-based upscaling method for geologic models via theory-guided convolutional neural network",
    "abstract": "Large-scale or high-resolution geologic models usually comprise a huge number of grid blocks, which can be computationally demanding and time-consuming to solve with numerical simulators. Therefore, it is advantageous to upscale geologic models (e.g., hydraulic conductivity) from fine-scale (high-resolution grids) to coarse-scale systems. Numerical upscaling methods have been proven to be effective and robust for coarsening geologic models, but their efficiency remains to be improved. In this work, a deep-learning-based method is proposed to upscale the fine-scale geologic models, which can assist to improve upscaling efficiency significantly. In the deep learning method, a deep convolutional neural network (CNN) is trained to approximate the relationship between the coarse block of fine-scale hydraulic conductivity fields and the corresponding hydraulic heads, which can then be utilized to replace the numerical solvers while solving the flow equations for each coarse block. In addition, physical laws (e.g., governing equations and periodic boundary conditions) can also be incorporated into the training process of the deep CNN model, which is termed the theory-guided convolutional neural network (TgCNN). With the physical information considered, dependence on the data volume of training the deep learning models can be reduced greatly. Several cases of subsurface flow, with varying two-dimensional and three-dimensional structures and isotropic and anisotropic conditions, are used to evaluate the performance of the proposed deep-learning-based upscaling method. The results show that the deep learning method can provide equivalent upscaling accuracy to the numerical method, and efficiency can be improved significantly compared to numerical upscaling.",
    "citation_count": 31,
    "year": "2023/12",
    "authors": [
        {
            "name": "Wang, Nanzhe",
            "country": "People’s Republic of China"
        },
        {
            "name": "Liao, Qinzhuo",
            "country": "People’s Republic of China"
        },
        {
            "name": "Chang, Haibin",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Dongxiao",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}