{
    "url": "https://link.springer.com/article/10.1007/s10596-009-9153-y",
    "title": "Geological modeling and simulation of CO2 injection in the Johansen formation",
    "abstract": "The Johansen formation is a candidate site for large-scale CO2 storage offshore of the south-western coast of Norway. An overview of the geology for the Johansen formation and neighboring geological formations is given, together with a discussion of issues for geological and geophysical modelling and integrated fluid flow modelling. We further describe corresponding simulation models. Major issues to consider are capacity estimation and processes that could potentially cause CO2 to leak out of the Johansen formation and into the formations above. Currently, these issues can only be investigated through numerical simulation. We consider the effect of different boundary conditions, sensitivity with respect to vertical grid refinement and permeability/transmisibility data, and the effect of residual gas saturations, since these strongly affect the CO2-plume distribution. The geological study of the Johansen formation is performed based on available seismic and well data. Fluid simulations are performed using a commercial simulator capable of modelling CO2 flow and transport by simple manipulation of input files and data. We provide details for the data and the model, with a particular focus on geology and geometry for the Johansen formation. The data set is made available for download online.",
    "citation_count": 26,
    "year": "2009/12",
    "authors": [
        {
            "name": "Eigestad, Geir Terje",
            "country": "Norway"
        },
        {
            "name": "Dahle, Helge K.",
            "country": "Norway"
        },
        {
            "name": "Hellevang, Bjarte",
            "country": "Norway"
        },
        {
            "name": "Riis, Fridtjof",
            "country": "Norway"
        },
        {
            "name": "Johansen, Wenche Tjelta",
            "country": "Norway"
        },
        {
            "name": "Øian, Erlend",
            "country": "Norway"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}