{
    "url": "https://link.springer.com/article/10.1007/s10596-016-9604-1",
    "title": "History matching of multi-facies channelized reservoirs using ES-MDA with common basis DCT",
    "abstract": "History matching a channelized reservoir with multiple facies has always posed a great challenge to researchers. In this paper, we present a workflow combining the ensemble smoother with multiple data assimilation (ES-MDA) method with a parameterization algorithm referred to as the common basis discrete cosine transform (DCT) and a post-processing technique in order to integrate static and dynamic data into multi-facies channelized reservoir models. The parameterization algorithm is developed to capture the critical features and describe the geological similarity between different realizations in the prior ensemble by transforming the discrete facies indicators into continuous variables. And the ES-MDA method is employed to update the continuous variables by assimilating the static and dynamic data. Finally, a post-processing technique based on a regularization framework is used to improve the spatial continuity of facies and estimate the non-Gaussian distributed reservoir properties. We apply this automatic history matching workflow to two synthetic problems that represent complex three-facies (shale, levee, and sand) channelized reservoirs. One is a 2D three-facies reservoir with a relatively high number of channels and the other is a 3D three-facies five-layer reservoir containing two geological zones with different channel patterns. The computational results show that the proposed workflow can greatly reduce the uncertainty in the reservoir description through the integration of production data. And the posterior realizations can well preserve the key geological features of the prior models, with a good history data match and predictive capacity. In addition, we also illustrate the superiority of the common basis DCT over the traditional DCT algorithm.",
    "citation_count": 40,
    "year": "2017/12",
    "authors": [
        {
            "name": "Zhao, Yu",
            "country": "USA"
        },
        {
            "name": "Forouzanfar, Fahim",
            "country": "USA"
        },
        {
            "name": "Reynolds, Albert C.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}