{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10253-y",
    "title": "Impact of artificial topological changes on flow and transport through fractured media due to mesh resolution",
    "abstract": "We performed a set of numerical simulations to characterize the interplay of fracture network topology, upscaling, and mesh refinement on flow and transport properties in fractured porous media. We generated a set of generic three-dimensional discrete fracture networks at various densities, where the radii of the fractures were sampled from a truncated power-law distribution, and whose parameters were loosely based on field site characterizations. We also considered five network densities, which were defined using a dimensionless version of density based on percolation theory. Once the networks were generated, we upscaled them into a single continuum model using the upscaled discrete fracture matrix model presented by Sweeney et al. (2019). We considered steady, isothermal pressure-driven flow through each domain and then simulated conservative, decaying, and adsorbing tracers using a pulse injection into the domain. For each simulation, we calculated the effective permeability and solute breakthrough curves as quantities of interest to compare between network realizations. We found that selecting a mesh resolution such that the global topology of the upscaled mesh matches the fracture network is essential. If the upscaled mesh has a connected pathway of fracture (higher permeability) cells but the fracture network does not, then the estimates for effective permeability and solute breakthrough will be incorrect. False connections cannot be eliminated entirely, but they can be managed by choosing appropriate mesh resolution and refinement for a given network. Adopting octree meshing to obtain sufficient levels of refinement leads to fewer computational cells (up to a 90% reduction in overall cell count) when compared to using a uniform resolution grid and can result in a more accurate continuum representation of the true fracture network.",
    "citation_count": 58,
    "year": "2023/12",
    "authors": [
        {
            "name": "Pachalieva, Aleksandra A.",
            "country": "USA"
        },
        {
            "name": "Sweeney, Matthew R.",
            "country": "USA"
        },
        {
            "name": "Viswanathan, Hari",
            "country": "USA"
        },
        {
            "name": "Stein, Emily",
            "country": "USA"
        },
        {
            "name": "Leone, Rosie",
            "country": "USA"
        },
        {
            "name": "Hyman, Jeffrey D.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}