{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10321-x",
    "title": "Incorporating spatial variability in surface runoff modeling with new DEM-based distributed approaches",
    "abstract": "This study introduces two novel DEM-based distributed rainfall-runoff models derived from the existing Hidropixel model: HidropixelTUH+ and HidropixelDLR. These models account for spatial variations in direct runoff generation, translation, and storage within a watershed, considering spatial variability in rainfall and basin characteristics. In HidropixelTUH+, a Triangular Unit Hydrograph (TUH) is determined for each Digital Elevation Model (DEM) pixel and lagged to the watershed outlet based on the travel time from the pixel to the outlet. In HidropixelDLR, a hydrograph is estimated for each pixel based on the travel time, which takes translation effects into account. To represent the storage effects, this hydrograph is attenuated by a linear reservoir at each pixel. Both approaches were applied to the Upper Medway catchment (250 km2) in southeastern England, using rainfall data from a rain gauge network. The outcomes revealed that the proposed approaches provided a reasonably accurate prediction of the hydrographs and exhibited notably superior performance compared to the original version of Hidropixel, which has limited capabilities in capturing translation effects. HidropixelTUH+ and HidropixelDLR predicted peak flows with an average absolute error of 11% and 10%, respectively. The HidropixelDLR achieved a more accurate time-to-peak estimation, with an average absolute error of 1&nbsp;h, compared to the 1.5-h error from HidropixelTUH+. Additionally, the HidropixelDLR predicted the full direct runoff hydrograph more accurately, achieving an average Nash–Sutcliffe coefficient (NSE) of 0.89, while the HidropixelTUH+ had an NSE of approximately 0.84.",
    "citation_count": 56,
    "year": "2024/12",
    "authors": [
        {
            "name": "Lima, Dário Macedo",
            "country": "Brazil"
        },
        {
            "name": "da Paz, Adriano Rolim",
            "country": "Brazil"
        },
        {
            "name": "Xuan, Yunqing",
            "country": "Brazil"
        },
        {
            "name": "Piccilli, Daniel Gustavo Allasia",
            "country": "UK"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}