{
    "url": "https://link.springer.com/article/10.1007/s10596-012-9303-5",
    "title": "Joint optimization of oil well placement and controls",
    "abstract": "Well placement and control optimization in oil field development are commonly performed in a sequential manner. In this work, we propose a joint approach that embeds well control optimization within the search for optimum well placement configurations. We solve for well placement using derivative-free methods based on pattern search. Control optimization is solved by sequential quadratic programming using gradients efficiently computed through adjoints. Joint optimization yields a significant increase, of up to 20% in net present value, when compared to reasonable sequential approaches. The joint approach does, however, require about an order of magnitude increase in the number of objective function evaluations compared to sequential procedures. This increase is somewhat mitigated by the parallel implementation of some of the pattern-search algorithms used in this work. Two pattern-search algorithms using eight and 20 computing cores yield speedup factors of 4.1 and 6.4, respectively. A third pattern-search procedure based on a serial evaluation of the objective function is less efficient in terms of clock time, but the optimized cost function value obtained with this scheme is marginally better.",
    "citation_count": 41,
    "year": "2012/09",
    "authors": [
        {
            "name": "Bellout, Mathias C.",
            "country": "Norway"
        },
        {
            "name": "Echeverría Ciaurri, David",
            "country": "USA"
        },
        {
            "name": "Durlofsky, Louis J.",
            "country": "USA"
        },
        {
            "name": "Foss, Bjarne",
            "country": "Norway"
        },
        {
            "name": "Kleppe, Jon",
            "country": "Norway"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}