{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10247-w",
    "title": "Meshing strategies for 3d geo-electromagnetic modeling in the presence of metallic infrastructure",
    "abstract": "In 3D geo-electromagnetic modeling, an adequate discretisation of the modeling domain is crucial to obtain accurate forward responses and reliable inversion results while reducing the computational cost. This paper investigates the mesh design for subsurface models, including steel-cased wells, which is relevant for many exploration settings but still remains a numerically challenging task. Applying a goal-oriented mesh refinement technique and subsequent calculations with the high-order edge finite element method, simulations of 3D controlled-source electromagnetic models in the presence of metallic infrastructure are performed. Two test models are considered, each needing a distinct version of approximation methods to incorporate the conductive steel casings of the included wells. The influence of mesh quality, goal-oriented meshing, and high-order approximations on problem sizes, computational cost, and accuracy of electromagnetic responses is investigated. The main insights of our work are: (a) the applied numerical schemes can mitigate the computational burden of geo-electromagnetic modeling in the presence of steel artifacts; (b) investigating the processes driving the meshing of models with embedded metallic infrastructures can lead to adequate strategies to deal with the inversion of such electromagnetic data sets. Based on the modeling results and analyses conducted, general recommendations for modeling strategies are proposed when performing simulations for challenging steel infrastructure scenarios.",
    "citation_count": 74,
    "year": "2023/12",
    "authors": [
        {
            "name": "Castillo-Reyes, Octavio",
            "country": "Spain"
        },
        {
            "name": "Rulff, Paula",
            "country": "Spain"
        },
        {
            "name": "Schankee Um, Evan",
            "country": "Sweden"
        },
        {
            "name": "Amor-Martin, Adrian",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}