{
    "url": "https://link.springer.com/article/10.1007/s10596-009-9176-4",
    "title": "Mixed unsplit-field perfectly matched layers for transient simulations of scalar waves in heterogeneous domains",
    "abstract": "We discuss a new formulation for transient scalar wave simulations in heterogeneous semi-infinite domains. To deal with the semi-infinite extent of the physical domains, we introduce truncation boundaries and adopt perfectly matched layers (PMLs) as the boundary wave absorbers. Within this framework, we develop a new mixed displacement-stress (or stress memory) finite element formulation based on unsplit-field PMLs. We use, as typically done, complex-coordinate stretching transformations in the frequency domain, and recover the governing partial differential equations in the time-domain through the inverse Fourier transform. Upon spatial discretization, the resulting equations lead to a mixed semi-discrete form, where both displacements and stresses (or stress histories/memories) are treated as independent unknowns. We propose approximant pairs, which, numerically, are shown to be stable. The resulting mixed finite element scheme is relatively simple and straightforward to implement, when compared against split-field PML techniques. It also bypasses the need for complicated time integration schemes that arise when recent displacement-based formulations are used. We report numerical results for 1D and 2D scalar wave propagation in semi-infinite domains truncated by PMLs. We also conduct parametric studies and report on the effect the various PML parameter choices have on the simulation error.",
    "citation_count": 64,
    "year": "2010/09",
    "authors": [
        {
            "name": "Kang, Jun Won",
            "country": "USA"
        },
        {
            "name": "Kallivokas, Loukas F.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}