{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10312-y",
    "title": "Modeling alterations in relative permeability curves due to salinity using artificial neural networks",
    "abstract": "We propose data-driven models based on artificial neural networks (ANN) to predict changes in water-oil relative permeability curves given a salinity reduction in the injection water. The ANN consisted of a multilayer feedforward structure with backpropagation. For validation, a database from a semi-empirical correlation was created, and models with added noise were used to analyze the influence of the data dispersion. Then, a survey of experimental relative permeability curves was performed to produce a real database for sandstone and carbonate rocks, utilized in the training of the final models, with hyperparameter optimization and cross-validation. The initial model was able to consistently reproduce the original correlation, with a mean squared error (MSE) on the order of $$10^{-6}$$ . In the noise-trained model, the error measured was lower than the analytical error expected from random dispersion. In models trained with real data, the adopted strategy led to a final training MSE on the order of $$10^{-3}$$ , with better performance in networks with two hidden layers. The obtained models are useful in modeling relative permeabilities for low-salinity and engineered water injection projects. Training can be continuously updated with new data, and the methodology can be applied to other properties or even other multivariate regression problems.",
    "citation_count": 89,
    "year": "2024/12",
    "authors": [
        {
            "name": "Czarnobay, Vinicius",
            "country": "Brazil"
        },
        {
            "name": "Lamas, Luis Fernando",
            "country": "Brazil"
        },
        {
            "name": "Sebrão, Damianni",
            "country": "Brazil"
        },
        {
            "name": "Hegele, Luiz Adolfo",
            "country": "Brazil"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}