{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9680-x",
    "title": "Modeling of shear failure in fractured reservoirs with a porous matrix",
    "abstract": "A finite volume-based numerical modeling framework using a hierarchical fracture representation (HFR) has been developed to compute flow-induced shear failure. To accurately capture the mechanics near fracture manifolds, discontinuous basis functions are employed which ensure continuity of the displacement gradient across fractures. With these special basis functions, traction and compressive forces on the fracture segment can be calculated without any additional constraints, which is extremely useful for estimating the irreversible displacement along the fracture (slip) based on a constitutive friction law. The method is further extended to include slip-dependent hydraulic aperture change and grid convergent results are obtained. Further, the change in hydraulic aperture is modeled using an asymptotic representation which respects the experimentally observed behavior of pore volume dilation due to shear slip. The model allows the initial rapid increase in hydraulic aperture due to shear slip and asymptotically approaches a finite value after repeated shearing of a fracture segment. This aperture increase is the only feedback for mechanics into the fluid flow for a linear elastic mechanics problem. The same model is also extended to include poroelastic relations between flow and mechanics solver. The grid convergence result in the case of poroelastic flow-mechanics coupling for flow-induced shear failure is also obtained. This proves the robustness of the numerical and analytical modeling of fracture and friction in the extended finite volume method (XFVM) set-up. Finally, a grid convergent result for seismic moment magnitude for single fracture and fracture network with random initial hydraulic and friction properties is also obtained. The b-value, which represents the slope of seismic moment occurrence frequency decay vs seismic moment magnitude, which is approximately constant in a semi-logarithmic plot, is estimated. The numerical method leads to converged b-values for both single fracture and fracture network simulations, as grid and time resolutions are increased. For the resulting linear system, a sequential approach is used, that is, first, the flow and then the mechanics problems are solved. The new modeling framework is very useful to predict seismicity, permeability, and flow evolution in geological reservoirs. This is demonstrated with numerical simulations of enhancing a geothermal system.",
    "citation_count": 20,
    "year": "2017/12",
    "authors": [
        {
            "name": "Deb, Rajdeep",
            "country": "Switzerland"
        },
        {
            "name": "Jenny, Patrick",
            "country": "Switzerland"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}