{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9660-1",
    "title": "Nonlinear solver for three-phase transport problems based on approximate trust regions",
    "abstract": "Implicit transport solvers used in reservoir simulation can take longer time steps than explicit solvers, but for long time steps, the commonly used Newton-Raphson’s method will often fail to converge. The convergence issues may manifest themselves as oscillating residuals even though the implicit discretization itself is stable. This behavior occurs because the fractional flow-type flux functions often change between convex and concave during long time steps, resulting in multiple contraction regions for the Newton-Raphson solver. The common strategy to overcome this is to set limits on the saturation changes during the nonlinear iteration, but such a limit has to be determined on a case by case basis, excess iterations may be required, and practical convergence is not guaranteed for a given problem. Previous work on this problem by multiple authors has resulted in solvers based on trust regions, where unconditional convergence can be obtained for incompressible two-phase flow provided a priori analytical knowledge of the flux function exists. The goal of our work is to extend this methodology to a solver where inflection points demarking the different contraction regions do not need to be explicitly known. Instead, these values are estimated during the solution process, giving improved convergence by a local computation for each interface in the simulation model. By systematically reducing updates over regions known to produce convergence issues, it is possible to greatly reduce the computational expense, making the same formulation suitable for an arbitrary number of components. We present a series of numerical results, including arbitrary time-step lengths for two and three-phase gravity segregation, as well as three-dimensional gas and water injection problems with wells and a mixture of both viscous and gravity-dominated flow regimes. The test cases are a systematic validation on a wide variety of both analytical and tabulated relative permeability curves.",
    "citation_count": 40,
    "year": "2017/12",
    "authors": [
        {
            "name": "Møyner, Olav",
            "country": "Norway"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}