{
    "url": "https://link.springer.com/article/10.1007/s10596-022-10172-4",
    "title": "Numerical simulation of crack propagation and coalescence in rock materials by the peridynamic method based on strain energy density theory",
    "abstract": "The strain energy density softening criterion is introduced to the peridynamic theory to reflect the failure characteristics of rock-like materials. At the same time, the critical damage condition, obeying Weibull distribution, is utilized to describe the heterogeneity of rock—making up for the deficiency that the peridynamic method cannot embody the strain-softening features and heterogeneity of rock when simulating crack propagation of rock materials. The crack extension process of rock, with a single crack under uniaxial compression, was simulated using the improved method, the results of which were then compared to the results of previous laboratory tests to verify the effectiveness of the proposed theory. Furthermore, the crack propagation patterns and failure mechanism of rock materials which contain single crack and double cracks with different prefabrication angles under uniaxial compression condition were explored in this study. The results showed that the propagation of a prefabricated single crack specimen was divided into wing crack, shear crack, and anti-wing crack, and the order of appearance was influenced by the inclination angle. The penetration modes of prefabricated double cracks were divided into wing mode (W-mode), shear mode (S-mode), and mixed mode (M-mode), which were primarily affected by the inclination angle and relative angle.",
    "citation_count": 48,
    "year": "2022/12",
    "authors": [
        {
            "name": "Ma, Pengfei",
            "country": "China"
        },
        {
            "name": "Li, Shuchen",
            "country": "China"
        },
        {
            "name": "Wang, Xiuwei",
            "country": "China"
        },
        {
            "name": "Yuan, Chao",
            "country": "China"
        },
        {
            "name": "Li, Jinglong",
            "country": "China"
        },
        {
            "name": "Zhang, Fuming",
            "country": "China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}