{
    "url": "https://link.springer.com/article/10.1007/s10596-012-9295-1",
    "title": "Properties of a diffuse interface model based on a porous medium theory for solid–liquid dissolution problems",
    "abstract": "In this paper, a local non-equilibrium diffuse interface model is introduced for describing solid–liquid dissolution problems. The model is developed based on the analysis of Golfier et al. (J Fluid Mech 457:213–254, 2002) upon the dissolution of a porous domain, with the additional requirement that density variations with the mass fraction are taken into account. The control equations are generated by the upscaling of the balance equations for a solid–liquid dissolution using a volume averaging theory. This results into a diffuse interface model (DIM) that does not require an explicit treatment of the dissolving interface, e.g., the use of arbitrary Lagrangian–Eulerian (ALE) methods, for instance. Test cases were performed to study the features and influences of the effective coefficients inside the DIM. In particular, an optimum expression for the solid–liquid exchange coefficient is obtained from a comparison with the referenced solution by ALE simulations. Finally, a Ra–Pe diagram illustrates the interaction of natural convection and forced convection in the dissolution problem.",
    "citation_count": 53,
    "year": "2012/09",
    "authors": [
        {
            "name": "Luo, Haishan",
            "country": "France"
        },
        {
            "name": "Quintard, Michel",
            "country": "France"
        },
        {
            "name": "Debenest, Gérald",
            "country": "France"
        },
        {
            "name": "Laouafa, Farid",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}