{
    "url": "https://link.springer.com/article/10.1007/s10596-021-10086-7",
    "title": "Reconstruction of fluvial reservoirs using multiple-stage concurrent generative adversarial networks",
    "abstract": "With the continuous depletion of oil and natural gas resources, the development of fluvial reservoirs has gradually become a key research direction, which makes the reconstruction of fluvial reservoirs a challenging problem due to the irregular shapes and complicated trends of fluvial facies. The traditional numerical simulation method obtains reconstruction results through the probability in training images (TIs), while the reconstruction time is long, and the simulation process mainly depends on CPU. The development of deep learning has provided possible technical support for the simulation and reconstruction of fluvial reservoirs thanks to its strong ability of learning and extracting characteristics from TIs and the use of GPU. As a common deep learning method, generative adversarial networks (GANs) achieve the purpose of recognizing the fake and real data through the mutual game and confrontation between the generator and discriminator. Based on GANs, a multiple-stage concurrent GAN (MSCGAN) model is proposed for the reconstruction of fluvial reservoirs in this paper. A TI of fluvial reservoirs is downsampled to different stages to obtain different scales of TIs and multiple-stage training is conducted from the low-scale image to the high-scale one, which can effectively capture the complex structural characteristics inside the TI of fluvial reservoirs and greatly shorten the training time. Experimental comparison with some typical methods proves that MSCGAN can reconstruct fluvial reservoirs faster and are competitive in reconstruction quality.",
    "citation_count": 44,
    "year": "2021/12",
    "authors": [
        {
            "name": "Zhang, Ting",
            "country": "China"
        },
        {
            "name": "Ji, Xin",
            "country": "China"
        },
        {
            "name": "Zhang, Anqin",
            "country": "China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}