{
    "url": "https://link.springer.com/article/10.1007/s10596-025-10353-x",
    "title": "Three-dimensional numerical modeling of natural convection in underground cavities connected to the surface by a well",
    "abstract": "We present two- and three-dimensional numerical simulations of the natural convection flow within an artificial underground cavity. We consider a realistic geometry reconstructed from measurements (3D point cloud obtained with a photogrammetric method) of the Barcq cavity existing in Normandy region, France. The numerical model solves the Navier-Stokes equations coupled with the unsteady heat equation using a finite-element method for the space discretization. Time integration is based on a semi-implicit method and the Newton method to solve the resulting non-linear equation. To implement the method, we use the free software FreeFem++ offering efficient mesh refinement/adaptivity tools. The parallelization of the simulations relies upon the PETSc software library, to which FreeFem++ offers an easy-to-use interface. We analyze the onset of the natural convection and characterize the convective cells developing within the Barcq cavity for four Rayleigh (Ra) numbers (from $$\\varvec{10}^{\\varvec{5}}$$ to $$\\varvec{10}^{\\varvec{8}}$$ ). Dimensionless temperatures, velocities and Nusselt numbers are presented for each Ra number. We discuss how these results can be used to understand the thermal behavior of small artificial cavities. We address in particular the influence of the value of the Rayleigh number on the flow inside the well, which is essential for designing detection methods based on surface temperature observations. The FreeFem++ numerical code used for this study is distributed as supplemental material.",
    "citation_count": 47,
    "year": "2025/04",
    "authors": [
        {
            "name": "Edde, Georges",
            "country": "France"
        },
        {
            "name": "Sadaka, Georges",
            "country": "France"
        },
        {
            "name": "Antoine, Raphaël",
            "country": "France"
        },
        {
            "name": "Danaila, Ionut",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}