{
    "url": "https://link.springer.com/article/10.1007/s10596-021-10094-7",
    "title": "Well placement optimization using shuffled frog leaping algorithm",
    "abstract": "One of the most complex problems in the field of upstream oil and gas industry is to optimally determine the location of production and injection wells. To do so, a variety of tools have been employed by reservoir engineers, including simplified reservoir models, reservoir quality maps, and automatic optimization techniques. Although the use of automatic optimization algorithms has facilitated the process of solving the optimization problem, one of the existing challenges in this regard is the selection of an appropriate algorithm that can avoid local optima and provide practically feasible results. In this study, the Shuffled Frog Leaping Algorithm (SFLA) was used, to the best of our knowledge for the first time, in a well placement problem to find the optimal location of production and injection wells. Two standard benchmark reservoir models were used to test the performance of the algorithm. The results were compared to those obtained by two most used optimization algorithms in the field of well location optimization, including the Particle Swarm Optimization and Genetic Algorithm. Results revealed that the SLF algorithm achieved better results in terms of higher objective function values and better well spacing both in intermediate and late stages of the optimization compared to the other algorithms. Also, the SFLA showed the most stable and smoothest progress among the algorithms.",
    "citation_count": 41,
    "year": "2021/12",
    "authors": [
        {
            "name": "Sharifipour, Milad",
            "country": "Iran"
        },
        {
            "name": "Nakhaee, Ali",
            "country": "Iran"
        },
        {
            "name": "Yousefzadeh, Reza",
            "country": "Iran"
        },
        {
            "name": "Gohari, Mojtaba",
            "country": "Iran"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}