{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001285",
    "title": "A blockchain-based privacy-preserving auditable authentication scheme with hierarchical access control for mobile cloud computing",
    "abstract": "Blockchain-based  authentication mode , a fundamental solution to prevent unauthorized access behavior, gradually becomes a focus in future distributed  mobile cloud computing  (MCC) services. However, due to the transparent and immutable characteristics of blockchain, users’ access behaviors are facing huge security and privacy threats. Storing the  encrypted data  on chain is an effective way to address these issues, but access permission confirmation and update in the form of  ciphertext  is the main bottleneck. To this end, this paper proposes a blockchain-based unified  authentication  and hierarchical  access control scheme  for the  MCC environment , which provides both privacy protection and auditability. In the proposed scheme, users can  access multiple  MCC services with different access permissions using a single credential. To protect the privacy of both users and service providers, while still supporting auditability, the data on the public ledger is blinded using Pedersen commitments. Besides, the proposed scheme provides flexible dynamic updating in encrypted form. Theoretical analysis indicates that the proposed scheme can meet various security and privacy requirements in the MCC environment. Compared with related schemes, it has better communication efficiency. Therefore, the proposed scheme is more suitable for the actual MCC environment.",
    "citation_count": "12",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Yin Zhang",
            "country": ""
        },
        {
            "name": "Ling Xiong",
            "country": ""
        },
        {
            "name": "Fagen Li",
            "country": ""
        },
        {
            "name": "Xianhua Niu",
            "country": ""
        },
        {
            "name": "Hanzhou Wu",
            "country": ""
        }
    ],
    "keywords": []
}