{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000310",
    "title": "A comprehensive systematic review of integration of time sensitive networking and 5G communication",
    "abstract": "Many industrial real-time applications in various domains, e.g., automotive, industrial automation, industrial IoT, and industry 4.0, require ultra-low end-to-end network latency, often in the order of 10 milliseconds or less. The IEEE 802.1 time-sensitive networking (TSN) is a set of standards that supports the required low-latency wired communication with ultra-low jitter. The flexibility of such a wired connection can be increased if it is integrated with a mobile wireless network. The fifth generation of cellular networks (5G) is capable of supporting the required levels of network latency with the Ultra-Reliable Low Latency Communication (URLLC) service. To fully utilize the potential of these two technologies (TSN and 5G) in industrial applications, seamless integration of the TSN wired-based network with the 5G wireless-based network is needed. In this article, we provide a comprehensive and well-structured snapshot of the existing research on TSN-5G integration. In this regard, we present the planning, execution, and analysis results of the systematic review. We also identify the trends, technical characteristics, and potential gaps in the state of the art, thus highlighting future research directions in the integration of TSN and 5G communication technologies. We notice that 73% of the primary studies address the time synchronization in the integration of TSN and 5G technologies, introducing approaches with an accuracy starting from the levels of hundred nanoseconds to one microsecond. Majority of primary studies aim at optimizing communication latency in their approach, which is a key quality attribute in automotive and industrial automation applications today.",
    "citation_count": "0",
    "year": "2023/05/01",
    "authors": [
        {
            "name": "Zenepe Satka",
            "country": ""
        },
        {
            "name": "Mohammad Ashjaei",
            "country": ""
        },
        {
            "name": "Hossein Fotouhi",
            "country": ""
        },
        {
            "name": "Masoud Daneshtalab",
            "country": ""
        },
        {
            "name": "Mikael Sjödin",
            "country": ""
        },
        {
            "name": "Saad Mubeen",
            "country": ""
        }
    ],
    "keywords": []
}