{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000608",
    "title": "A continuous leakage-resilient CCA secure identity-based key encapsulation mechanism in the standard model",
    "abstract": "In practical scenarios, attackers can exploit leakage assaults such as fault analysis and cold boot attacks to extract sensitive data, including secret keys, from cryptographic primitives. As a result, cryptographic primitives are deemed secure under traditional ideal security models and may no longer provide the expected level of security. To meet the demand for leakage resilience in identity-based key encapsulation mechanisms (IB-KEM), we introduce a concrete structure of a leakage-resilient IB-KEM, and its resistance to chosen-ciphertext attacks (CCA) is grounded in the decisional bilinear Diffie–Hellman hypothesis. Furthermore, to enhance the practicality of our IB-KEM construction, we investigate its continuous leakage resilience. We achieve protection against ongoing leakage attacks by implementing regular updates of user keys. Our analysis and comparisons with existing works demonstrate that our proposal can effectively mitigate leakage attacks and maintain high computational efficiency while ensuring CCA security. Additionally, leveraging the enhanced scalability provided by hierarchical identities, we explore the leakage resilience of the hierarchical identity-based key encapsulation mechanism (HIB-KEM). We propose a general formation of a leakage-tolerant (hierarchical) identity-based encryption scheme based on (H)IB-KEM, further underscoring the high availability of (H)IB-KEM.",
    "citation_count": "0",
    "year": "2025/05/01",
    "authors": [
        {
            "name": "Zirui Qiao",
            "country": ""
        },
        {
            "name": "Yasi Zhu",
            "country": ""
        },
        {
            "name": "Yanwei Zhou",
            "country": ""
        },
        {
            "name": "Bo Yang",
            "country": ""
        }
    ],
    "keywords": []
}