{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762115001174",
    "title": "A Distributed PTX Virtual Machine on Hybrid CPU/GPU Clusters",
    "abstract": "Hybrid CPU/GPU cluster recently has drawn lots of attention from high performance computing because of excellent execution performance and energy efficiency. Many supercomputing sites in the newest TOP 500 and Green 500 are built by hybrid CPU/GPU clusters instead of CPU clusters. However, the programming complexity of hybrid CPU/GPU clusters is so high such that most of users usually hesitate to move toward to this new cluster computing platform. To resolve this problem, we propose a distributed PTX virtual machine called BigGPU on heterogeneous clusters in this paper. As named, this virtual machine physically is a distributed system which is aimed at parallel re-compiling and executing the PTX codes by aggregating CPUs and GPUs available in a computational cluster. With the support of this virtual machine, users can regard a hybrid CPU/GPU as a single large-scale GPU. Consequently, they can develop applications by using only CUDA without combining MPI and multithreading APIs while can simultaneously use distributed CPUs and GPUs for resolving the same problem. Moreover, they need not handle the problem of load balance among heterogeneous processors and the constraints of device memory and thread configuration existing in physical GPUs because BigGPU supports large-scale virtual device memory space and thread configuration. On the other hand, we have evaluated the execution performance of BigGPU in this paper. Our experimental results have shown that BigGPU indeed can effectively exploit the computational power of CPUs and GPUs for enhancing the execution performance of user's CUDA programs.",
    "citation_count": "8",
    "year": "2016/01/01",
    "authors": [
        {
            "name": "Tyng-Yeu Liang",
            "country": ""
        },
        {
            "name": "Hung-Fu Li",
            "country": ""
        },
        {
            "name": "Yu-Jie Lin",
            "country": ""
        },
        {
            "name": "Bi-Shing Chen",
            "country": ""
        }
    ],
    "keywords": []
}