{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118305794",
    "title": "A distributed node deployment algorithm for underwater wireless sensor networks based on virtual forces",
    "abstract": "Smart ocean needs an excellent node  deployment strategy  to ensure complete and reliable network coverage of underwater  wireless sensor networks . However, node mobility caused by ocean current results in ineffective node deployment such that network coverage cannot be guaranteed. Furthermore, a centralized method of node deployment to achieve effective ocean-monitoring is challenging because of the incapability to predict node locations. In addition, it is necessary to reduce the energy consumption by the process of node deployment because node energy is limited and the energy consumption of node mobility is high. To address these problems, this paper proposes DABVF, a distributed node deployment algorithm based on virtual forces, to increase the network coverage of underwater wireless sensor network. Prior to the design of this algorithm, the forces of nodes in a dynamic marine environment were investigated as part of the study. During the  deployment process , a mobile benefit model considering node density, node  residual energy , and node mobility effectiveness is established to improve the process of node mobility. In addition, aimed at applications in an underwater scenario where there are fault nodes with no mobile capacity, a mobile judgment mechanism for failure nodes is established to optimize the problem of low coverage caused by fault nodes. The simulation results verify that DABVF can improve network coverage, reduce node energy consumption, balance node  residual energy , and optimize node distribution. Moreover, we compare DABVF with three available node deployment algorithms based on virtual forces and demonstrate that DABVF outperforms all of them.",
    "citation_count": "85",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Chunfeng Liu",
            "country": ""
        },
        {
            "name": "Zhao Zhao",
            "country": ""
        },
        {
            "name": "Wenyu Qu",
            "country": ""
        },
        {
            "name": "Tie Qiu",
            "country": ""
        },
        {
            "name": "Arun Kumar Sangaiah",
            "country": ""
        }
    ],
    "keywords": []
}