{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000384",
    "title": "A dual-index Boolean retrieval scheme with dynamic and revocable attribute-based policies",
    "abstract": "Boolean retrieval is widely employed in information retrieval due to its versatile operator combinations. In the context of secure cloud data sharing, data owners can tailor retrieval authorizations, offering remote nodes a convenient way to access data. Nevertheless, traditional retrieval models depend on online interactions for authorization, and fixed policies restrict control over retrieval. Constrained by index structures, existing Boolean retrieval methods encounter performance bottlenecks in terms of retrieval speed and storage efficiency. In this paper, we propose a dual-index Boolean retrieval scheme,  d i b R S , that incorporates dynamic and revocable attribute-based policies. Specifically, leveraging attribute-based zero-knowledge proofs (AB-ZKP), we construct the authorization verification structure using Lagrange interpolation polynomials. By constructing a dual-index structure that integrates both inverted and forward indexes,  d i b R S  facilitates efficient Boolean retrieval. A puncturable pseudorandom function constructs the forward index, enabling selective revocation of search trapdoors through puncturing, without requiring full index regeneration. Additionally, by utilizing chameleon hash collisions,  d i b R S  allows customizable index modifications and dynamic policy updates on redactable blockchains. Throughout this process,  d i b R S  enables non-interactive authorization, significantly alleviating the communication burden on data owners. Finally, we demonstrate the adaptive security and computational feasibility of  d i b R S .",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Jingting Xue",
            "country": ""
        },
        {
            "name": "Qinfang Deng",
            "country": ""
        },
        {
            "name": "Wenzheng Zhang",
            "country": ""
        },
        {
            "name": "Kangyi Liu",
            "country": ""
        },
        {
            "name": "Xiaojun Zhang",
            "country": ""
        },
        {
            "name": "Yu Zhou",
            "country": ""
        }
    ],
    "keywords": []
}