{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000371",
    "title": "A lightweight encrypted deduplication scheme supporting backup",
    "abstract": "Data  deduplication  technology is frequently used by many  cloud service providers  to handle the  exponential growth  in data. To protect their data privacy, users frequently encrypt their data before uploading it to a  cloud storage provider . Therefore, efficient encrypted deduplication technology has been widely studied. Although cloud storage provides convenience for users, it also has the problem of high data concentration. Once an accident occurs in the  data center , the impact is enormous. Therefore, it is necessary to back up the  ciphertext  data after deduplication. In this paper, we propose an efficient  encrypted data  deduplication technology that supports backup. Our scheme uses a one-way hash chain to verify the legitimacy of a user’s identity. It updates the user’s ownership of the data using the user’s index table. In this paper, we use the XOR operation to re-encrypt data to obtain backup  ciphertext , reducing  computational complexity . In LEDB, the user can extract the key from the data label. Therefore, the user does not need to manage the key separately. In addition, LEDB supports a two-level deduplication mechanism, which can not only ensure transmission security but also reduce network  transmission bandwidth . Finally, LEDB allows the user to determine the integrity of the data before decrypting the ciphertext. Security analysis and experimental results show that our scheme is secure and efficient for  data encryption  and decryption.",
    "citation_count": "2",
    "year": "2023/05/01",
    "authors": [
        {
            "name": "Xinyan Wu",
            "country": ""
        },
        {
            "name": "Huanwei Wang",
            "country": ""
        },
        {
            "name": "Yangkai Yuan",
            "country": ""
        },
        {
            "name": "Fagen Li",
            "country": ""
        }
    ],
    "keywords": []
}