{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212500013X",
    "title": "A load-balanced acceleration method for small and irregular batch matrix multiplication on GPU",
    "abstract": "As an essential mathematical operation, GEneral Matrix Multiplication (GEMM) plays a vital role in many applications, such as high-performance computing, machine learning, etc. In practice, the performance of GEMM is limited by the dimension of matrix and the diversity of GPU hardware architectures. When dealing with batched, irregular and small matrices, the efficiency of GEMM usually performs poorly. To this end, a common approach is to segment the matrix into multiple tiles and utilize parallelism between workgroups in GPU to compute the results. However, previous works only consider tile size and inter-workgroup parallelism and ignore the issues of low computational efficiency and hardware resource utilization caused by the difference in workloads between wavefronts. To address these issues, we propose a load-balanced batch GEMM acceleration method, consisting of a multi-thread kernel design and an efficient tiling algorithm. The multi-thread kernel design can address the workload unbalance between wavefronts in different workgroups, and the efficient tiling algorithm can choose the optimal tiling scheme with the new thread-level parallelism calculation method to achieve load-balanced task allocation. Finally, various comparative experiments were conducted on two GPU platforms: AMD and NVIDIA. Experimental results indicate the proposed method outperforms previous methods.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Yu Zhang",
            "country": ""
        },
        {
            "name": "Lu Lu",
            "country": ""
        },
        {
            "name": "Zhanyu Yang",
            "country": ""
        },
        {
            "name": "Zhihong Liang",
            "country": ""
        },
        {
            "name": "Siliang Suo",
            "country": ""
        }
    ],
    "keywords": []
}