{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117305234",
    "title": "A model-based framework for software portability and verification in embedded power management systems",
    "abstract": "Run-Time Management (RTM) systems are used in embedded systems to dynamically adapt  hardware performance  to minimise energy consumption. A significant challenge is that RTM software can require laborious manual adjustment across different hardware platforms due to the diversity of architecture characteristics. Model-driven development offers the potential to simplify the management of platform diversity by shifting the focus away from hand-written platform-specific code to platform-independent models from which platform-specific implementations are automatically generated. Furthermore, the use of  formal verification  provides the means to ensure that implementations are correct-by-construction. In this paper, we present a framework for automatic generation of RTM implementations from platform-independent formal models. The methodology in designing the RTM systems uses a high-level  mathematical language , Event-B, which can describe systems at different abstraction levels. A code generation tool is used to translate platform-independent Event-B RTM models to platform-specific implementations in C. Formal verification is used to ensure correctness of the Event-B models. The portability offered by our methodology is validated by modelling a  Reinforcement Learning  (RL) based RTM for two embedded applications and generating implementations for three different platforms (ARM Cortex-A8, A7 and A15) that all achieve  energy savings  on the respective platforms.",
    "citation_count": "15",
    "year": "2018/01/01",
    "authors": [
        {
            "name": "Asieh Salehi Fathabadi",
            "country": ""
        },
        {
            "name": "Michael J. Butler",
            "country": ""
        },
        {
            "name": "Sheng Yang",
            "country": ""
        },
        {
            "name": "Luis Alfonso Maeda-Nunez",
            "country": ""
        },
        {
            "name": "James Bantock",
            "country": ""
        },
        {
            "name": "Bashir M. Al-Hashimi",
            "country": ""
        },
        {
            "name": "Geoff V. Merrett",
            "country": ""
        }
    ],
    "keywords": []
}