{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001442",
    "title": "A multi-model based microservices identification approach",
    "abstract": "Microservices  are hailed for their capabilities to tackle the challenge of breaking monolithic business systems down into small, cohesive, and loosely-coupled services. Indeed, these systems are neither easy to maintain nor to replace undermining organizations’ efforts to cope with user’s changing needs and governments’ complex regulations. Microservices constitute an  architectural style  for developing a new generation of systems as a suite of services that, although they are separate, engage in collaborative execution and communication sessions. However, microservices success depends, among many other things, on the existence of an approach that would automatically identify the necessary microservices according to organizations’ requirements. In this paper, we present such an approach and demonstrate its technical doability in the context of a  case study , Bicing, for renting bikes. Some  salient features  of this approach are business processes as input for the identification needs, three models known as control, data, and semantic to capture dependencies between these processes’ activities, and, finally, a collaborative  clustering technique  that recommends potential microservices. Conducted experiments in the context of Bicing clearly indicate that our approach outperforms similar ones for microservices identification and reinforce the important role of business processes in this identification. The approach constitutes a  major milestone  towards a better architectural style for future microservices systems.",
    "citation_count": "30",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Mohamed Daoud",
            "country": ""
        },
        {
            "name": "Asmae El Mezouari",
            "country": ""
        },
        {
            "name": "Noura Faci",
            "country": ""
        },
        {
            "name": "Djamal Benslimane",
            "country": ""
        },
        {
            "name": "Zakaria Maamar",
            "country": ""
        },
        {
            "name": "Aziz El Fazziki",
            "country": ""
        }
    ],
    "keywords": []
}