{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212030206X",
    "title": "A provably secure and lightweight authentication scheme for Internet of Drones for smart city surveillance",
    "abstract": "Smart cities are made of different interconnected components that  exchange data  and facilitate the urban living for citizens.  Unmanned Aerial Vehicles , known as drones, are components used in various civilian applications, such as agriculture, package delivery, and surveillance. To enhance drone’s flying safety and  quality of service , a promising idea is to construct the Internet-of-Drones, where the drones are employed to collect the information, and citizens communicate with the drones of a particular flying zone via their mobile devices to obtain the data in real-time. However, due to the high sensitivity of the information, and the openness of communication media, privacy and security issues should be addressed. Specifically, an efficient and secure  authentication scheme  is needed to enable users and drones to authenticate each other and share a session key. Due to the drone’s limited resources and energy, the authentication scheme should be efficient regarding the computation overhead while providing high security. In this article, we devise a secure authentication scheme based on  elliptic curve  for drones to secure smart city surveillance. We demonstrate that our scheme is  provably secure  in the  random oracle model , supporting the security requirements and resisting known attacks while incurring low computation and communication costs.",
    "citation_count": "99",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Mahdi Nikooghadam",
            "country": ""
        },
        {
            "name": "Haleh Amintoosi",
            "country": ""
        },
        {
            "name": "SK Hafizul Islam",
            "country": ""
        },
        {
            "name": "Mostafa Farhadi Moghadam",
            "country": ""
        }
    ],
    "keywords": []
}