{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118302455",
    "title": "A survey on modeling and model-driven engineering practices in the embedded software industry",
    "abstract": "Software-intensive embedded systems have become an essential aspect of our lives. To cope with its growing complexity, modeling and model-driven engineering (MDE) are widely used for analysis, design, implementation, and testing of these systems. Since a large variety of software modeling practices is used in the domain of  embedded software , it is important to understand and characterize the-state-of-the-practices and also the benefits, challenges and consequences of using software modeling approaches in this domain. The goal of this study is to investigate those practices in the embedded  software engineering  projects by identifying to what degree, why and how software modeling and MDE are used. To achieve this objective, we designed and conducted an online survey. Opinions of 627 practicing embedded software engineers from 27 different countries are included in the survey. The survey results reveal important and interesting findings about the state of software modeling and MDE practices in the worldwide embedded software industry. Among the results: (1) Different modeling approaches (from informal sketches to formalized models) are widely used in the embedded software industry with different needs and all of the usages could be effective depending on the various modeling characteristics; (2) The majority of participants use  UML ; and the second most frequently selected response is “Sketch/No  formal modeling  language”, which shows the wide-spread informal usage of modeling; (3) In model-driven approaches, it is not so important to have a graphical syntax to represent the model (as in UML) and depending on the type of target embedded industrial sector, modeling stakeholders prefer models, which can be represented in a format that is readable by a machine (as in DSL); (4)  Sequence diagrams  and state-machines are the two most popular diagram types; (5) Top motivations for adopting MDE are: cost savings, achieving shorter development time, reusability and quality improvement. The survey results will shed light on the state of software modeling and MDE practices and provide practical benefits to embedded software professionals (e.g., practitioners, researchers and also educators).",
    "citation_count": "85",
    "year": "2018/11/01",
    "authors": [
        {
            "name": "Deniz Akdur",
            "country": ""
        },
        {
            "name": "Vahid Garousi",
            "country": ""
        },
        {
            "name": "Onur Demirörs",
            "country": ""
        }
    ],
    "keywords": []
}