{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762119305089",
    "title": "A survey on intrusion detection and prevention in wireless ad-hoc networks",
    "abstract": "Ad hoc networks  have been serving us in one way or the other, for two decades, through their vast variety of applications in majority fields. Due to their features such as hostile deployments, high level of mobility, limited resources and physical insecurity, they are in front line to attackers. First line of defense (cryptographic techniques, fire walls etc.) stops these attacks. But what would happen if the attacker break through this defense system? Second of line of defense also called  intrusion detection  system (IDS), would stop and mitigate these threats before they harm the network or its resources. Various schemes have been proposed to provide quality IDS that could mitigate the latest threats in ad hoc networks. In this review paper, we gave a detailed overview of ad hoc networks in the start. We explored ad hoc  networks security  followed by description about IDS. Next, we elaborated the taxonomy of IDS, containing types of IDS based on numerous parameters. In the trailing section, we compared wide variety of IDS schemes based on different methodology/techniques, to show their importance and performance in the field of intrusion detection. Finally, we concluded the paper with informative future research directions in the state of the art research fields that would open up ways for researchers in that area.",
    "citation_count": "78",
    "year": "2020/05/01",
    "authors": [
        {
            "name": "Khalid Khan",
            "country": ""
        },
        {
            "name": "Amjad Mehmood",
            "country": ""
        },
        {
            "name": "Shafiullah Khan",
            "country": ""
        },
        {
            "name": "Muhammad Altaf Khan",
            "country": ""
        },
        {
            "name": "Zeeshan Iqbal",
            "country": ""
        },
        {
            "name": "Wali Khan Mashwani",
            "country": ""
        }
    ],
    "keywords": []
}