{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116300467",
    "title": "A unified framework for designing high performance in-memory and hybrid memory file systems",
    "abstract": "The emerging non-volatile memory technologies provide a new choice for storing persistent data in memory. Therefore, file system structure needs re-studying and re-designing. Our goal is to design a framework that gives high-performance in-memory file accesses and allows a file whose data can be stored across memory and block device. This paper presents a novel unified framework for in-memory and hybrid memory file systems based on the concept that each file has a contiguous “File Virtual Address Space”. Within this framework, the file access for in-memory data can be efficiently handled by address translation hardware and the virtual address space of file. The file accesses for data in block devices are handled by a dedicated page fault handler for file system. A file system called Hybrid Memory File System (HMFS) is implemented based on this framework. Experimental results show that the throughput of HMFS approaches the memory bus bandwidth in best cases. Compared with in-memory file systems, HMFS reaches 5 times, 2.1 times, and 1.6 times faster than EXT4 on Ramdisk, RAMFS, and PMFS, respectively. Compared with EXT4 on SSD and EXT4 using page cache, HMFS also achieves 100 times and tens of times  performance improvement , respectively.",
    "citation_count": "13",
    "year": "2016/08/01",
    "authors": [
        {
            "name": "Xianzhang Chen",
            "country": ""
        },
        {
            "name": "Edwin H.-M. Sha",
            "country": ""
        },
        {
            "name": "Qingfeng Zhuge",
            "country": ""
        },
        {
            "name": "Weiwen Jiang",
            "country": ""
        },
        {
            "name": "Junxi Chen",
            "country": ""
        },
        {
            "name": "Jun Chen",
            "country": ""
        },
        {
            "name": "Jun Xu",
            "country": ""
        }
    ],
    "keywords": []
}