{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762113001987",
    "title": "Adaptive GTS allocation in IEEE 802.15.4 for real-time wireless sensor networks",
    "abstract": "The IEEE 802.15.4 standard is able to achieve low-power transmissions in low-rate and short-distance Wireless  Personal Area Networks  (WPANs). It supports a  Guaranteed Time Slots  (GTSs) allocation mechanism for time-critical and delay-sensitive  data transmissions . However, the inflexible First-Come-First-Served (FCFS) GTS allocation policy and passive deallocation mechanism significantly impair network efficiency. This paper proposes an Adaptive and Real-Time GTS Allocation Scheme (ART-GAS) to provide differentiated services for devices with different priorities, which guarantees data transmissions for time-sensitive and high-traffic devices. The  bandwidth utilization  in IEEE 802.15.4-based PAN is thus improved. The proposed scheme is developed based on the IEEE 802.15.4  Medium Access Control  (MAC) protocol and is fully compatible with the implementation of IEEE 802.15.4 devices. It is applicable to various real-time systems built upon  wireless sensor networks . Simulation results demonstrate that our ART-GAS algorithm significantly outperforms the existing GTS mechanism specified in IEEE 802.15.4 in terms of success probability, average delay, average waiting time, and CFP  bandwidth utilization .",
    "citation_count": "97",
    "year": "2013/11/01",
    "authors": [
        {
            "name": "Feng Xia",
            "country": ""
        },
        {
            "name": "Ruonan Hao",
            "country": ""
        },
        {
            "name": "Jie Li",
            "country": ""
        },
        {
            "name": "Naixue Xiong",
            "country": ""
        },
        {
            "name": "Laurence T. Yang",
            "country": ""
        },
        {
            "name": "Yan Zhang",
            "country": ""
        }
    ],
    "keywords": []
}