{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000516",
    "title": "An automotive case study on the limits of approximation for object detection",
    "abstract": "The accuracy of camera-based object detection (CBOD) built upon  deep learning  is often evaluated against the real objects in frames only. However, such simplistic evaluation ignores the fact that many unimportant objects are small, distant, or background, and hence, their  misdetections  have less impact than those for closer, larger, and  foreground objects  in domains such as  autonomous driving . Moreover, sporadic misdetections are irrelevant since confidence on detections is typically averaged across consecutive frames, and detection devices (e.g. cameras, LiDARs) are often redundant, thus providing  fault tolerance . This paper exploits such intrinsic fault tolerance of the CBOD process, and assesses in an automotive  case study  to what extent CBOD can tolerate  approximation  coming from multiple sources such as lower  precision arithmetic , approximate arithmetic units, and even random faults due to, for instance, low voltage operation. We show that the accuracy impact of those sources of approximation is within 1% of the baseline even when considering the three approximate domains simultaneously, and hence, multiple sources of approximation can be exploited to build highly efficient accelerators for CBOD in cars.",
    "citation_count": "2",
    "year": "2023/05/01",
    "authors": [
        {
            "name": "Martí Caro",
            "country": ""
        },
        {
            "name": "Hamid Tabani",
            "country": ""
        },
        {
            "name": "Jaume Abella",
            "country": ""
        },
        {
            "name": "Francesc Moll",
            "country": ""
        },
        {
            "name": "Enric Morancho",
            "country": ""
        },
        {
            "name": "Ramon Canal",
            "country": ""
        },
        {
            "name": "Josep Altet",
            "country": ""
        },
        {
            "name": "Antonio Calomarde",
            "country": ""
        },
        {
            "name": "Francisco J. Cazorla",
            "country": ""
        },
        {
            "name": "Antonio Rubio",
            "country": ""
        },
        {
            "name": "Pau Fontova",
            "country": ""
        },
        {
            "name": "Jordi Fornt",
            "country": ""
        }
    ],
    "keywords": []
}