{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118301061",
    "title": "An adaptive IoT platform on budgeted 3G data plans",
    "abstract": "In this paper, we design and implement an Internet-of-Things (IoT) based platform for developing cities using environmental sensing as a driving application. Since ubiquitous and free WiFi access is not available in most developing cities, IoT deployments must leverage 3G cellular connections that are metered and expensive. In order to best utilize the limited 3G data plan, we propose two adaptation strategies to drive sensing and data collection. The first technique is an  infrastructure-level  adaptation approach where we adjust sensing intervals of periodic sensors so that the data volume remains bounded within the allocated data budget. The second approach is at the  information-level  where application-specific analytics are deployed on-board devices. This use case focuses on multimedia sensors that process captured raw media data to lower volume semantic data that is communicated. We implement the two adaptation strategies on the EnviroSCALE (Environmental Sensing and Community Alert Network) platform, which is an inexpensive  Raspberry Pi  based environmental sensing system that employs air quality sensors and periodically publishes sensor data over a 3G connection with a limited data plan. We outline our deployment experience of EnviroSCALE in Dhaka city, the capital of Bangladesh, particularly in the direction of infrastructure-level adaptation. For information-level adaptation, our  testbed  experiment results demonstrate the practicality of  adaptive sensing  and triggering rich sensing analytics via user-specified criteria over budgeted 3G connections.",
    "citation_count": "19",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Mahmudur Rahman",
            "country": ""
        },
        {
            "name": "Amatur Rahman",
            "country": ""
        },
        {
            "name": "Hua-Jun Hong",
            "country": ""
        },
        {
            "name": "Li-Wen Pan",
            "country": ""
        },
        {
            "name": "Md Yusuf Sarwar Uddin",
            "country": ""
        },
        {
            "name": "Nalini Venkatasubramanian",
            "country": ""
        },
        {
            "name": "Cheng-Hsin Hsu",
            "country": ""
        }
    ],
    "keywords": []
}