{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116301953",
    "title": "An energy-efficient encryption mechanism for NVM-based main memory in mobile systems",
    "abstract": "Emerging non-volatile memory (NVM) has been considered as the most promising candidate of DRAM for future main memory design in mobile devices. NVM-based main memory exhibits attractive features, such as byte-addressability, low standby power, high density and near DRAM performance. However, the nature of non-volatility makes NVM vulnerable to be attacked by  malicious programs . Though several data  encryption techniques  have been proposed to solve this problem, they do not consider the limited resources in mobile systems. To address this issue, in this paper, we propose an energy-efficient encryption mechanism, named  MobiLock , to effectively enhance the security of NVM-based main memory in mobile systems. The basic idea is to enhance the encryption and decryption performance by utilizing cache and concurrency mechanisms, respectively. To achieve this, we first develop a cache mechanism to cache the encrypted intermediate data (i.e., PAD) whose plaintexts are updated frequently, for accelerating decryption and reducing  recomputation  of PAD. We then propose a concurrency mechanism to read the  ciphertext  in NVM and calculate the PAD simultaneously, to reduce the decryption latency. The evaluation results show that our technique can effectively reduce encryption energy consumption and decryption latency, respectively.",
    "citation_count": "13",
    "year": "2017/05/01",
    "authors": [
        {
            "name": "Duo Liu",
            "country": ""
        },
        {
            "name": "Xianlu Luo",
            "country": ""
        },
        {
            "name": "Yang Li",
            "country": ""
        },
        {
            "name": "Zili Shao",
            "country": ""
        },
        {
            "name": "Yong Guan",
            "country": ""
        }
    ],
    "keywords": []
}