{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000424",
    "title": "An HMAC-based authentication scheme for network coding with support for error correction and rogue node identification",
    "abstract": "Authentication schemes  based on homomorphic message  authentication  codes (HMACs) with or without a homomorphic cryptographic signature (HCS) have always played a vital role in network coding (NC). A newly developing trend with respect to research in this area takes authentication in NC-compatible networks beyond  error detection . Current HMAC-based authentication schemes for networks that support NC not only detect and drop corrupted packets but also identify the rogue nodes that begun the attack. However, in order to completely optimize the performance of an NC-enabled network, nodes that identify corrupted packets should also be able to correct the errors. Doing this eliminates the communication cost associated with the need for re-transmission and improves throughput. In this paper we propose what to the best of our knowledge is the first of such HMAC-based authentication schemes. Like all current state of the art HMAC-based authentication schemes, the proposed scheme is able to identify pollution attacks and the nodes that launched them. Furthermore, the proposed scheme is also able to correct the corruption. This according to our evaluation improves the throughput of the network when compared to other similar state of the art schemes that do not possess this feature.",
    "citation_count": "10",
    "year": "2021/06/01",
    "authors": [
        {
            "name": "Tandoh Lawrence",
            "country": ""
        },
        {
            "name": "Fagen Li",
            "country": ""
        },
        {
            "name": "Ikram Ali",
            "country": ""
        },
        {
            "name": "Michael Y. Kpiebaareh",
            "country": ""
        },
        {
            "name": "Charles R. Haruna",
            "country": ""
        },
        {
            "name": "Tandoh Christopher",
            "country": ""
        }
    ],
    "keywords": []
}