{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120300606",
    "title": "Attacking vision-based perception in end-to-end autonomous driving models",
    "abstract": "Recent advances in  machine learning , especially techniques such as  deep neural networks , are enabling a range of emerging applications. One such example is  autonomous driving , which often relies on  deep learning  for perception. However, deep learning-based perception has been shown to be vulnerable to a host of subtle adversarial manipulations of images. Nevertheless, the vast majority of such demonstrations focus on perception that is disembodied from end-to-end control. We present novel end-to-end attacks on autonomous driving in simulation, using simple physically realizable attacks: the painting of black lines on the road. These attacks target deep  neural network models  for end-to-end autonomous driving control. A systematic investigation shows that such attacks are easy to engineer, and we describe scenarios (e.g., right turns) in which they are highly effective. We define several objective functions that quantify the success of an attack and develop techniques based on  Bayesian Optimization  to efficiently traverse the  search space  of higher dimensional attacks. Additionally, we define a novel class of  hijacking  attacks, where painting lines on the road cause the driverless car to follow a target path. Through the use of network  deconvolution , we provide insights into the  successful attacks , which appear to work by mimicking activations of entirely different scenarios. Our code is available on  https://github.com/xz-group/AdverseDrive",
    "citation_count": "76",
    "year": "2020/11/01",
    "authors": [
        {
            "name": "Adith Boloor",
            "country": ""
        },
        {
            "name": "Karthik Garimella",
            "country": ""
        },
        {
            "name": "Xin He",
            "country": ""
        },
        {
            "name": "Christopher Gill",
            "country": ""
        },
        {
            "name": "Yevgeniy Vorobeychik",
            "country": ""
        },
        {
            "name": "Xuan Zhang",
            "country": ""
        }
    ],
    "keywords": []
}