{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117303910",
    "title": "Automotive decentralized diagnosis based on CAN real-time analysis",
    "abstract": "Nowadays, modern  automotive systems  include a  great number  of  Electronic Control Units  (ECUs). These ECUs provide many sophisticated systems such as engine control, antilock braking systems, etc. This fact has increased the automotive embedded networks complexity. Another important issue in this field is the necessity to define a suitable diagnosis strategy to prevent  faults propagation . The integration of diagnosis functions into the automotive embedded systems contributes to overload the communication protocols. In this context, solutions for checking latencies entailed by extra-data traffic are urgently needed. Throughout this paper, a novel approach for the automotive diagnosis design, which is based on the  Controller Area Network  (CAN) analysis, is detailed. The principal contribution of this work consists in developing a decentralized fault diagnosis and studying its data traffic effect on messages deadlines. Our novel method, “CAN real-time analysis based on decentralized fault diagnosis”, is a step ahead to a reliable early phase  automotive design . As a  proof of concept , the proposed approach is applied on a model of an advanced anti-crash system. The proposed design methodology presents several advantages. It optimizes the schedulability of tasks and facilitates the design validation. Moreover, a realistic hardware-in-the-loop simulation is carried out to validate our work.",
    "citation_count": "15",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Othman Nasri",
            "country": ""
        },
        {
            "name": "Nadhir Mansour Ben Lakhal",
            "country": ""
        },
        {
            "name": "Lounis Adouane",
            "country": ""
        },
        {
            "name": "Jaleleddine Ben Hadj Slama",
            "country": ""
        }
    ],
    "keywords": []
}