{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000497",
    "title": "Bus network assisted drone scheduling for sustainable charging of wireless rechargeable sensor network ",
    "abstract": "Wireless Rechargeable Sensor Network ( WRSN ) is largely used in monitoring of environment and traffic, video surveillance and medical care, etc., and helps to improve the quality of urban life. However, it is challenging to provide the sustainable energy for sensors deployed in buildings, soil or other places, where it is hard to harvest the energy from environment. To address this issue, we design a new wireless charging system, which levers the bus network assisted drone in urban areas. We formulate the drone scheduling problem based on this new wireless charging system to minimize the total time cost of drone subject to all sensors can be charged under the energy constraint of drone. Then, we propose an approximation algorithm  DSA  for the energy tightened drone scheduling problem. To make the tasks of  WRSN  sustainable, we further formulate the drone scheduling problem with deadlines of sensors, and present the approximation algorithm  DDSA  to find the drone schedule with the maximal number of sensors charged by the drone before deadlines. Through the extensive simulations, we demonstrate that  DSA  can reduce the total time cost by 84.83% compared with  Greedy Replenished Energy  algorithm, and uses at most 5.98 times of the total time cost of optimal solution on average. Then, we also demonstrate that  DDSA  can increase the survival rate of sensors by 51.95% compared with  Deadline Greedy Replenished Energy  algorithm, and can obtain 77.54% survival rate of optimal solution on average.",
    "citation_count": "29",
    "year": "2021/06/01",
    "authors": [
        {
            "name": "Yong Jin",
            "country": ""
        },
        {
            "name": "Jia Xu",
            "country": ""
        },
        {
            "name": "Sixu Wu",
            "country": ""
        },
        {
            "name": "Lijie Xu",
            "country": ""
        },
        {
            "name": "Dejun Yang",
            "country": ""
        },
        {
            "name": "Kaijian Xia",
            "country": ""
        }
    ],
    "keywords": []
}