{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762113001288",
    "title": "Cache isolation for virtualization of mixed general-purpose and real-time systems",
    "abstract": "Shared cache has been widely used to lessen the  communication overhead  between multi-core processors and off-chip main memories. In a virtualization execution environment, real-time tasks supported by real-time operating systems (RTOS) need to share the last level cache with other general purpose tasks (supported by general  purpose operating systems  (GPOS) or execute on bare metal). Since current  hypervisors  are not aware of the attributes of tasks in the virtual machines, real-time tasks cannot be adequately supported by the hypervisor. Therefore, real-time task will suffer from many cache misses, and the response of a virtual machine may be poor due to cache pollution, especially if real-time tasks compete for cache resources with heavy general-purpose tasks. To address this issue, we propose two  cache optimization  management policies. One is cache partitioning (CAP) – which isolates the cache statically for real-time tasks and general-purpose tasks using page coloring. Hence the predictability of cache usage is greatly increased. CAP reduces both cache pollution, and the amount of cache space that real-time tasks use, even if other cache is not used by general purpose tasks. We also study allocating different proportions of the cache for real-time tasks and find that, a proper cache ratio is optimal to guarantee response time. Due to this, another dynamic cache  optimization policy  is proposed, called page table  prefetching  (PTP). PTP employs a daemon-like thread to maintain the cache, so as to make the contents used by real-time tasks be in cache. PTP is implemented by utilizing a dedicated core assigned to general-purpose tasks to do prefectching of a page table into shared physical cache for a soft real-time task. As the page table is referenced frequently by tasks, PTP gives a considerable advantage because fewer  TLB  misses occur. The results from the Cyclitest and CPUspec2006 benchmarks show that both CAP and PTP can provide better response for real-time tasks. CAP has benefits due to its simplicity, but PTP has advantages in flexibility and high cache utilization due to its dynamic cached maintenance. In addition, the experimental results show that PTP improves real-time performance more but sacrifices some GP performance.",
    "citation_count": "8",
    "year": "2013/11/01",
    "authors": [
        {
            "name": "Ruhui Ma",
            "country": ""
        },
        {
            "name": "Wei Ye",
            "country": ""
        },
        {
            "name": "Alei Liang",
            "country": ""
        },
        {
            "name": "Haibing Guan",
            "country": ""
        },
        {
            "name": "Jian Li",
            "country": ""
        }
    ],
    "keywords": []
}