{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120300485",
    "title": "Certificateless public key encryption with cryptographic reverse firewalls",
    "abstract": "The Snowden incident shows that powerful attackers can compromise users’ machines to steal users’ private information. Currently, many  encryption schemes  that have proven to be secure cannot detect vulnerabilities. These vulnerabilities may reveal users’ secrets, e.g., a machine hides some backdoors without a user’s awareness, and an attacker can steal the user’s private information through these backdoors. In 2015, Mironov and Stephens-Davidowitz proposed a new framework for solving this problem: cryptographic reverse firewall (CRF). However, their protocols can’t protect certificateless  public key encryption  (CL-PKE). In this paper, we design a CRF protocol for CL-PKE, which is a one-round CL-PKE with CRFs (CL-PKE-CRF) deployed on a receiver and a key generating centre (KGC). This protocol is proved to achieve indistinguishability against chosen  plaintext attack  (IND-CPA). Compared with existing protocol with CRFs and two CL-PKE schemes, our protocol has the least communication cost. Meanwhile, we use JPBC library to implement our one-round CL-PKE-CRF. The experimental results indicate that under high  security levels , our protocol has a advantage in the percentage of the running time. Since our protocol can resist exfiltration attacks from internal attackers, it is efficient and practical. Finally, we apply the same method to design a secure and effective one-round certificateless  public key signature  with a CRF (CL-PKS-CRF). This means that our protocol is not only targeted at a single CL-PKE scheme, but also can inspire the design of other certificateless  public key cryptography  schemes with CRFs.",
    "citation_count": "32",
    "year": "2020/10/01",
    "authors": [
        {
            "name": "Yuyang Zhou",
            "country": ""
        },
        {
            "name": "Jing Guo",
            "country": ""
        },
        {
            "name": "Fagen Li",
            "country": ""
        }
    ],
    "keywords": []
}