{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001521",
    "title": "Computation-transferable authenticated key agreement protocol for smart healthcare",
    "abstract": "Smart healthcare  plays an important role in contemporary society while its security and privacy issues remain inevitable challenges.  Authenticated key agreement  (AKA) mechanism, as the foundation of secure communication, has been recognized as an important measure for solving this problem. Most existing AKA protocols utilize cloud-based centralized architecture, data privacy and security can be exposed easily once the centralized authority is attacked. In addition, most past solutions require the online registration center to assist mutual authentication and consume considerable amounts of resources. To address these drawbacks, a computation-transferable authenticated key agreement protocol without an online registration center for smart healthcare is designed. Specifically, the proposed protocol can realize mutual authentication and key agreement without the need for an online registration center, as well as being able to satisfy security and privacy protection requirements. By  transferring   partial computation  tasks to the server, the proposed scheme incurs lower computation and  communication overhead  on the user side. Moreover, the proposed scheme adopts certificateless  public key cryptography , which can solve the problems of certificate management and key escrow. Performance analysis indicates that the proposal reduces 9.9% of the computation overhead on the resource-limited terminal, which is suitable for low-power  IoT  applications, including smart healthcare.",
    "citation_count": "28",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Wenming Wang",
            "country": ""
        },
        {
            "name": "Haiping Huang",
            "country": ""
        },
        {
            "name": "Fu Xiao",
            "country": ""
        },
        {
            "name": "Qi Li",
            "country": ""
        },
        {
            "name": "Lingyan Xue",
            "country": ""
        },
        {
            "name": "Jiansheng Jiang",
            "country": ""
        }
    ],
    "keywords": []
}