{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001181",
    "title": "Cooperative computation offloading and resource allocation for delay minimization in mobile edge computing",
    "abstract": "Mobile edge computing  (MEC) is a promising paradigm, which brings computation resources in proximity to mobile devices and allows the tasks of mobile devices to be offloaded to MEC servers with low latency. The  joint  problem of cooperative computation  task offloading  and  resource allocation  is a challenging issue. The joint problem of cooperative computation task offloading scheme and resource assignment in MEC is investigated in this paper, where the vertical cooperation among mobile devices, mobile edge server nodes and mobile cloud server nodes is considered, and the horizontal computation cooperation between edge nodes is considered as well. A  computation offloading  decision, cooperative selection,  power allocation  and CPU cycle frequency assignment problem is formulated. The objective is to minimize the latency while guaranteeing the constraint of transmission power, energy consumption and CPU cycle frequency. The formulated latency  optimization problem  is a nonconvex mixed-integer problem in general, which has binary variables and continuous variables. In order to solve the formulated problem. A joint  iterative algorithm  based on the Lagrangian dual decomposition, ShengJin Formula method, and monotonic optimization method is proposed. The CPU cycle frequence allocation is handled by the ShengJin Formula method due to the  cubic equation  of one variable about the CPU frequence allocation. The transmission power assignment is handled by the monotonic optimization method. In the algorithm convergence with different number of tasks, the proposed algorithm can quickly and effectively reach the convergence state and getting the minimum task execution delay. Numerical results demonstrate that the proposed algorithm outperforms the Full MEC, Full Local and Full Cloud three schemes in terms of execution latency.",
    "citation_count": "92",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Zhufang Kuang",
            "country": ""
        },
        {
            "name": "Zhihao Ma",
            "country": ""
        },
        {
            "name": "Zhe Li",
            "country": ""
        },
        {
            "name": "Xiaoheng Deng",
            "country": ""
        }
    ],
    "keywords": []
}