{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762119302954",
    "title": "Cost and makespan-aware workflow scheduling in hybrid clouds",
    "abstract": "Benefiting from rich resources and virtualization technologies, hybrid cloud has emerged as a promising solution to processing large-scale scientific workflow applications for users in a pay-as-you-go manner. However, considering the complexity of resource configuration and deployment in hybrid clouds, existing workflow scheduling strategies designed for traditional distributed computing systems are limited and powerless. Therefore, for profit-driven infrastructure-as-a-service (IaaS) cloud providers, minimizing makespan and monetary cost of scheduling scientific workflows is an imperative concern. In this paper, we propose two efficient workflow scheduling approaches for hybrid clouds that both consider makespan and monetary cost. Specifically, we first propose a single-objective workflow scheduling optimization approach called DCOH (deadline-constrained cost optimization for hybrid clouds) for minimizing the monetary cost of scheduling workflows under deadline constraint. Based on DCOH, we further propose a multi-objective workflow scheduling optimization approach called MOH (multi-objective optimization for hybrid clouds) for optimizing makespan and monetary cost of scheduling workflows simultaneously. Extensive simulation experiments have been conducted to validate the effectiveness of DCOH and MOH. Simulation results show that our DCOH approach can reduce up to 100.0% monetary cost for users as compared to the competing algorithms under the same deadline constraint and our MOH approach can achieve better cost-makespan trade-off solutions as compared to the competing algorithms.",
    "citation_count": "0",
    "year": "2019/11/01",
    "authors": [
        {
            "name": "Junlong Zhou",
            "country": ""
        },
        {
            "name": "Tian Wang",
            "country": ""
        },
        {
            "name": "Peijin Cong",
            "country": ""
        },
        {
            "name": "Pingping Lu",
            "country": ""
        },
        {
            "name": "Tongquan Wei",
            "country": ""
        },
        {
            "name": "Mingsong Chen",
            "country": ""
        }
    ],
    "keywords": []
}