{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001784",
    "title": "Dynamic computation scheduling for hybrid energy mobile edge computing networks",
    "abstract": "The rapid expansion of Mobile Edge Computing (MEC) is driven by the growing demand for resource-intensive applications within the Internet of Things. Computation offloading allows these applications to be executed at the network edge, but it leads to significant electricity expenses for network operators. To mitigate these costs, one promising solution is to power base stations (BSs) with a hybrid energy supply that combines unpredictable harvested energy with stable energy from the smart grid. This paper investigates joint computation scheduling for mobile devices (MDs) and resource allocation in a MEC network incorporating hybrid energy sources. Our objective is to maximize long-term time-averaged service utility by optimizing parameters such as BS battery supply, harvestable energy, CPU frequency, transmission power, task-partition factor, and MD-BS associations. To tackle this complex problem, we exploit the Lyapunov optimization framework to decompose it into deterministic subproblems for each time slot and propose an online network service utility maximization scheduling (NSUMS) algorithm. Experimental results show that our algorithm outperforms benchmark schemes in service utility and energy expenditure, improving the completion ratio by 32%, reducing the failure rate by 80%, and decreasing MD energy consumption by 28%.",
    "citation_count": "1",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Ran Bi",
            "country": ""
        },
        {
            "name": "Liang Sun",
            "country": ""
        },
        {
            "name": "Yiwei Sun",
            "country": ""
        },
        {
            "name": "Meng Han",
            "country": ""
        },
        {
            "name": "Qingxu Deng",
            "country": ""
        }
    ],
    "keywords": []
}