{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122001126",
    "title": "Edge data integrity verification scheme supporting data dynamics and batch auditing",
    "abstract": "With the rapid development of 5G technology and wireless networks, new applications such as VR/AR-based immersive online games have developed rapidly. These applications are very sensitive to network delays. To address the  time delay  of  data transfer , the vendors of these delay-sensitive applications often deploy data replicas on edge servers to provide users with a low-latency application experience. However, the  edge computing  environment is highly distributed and dynamic, which makes the data replicas stored on edge servers often face intentional or unintentional damage. In addition, the computing resources of edge servers are very limited compared to cloud servers. Therefore, how to efficiently audit the integrity of data replicas stored on a large number of edge servers becomes an urgent problem to be solved. This paper first designs a data  integrity verification  scheme called EDI-DA in edge environment to help application vendors to check the integrity of data replicas stored on distributed edge servers. Then, we extend EDI-DA to allow application vendors to verify the integrity of different edge data replicas simultaneously, i.e., our EDI-DA supports batch auditing of multiple original data. Next, we propose an improved  data structure  I-SLT based on which EDI-DA supports full data dynamics, including insertion, deletion and modification. Finally, security and performance analyses indicate the security and practicability of our EDI-DA.",
    "citation_count": "15",
    "year": "2022/07/01",
    "authors": [
        {
            "name": "Yan Ding",
            "country": ""
        },
        {
            "name": "Yanping Li",
            "country": ""
        },
        {
            "name": "Wenjie Yang",
            "country": ""
        },
        {
            "name": "Kai Zhang",
            "country": ""
        }
    ],
    "keywords": []
}