{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118303278",
    "title": "Efficient sizing and placement of distributed generators in cyber-physical power systems",
    "abstract": "Now days, distribution system has experienced numerous significant changes due to the implementation of  smart grid technology  and integration of distributed and  renewable energy resources . Optimal integration of distributed generators and reconfiguration of the radial network have overall positive impacts on the  power system . In this paper our aim is to minimize line losses and  total harmonic distortion  (THD), and to improve the voltage profile of the system by optimal placement and sizing of distributed generators and optimal reconfiguration of the network simultaneously. The impact of total harmonic distortion on power factor is also evaluated in this paper.  Genetic algorithm  is used as a  solving tool  to find optimal size of distributed generators and optimal reconfiguration of the network in a varying load environment. Placement buses for distributed generators are found by sensitivity analysis of the network. Fast harmonic load flow analysis and forward/backward sweep methods based on bus  current injection  to branch current (BIBC) matrix and branch current to  bus voltage  (BCBV) matrix are developed according to the  network topology . The methodology is executed on IEEE-33 bus  radial distribution  system and the results shows its effectiveness.",
    "citation_count": "35",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Faheem Ud Din",
            "country": ""
        },
        {
            "name": "Ayaz Ahmad",
            "country": ""
        },
        {
            "name": "Hameed Ullah",
            "country": ""
        },
        {
            "name": "Aimal Khan",
            "country": ""
        },
        {
            "name": "Tariq Umer",
            "country": ""
        },
        {
            "name": "Shaohua Wan",
            "country": ""
        }
    ],
    "keywords": []
}