{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121002629",
    "title": "Efficient Reservation-based Fault-Tolerant Scheduling for IEEE 802.1Qbv Time-Sensitive Networking",
    "abstract": "Time-Sensitive Networking (TSN) is one of the enhanced  Ethernet technologies  for the real-time application of industrial networks in the future. However, unexpected data errors caused by transient influence like  electromagnetic interference  may be occurred during the  data transmission . One common way to tolerate such failures is to directly transmit multiple instance copies, such as IEEE 802.1 CB. However, wasting limited network resources is one of the drawbacks, since not all message copies could be received incorrectly.  Cyclic Redundancy Check  (CRC) can detect such errors when data is received, then the detection result is notified to the sending node. Despite that the re-transmission is performed only if the returned detection result is negative or time-out, the occurrence of errors are uncertain. Consequently, the time when responding to the re-transmission requests is also random, which results in different transmission sequences and violates the deterministic transmission service of TSN. Furthermore, CRC detection results messages also might be fault during transmission. To tackle the above drawbacks, we propose a novel offline reservation-based fault-tolerance  scheduling algorithm  for IEEE 802.1 Qbv TSN. Firstly, the  Dijkstra algorithm  is used to generate the routing for each flow. Then, the  resource allocation  is generated by Satisfiability Modulo Theories according to TSN constraints formulated to guarantee the deterministic transmission for Time-Trigger (TT) flows, CRC-related flows, and the reserved re-transmissions of TT flows. Finally, the queues are also open for non-TT flows in the time slice reserved for re-transmissions of TT flows to enhance the throughput of non-TT flows. Through extensive simulations, we demonstrate the effectiveness of the proposed approach in terms of acceptance ratio,  execution time  and the wasted resources.",
    "citation_count": "18",
    "year": "2022/02/01",
    "authors": [
        {
            "name": "Zhiwei Feng",
            "country": ""
        },
        {
            "name": "Qingxu Deng",
            "country": ""
        },
        {
            "name": "Mingyang Cai",
            "country": ""
        },
        {
            "name": "Jinghua Li",
            "country": ""
        }
    ],
    "keywords": []
}