{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124000419",
    "title": "Efficient public-key searchable encryption against inside keyword guessing attacks for cloud storage",
    "abstract": "Cloud storage offers data users relief from cumbersome management tasks and enhances overall efficiency. However, while it brings convenience, there is also the risk of  privacy breaches . To address this, public-key encryption with  keyword search  (PEKE) presents a solution that balances efficiency, convenience, and security in the context of cloud storage. Nevertheless, PEKS is vulnerable to inside keyword guessing attacks and algorithm substitution attacks, posing a serious threat to its deployment. Cryptographic reverse firewall technique randomizes incoming messages to effectively defend against both types of attacks mentioned earlier through a gateway. However, this approach requires the gateway to store a  random number  for each keyword, increasing  storage costs  and potentially exposing keyword information. In response, we propose an improved scheme that inherits the remarkable properties of the method based on cryptographic reverse firewall. Additionally, the proposed scheme eliminates the need for gateways to store random numbers, reducing the management and storage burdens and supports multiple keywords for one document, a feature more aligned with real-world applications. Furthermore, we prove the security of the scheme, which achieves the same security goals as the existing scheme. Finally, we analyze the scheme s efficiency through theoretical analysis and performance evaluation, which demonstrates its efficiency.",
    "citation_count": "5",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Axin Wu",
            "country": ""
        },
        {
            "name": "Fagen Li",
            "country": ""
        },
        {
            "name": "Xiangjun Xin",
            "country": ""
        },
        {
            "name": "Yinghui Zhang",
            "country": ""
        },
        {
            "name": "Jianhao Zhu",
            "country": ""
        }
    ],
    "keywords": []
}