{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002703",
    "title": "Efficient holistic timing analysis with low pessimism for rate-constrained traffic in TTEthernet",
    "abstract": "Safety-critical systems such as automotive and aerospace have high demands in real-time and reliability, and standard Ethernet cannot meet the requirements. TTEthernet provides deterministic,  synchronous communication  services and supports traffic classes with different priorities in the network, suitable for the safety-critical automotive and aerospace fields. However, the transmission of event-triggered rate-restricted (RC) traffic in TTEthernet is disturbed by multiple factors, such as preemption of TT traffic and interactions between RC traffic. Therefore RC traffic has an uncertain end-to-end delay. Existing delay analysis approaches do not provide a good balance of computational accuracy and time complexity. This paper proposes an extended holistic approach to obtain the worst-case end-to-end delay for RC traffic in TTEthernet. Our approach is based on the integration strategy of preemption in TTEThernet. We use the TT scheduled table as an input parameter and consider the frames’ offset to avoid traversing frames that do not generate interference. We compare our approach with existing approaches (Tam15, Ste11, and NC). The experimental results show that our approach obtains less pessimistic results than the approaches of Ste11 and NC while outperforming these three approaches in time complexity.",
    "citation_count": "10",
    "year": "2023/01/01",
    "authors": [
        {
            "name": "Ran Li",
            "country": ""
        },
        {
            "name": "Bin Fu",
            "country": ""
        },
        {
            "name": "Guoqi Xie",
            "country": ""
        },
        {
            "name": "Fei Peng",
            "country": ""
        },
        {
            "name": "Renfa Li",
            "country": ""
        }
    ],
    "keywords": []
}