{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001103",
    "title": "Energy-efficient scheduling for parallel applications with reliability and time constraints on heterogeneous distributed systems",
    "abstract": "Reliability is a crucial index of the system, and many safety-critical applications have reliability requirements and deadline constraints. In addition, in order to protect the environment and reduce system operating costs, it is necessary to minimize energy consumption as much as possible. This paper considers parallel applications on heterogeneous distributed systems and proposes two algorithms to minimize energy consumption for meeting the deadline and satisfying the reliability requirement of the applications. The first algorithm is called minimizing scheduling length while satisfying the reliability requirement (MSLSRR). It first transforms the reliability requirement of the application into the reliability requirement of the task and then assigns the task to the processor with the earliest finish time. Since the reliability generated by MSLSRR is often higher than the reliability requirement of the application, and the scheduling length is also less than the deadline, an algorithm called improving energy efficiency (IEE) is designed, which redefined the minimum reliability requirement for the task and applied  dynamic voltage and frequency scaling  (DVFS) technique for energy conservation. The proposed algorithms are compared with existing algorithms by using real parallel applications. Experimental results demonstrate that the proposed algorithms consume the least energy.",
    "citation_count": "3",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Hongzhi Xu",
            "country": ""
        },
        {
            "name": "Binlian Zhang",
            "country": ""
        },
        {
            "name": "Chen Pan",
            "country": ""
        },
        {
            "name": "Keqin Li",
            "country": ""
        }
    ],
    "keywords": []
}