{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001486",
    "title": "Expanding hardware accelerator system design space exploration with gem5-SALAMv2",
    "abstract": "With the prevalence of  hardware accelerators  as an integral part of the modern  systems on chip  (SoCs), the ability to model accelerators quickly and accurately within the system in which it operates is critical. This paper presents gem5-SALAMv2 as a novel  system architecture  for LLVM-based  modeling and simulation  of custom  hardware accelerators  integrated into the gem5 framework. It overcomes the inherent limitations of state-of-the-art trace-based pre-register-transfer level (RTL) simulators by offering a truly “execute-in-execute” LLVM-based model. It enables scalable modeling of multiple dynamically interacting accelerators with full-system simulation support. To create long-term sustainable expansion compatible with the gem5 system framework, gem5-SALAM offers a general-purpose and modular communication interface and memory hierarchy integrated into the gem5 ecosystem, streamlining designing and modeling accelerators for new and emerging applications. gem5-SALAMv2 expands upon the framework established in gem5-SALAMv1 with improved LLVM-based elaboration and simulation, improved and more extensible system integration, and new automations to simplify  rapid prototyping  and  design space exploration .  1 Validation on the MachSuite (Reagen et al., 2014) benchmarks presents a timing  estimation error  of less than 1% against the Vivado High-Level Synthesis (HLS) tool. Results also show less than a 4% area and power estimation error against Synopsys Design Compiler. Additionally, system validation against implementations on an Ultrascale+ ZCU102 shows an average end-to-end timing error of less than 2%. Lastly, we demonstrate the upgraded capabilities of gem5-SALAMv2 by exploring accelerator platforms for two  deep neural networks , LeNet5 and  MobileNetv2 . In these explorations, we demonstrate how gem5-SALAMv2 can simulate such systems and guide architectural optimizations for these types of accelerator-rich architectures.  2",
    "citation_count": "0",
    "year": "2024/09/01",
    "authors": [
        {
            "name": "Zephaniah Spencer",
            "country": ""
        },
        {
            "name": "Samuel Rogers",
            "country": ""
        },
        {
            "name": "Joshua Slycord",
            "country": ""
        },
        {
            "name": "Hamed Tabkhi",
            "country": ""
        }
    ],
    "keywords": []
}