{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001880",
    "title": "Fair and size-scalable participant selection framework for large-scale mobile crowdsensing",
    "abstract": "Mobile Crowdsensing (MCS) is a cost-efficient community sensing paradigm. It employs massive  mobile computing devices  such as smartphones to sense and propagate data collectively. Two main problems in MCS aiming to use these applications efficiently and their generated data are participants selection problem and incentive mechanism design problem. Specifically, the participant selection problem is to select a suitable set of participants for collecting the sensing data, while incentive mechanism design is to allocate the suitable incentives to these participants. Since the incentives allocated to the participants affect their behaviors, the system needs to adopt different participant selection methods under different incentive mechanisms. This paper proposes a dynamic participant selection method to select suitable participants under a flexible incentive mechanisms framework. We first adopt a  game theory  method to estimate the effect that the incentives bring to the participants’ behavior and then predict their mobility patterns. Based on the predicted mobility patterns of the participants, we design a distributed  approximate algorithm  to solve the participant selection problem. Finally, comprehensive experiments on a real-life large-scale dataset have demonstrated that our method outperforms other well-recognized baselines in various incentive mechanisms.",
    "citation_count": "9",
    "year": "2021/10/01",
    "authors": [
        {
            "name": "Shu Li",
            "country": ""
        },
        {
            "name": "Wei Shen",
            "country": ""
        },
        {
            "name": "Muhammad Bilal",
            "country": ""
        },
        {
            "name": "Xiaolong Xu",
            "country": ""
        },
        {
            "name": "Wanchun Dou",
            "country": ""
        },
        {
            "name": "Nour Moustafa",
            "country": ""
        }
    ],
    "keywords": []
}