{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762107000483",
    "title": "Feasibility of decoupling memory management from the execution pipeline",
    "abstract": "In conventional architectures, the  central processing unit  (CPU) spends a significant amount of execution time allocating and de-allocating memory. Efforts to improve  memory management  functions using custom allocators have led to only small improvements in performance. In this work, we test the feasibility of decoupling memory management functions from the main processing element to a separate memory management hardware. Such memory management hardware can reside on the same die as the CPU, in a  memory controller  or embedded within a DRAM chip. Using Simplescalar, we simulated our architecture and investigated the execution performance of various benchmarks selected from SPECInt2000, Olden and other memory intensive application suites. Hardware allocator reduced the execution time of applications by as much as 50%. In fact, the decoupled hardware results in a  performance improvement  even when we assume that both the hardware and software  memory allocators  require the same number of cycles. We attribute much of this improved performance to improved  cache behavior  since decoupling memory management functions reduces cache pollution caused by dynamic memory management software. We anticipate that even higher levels of performance can be achieved by using innovative hardware and software optimizations. We do not show any specific implementation for the memory management hardware. This paper only investigates the potential performance gains that can result from a hardware allocator.",
    "citation_count": "5",
    "year": "2007/12/01",
    "authors": [
        {
            "name": "Wentong Li",
            "country": ""
        },
        {
            "name": "Mehran Rezaei",
            "country": ""
        },
        {
            "name": "Krishna Kavi",
            "country": ""
        },
        {
            "name": "Afrin Naz",
            "country": ""
        },
        {
            "name": "Philip Sweany",
            "country": ""
        }
    ],
    "keywords": []
}