{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302764",
    "title": "FPGA emulation methodology for fast and accurate power estimation of embedded processors",
    "abstract": "Early estimation of application-specific  power consumption  has become one of the major constraints of modern  ASIC  design. While in early stages of the design process precise power consumption can only be obtained from very time consuming gate-level (GTL) simulation, power estimation methodologies aim to reduce computational overhead by deriving models to approximate power consumption on higher levels. This work presents an  FPGA  accelerated power estimation methodology for programmable processors based on a hybrid functional level (FLPA) and instruction level power analysis (ILPA) that can be mapped onto an FPGA together with the functional emulation. It enables fast and accurate estimation of application-specific power consumption and energy per task which is crucial for power-aware design of embedded processor architectures. The approach allows both hardware and software designers to optimize their implementations not only for processing performance but also for power efficiency. The power emulation methodology and considerations for the FPGA implementation of the power estimation is described in detail. Model validation against GTL power simulation and results are given for a typical embedded RISC processor and a commercial-grade Application Specific Instruction  Set Processor  (ASIP). Power consumption models yield fast and accurate power estimation with a %MAE of less than 9% and  NRMSE  of less than 7% enabling co-optimization of both hardware and software with respect to power consumption in early design stages.",
    "citation_count": "0",
    "year": "2017/06/01",
    "authors": [
        {
            "name": "S. Hesselbarth",
            "country": ""
        },
        {
            "name": "G. Schewior",
            "country": ""
        },
        {
            "name": "H. Blume",
            "country": ""
        }
    ],
    "keywords": []
}