{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001723",
    "title": "Heterogeneous and plaintext checkable signcryption for integrating IoT in healthcare system",
    "abstract": "Preserving the confidentiality and integrity of data transmission is paramount in the  Internet of Things  (IoT)-based healthcare systems. Current  encryption techniques  that allow plaintext checks primarily serve a specific  cryptosystem , lacking the adaptability to work with a diverse system incorporating various cryptographic methods. To address this, we present a unique online/offline heterogeneous signcryption scheme with plaintext checkable encryption (HOOSC-PCE). This approach enables the transition of signcrypted messages from an identity-based  cryptosystem  (IBC) to a  public key infrastructure  (PKI) system, improving information interoperability. A key aspect of our scheme is its capacity to allow cloud servers to perform plaintext queries, facilitating efficient data searches using plaintext keywords over  encrypted data . Furthermore, the signcryption process is divided into online and offline phases. The online phase handles tasks that require fewer resources, while the offline phase carries out more resource-intensive preparatory tasks. We rigorously tested the HOOSC-PCE scheme’s security by proving it secure under the  Random Oracle Model  (ROM). Meanwhile, compared to similar work, it effectively reduces computation costs by 46.39%, 19.45%, 18.73%, and 13.25% across offline encryption, online encryption, decryption, and search algorithms. The results indicate that the HOOSC-PCE is secure and efficient, confirming its feasibility for IoT-based healthcare systems.",
    "citation_count": "0",
    "year": "2024/09/01",
    "authors": [
        {
            "name": "Abdalla Hadabi",
            "country": ""
        },
        {
            "name": "Zheng Qu",
            "country": ""
        },
        {
            "name": "Kuo-Hui Yeh",
            "country": ""
        },
        {
            "name": "Chien-Ming Chen",
            "country": ""
        },
        {
            "name": "Saru Kumari",
            "country": ""
        },
        {
            "name": "Hu Xiong",
            "country": ""
        }
    ],
    "keywords": []
}