{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117300747",
    "title": "Integration of Data Distribution Service and distributed partitioned systems",
    "abstract": "Avionics systems are complex and time-critical systems that are progressively adopting more flexible (though equally robust)  architectural designs . Although a number of current avionics systems follow federated architectures, the  Integrated Modular Avionics  (IMA) paradign is becoming the dominant style in the more modern developments. The reason is that the IMA concept promotes modular designs where applications with different levels of  criticality  can execute in an isolated manner in the same hardware. This approach complies with the requirements of cost, safety, and weight of the avionics systems. FACE standard (Future Airborne Capability Environment) defines the architectural baseline for easing integration in avionics systems, including the communication functions across distributed components. As specified in FACE, middleware will be integrated into avionics systems to ease development of portable components that can interoperate effectively. This paper describes the usage of publish-subscribe middleware (precisely,  DDS  – Data Distribution Service for real-time systems) into a fully distributed partitioned system. We describe, from a practical point of view, the integration of the middleware  communication overhead  into the hierarchical scheduling (as compliant with ARINC 653) to allow the usage of middleware in the partitions. We explain the design of a realiable communication setting, exemplified on a distributed monitoring application in a partitioned environment. The obtained implementation results show that, given the stable communication overhead of the middleware, it can be integrated in the time windows of partitions.",
    "citation_count": "20",
    "year": "2018/02/01",
    "authors": [
        {
            "name": "Marisol García-Valls",
            "country": ""
        },
        {
            "name": "Jorge Domínguez-Poblete",
            "country": ""
        },
        {
            "name": "Imad Eddine Touahria",
            "country": ""
        },
        {
            "name": "Chenyang Lu",
            "country": ""
        }
    ],
    "keywords": []
}