{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000402",
    "title": "Lightweight batch authentication and key agreement scheme for IIoT gateways",
    "abstract": "Existing authentication and key agreement (AKA) schemes face two primary challenges in IIoT, where users dynamically communicate with multiple industrial devices. The first is significant computational and communication overhead, along with security vulnerabilities. Another is inability to achieve gateway lightweight solutions. To address these issues, this paper proposes a gateway lightweight batch AKA scheme based on elliptic curve cryptography for IIoT. When users access multiple industrial devices, they only need to send a batch authentication request to the gateway. Based on this request, the gateway generates a time-limited token combining Chinese Remainder Theorem (CRT), enabling users to efficiently complete AKA with multiple devices in batch manner. Furthermore, the application of the CRT allows the gateway to efficiently update the time-limited token when the user’s accessed devices change. Finally, due to the use of the time-limited token, the entire scheme process requires only one round of interaction between the gateway and the user, ensuring a lightweight nature of the gateway. The security of the proposed scheme is proved through formal security proofs, heuristic analysis, and scyther tools. Performance analysis shows that, compared to the compared schemes, the proposed scheme meets all listed security requirements with the lower computational and communication overheads.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Xiaohui Ding",
            "country": ""
        },
        {
            "name": "Jian Wang",
            "country": ""
        },
        {
            "name": "Yongxuan Zhao",
            "country": ""
        },
        {
            "name": "Zhiqiang Zhang",
            "country": ""
        }
    ],
    "keywords": []
}