{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118300912",
    "title": "Locality-aware cache random replacement policies",
    "abstract": "Measurement-Based Probabilistic Timing Analysis (MBPTA) facilitates the analysis of complex software running on hardware comprising high-performance features. MBPTA also aims at preventing additional analysis costs for timing analysis techniques and preserving the confidence on derived  WCET  estimates.  Cache behavior  has a deep influence on  WCET  estimates and hence on “the amount of software” that can be consolidated onto a single hardware platform. Deterministic replacement policies such as LRU (Least Recently Used) and NMRU (Non-Most Recently Used) have systematic  pathological cases  that may lead to high execution times and WCET estimates. Instead,  random replacement  (RR) decreases pathological cases probability, at the cost of  temporal locality . We present two new MBPTA-amenable replacement policies that completely remove the presented pathological cases. The first policy,  Random Permutations  (RP) preserves higher temporal locality than RR; while the second, NMRU Random Permutations (NMRURP), also protects the Most Recently Used line from eviction. Both proposed policies build upon restricted random replacement choices. Our simulation evaluation (validated against a real prototype) using the Mälardalen benchmarks and a  case study  shows that RP and NMRURP deliver both high average performance (within 1% of LRUs and NRMU performance) and tight WCET estimates 11% and 24% lower than those of RR.",
    "citation_count": "1",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Pedro Benedicte",
            "country": ""
        },
        {
            "name": "Carles Hernandez",
            "country": ""
        },
        {
            "name": "Jaume Abella",
            "country": ""
        },
        {
            "name": "Francisco J. Cazorla",
            "country": ""
        }
    ],
    "keywords": []
}