{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118301875",
    "title": "Methodology for the model-driven development of service oriented IoT applications",
    "abstract": "The main problem with the current technology solutions for  Internet of Things  (IoT) is located at the application level, in which there is still a lack of software components, frameworks, and tools which can help end-users to easily develop IoT applications and to manage the things or objects. These requirements lead to the use of the principles of Model-Driven Development (MDD) and Service-Oriented Architecture (SOA) for the construction of  software applications , allowing the generation of models at different levels of abstraction, with the possibility of generating software implementation artifacts (code) on different platforms, as well as allow the decomposition of complex and  monolithic systems  into loosely coupled components. In this paper, we propose a methodology based on the MDD for solving the challenges in the IoT system developments. The methodology is composed of four phases with different levels of abstraction, viewpoint,  granularity , and service-oriented. Furthermore, a set of MDD methods for the transformation of models using formal rules are proposed. We present a smart vehicle scenario in which the methodology and methods are implemented, allowing the generation of  executable code  as a component of a real-time system. In addition, an architecture for IoT systems composed of four layers is presented, which is based on the SOA approach. In this way, the methodology and the architecture allow the interoperability (from the perspective of models and software components) between heterogeneous devices to be guaranteed in multiple ways, establishing a bridge between the digital and physical world of the IoT domain .",
    "citation_count": "70",
    "year": "2018/10/01",
    "authors": [
        {
            "name": "Claudia M. Sosa-Reyna",
            "country": ""
        },
        {
            "name": "Edgar Tello-Leal",
            "country": ""
        },
        {
            "name": "David Lara-Alabazares",
            "country": ""
        }
    ],
    "keywords": []
}