{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122000820",
    "title": "Multiserver configuration for cloud service profit maximization in the presence of soft errors based on grouped grey wolf optimizer",
    "abstract": "With the growing demand of cloud customers for computing resources,  cloud computing  has become more and more popular. As a pay-as-you-go model, cloud computing enables customers to use cloud services on demand anytime, anywhere over the Internet and it has become the backbone of modern economy. Obviously, profit maximization is especially important for  cloud service providers  (CSPs) in a competitive cloud service market. Extensive research papers have been conducted during the past few years for CSPs to optimize cloud service profit, whereas few of them considers the  transient faults  (resulting in soft errors) that may happen during service requests’ execution and thus cause failed execution of these requests. In this paper, we study the multiserver configuration problem for cloud service profit maximization considering the deadline miss rate of service requests and the soft error reliability of the multiserver system. To solve the profit  optimization problem , we first construct the models of multiserver system, deadline miss rate, and soft error reliability. Based on these models, we derive the models associated with cloud service revenue and cloud service costs. Then, we formulate the cloud service profit optimization problem and propose an effective grouped grey wolf optimizer (GWO)-based  heuristic method  that can determine the optimal multiserver configuration for a given customer demand to maximize cloud service profit. Experimental results show that the cloud service profit improvement achieved by our scheme can be up to 33.76% as compared with a state-of-the-art benchmark scheme.",
    "citation_count": "5",
    "year": "2022/06/01",
    "authors": [
        {
            "name": "Peijin Cong",
            "country": ""
        },
        {
            "name": "Xiangpeng Hou",
            "country": ""
        },
        {
            "name": "Minhui Zou",
            "country": ""
        },
        {
            "name": "Jiangshan Dong",
            "country": ""
        },
        {
            "name": "Mingsong Chen",
            "country": ""
        },
        {
            "name": "Junlong Zhou",
            "country": ""
        }
    ],
    "keywords": []
}