{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002296",
    "title": "Multi-objective uplink data transmission optimization for edge computing in UAV-assistant mobile wireless sensor networks",
    "abstract": "Unmanned aerial vehicles  (UAVs) have attracted growing attention in enhancing the performance of mobile  wireless sensor networks  (MWSNs) since they can act as aerial servers (ASs) and have the autonomous nature to collect data for edge computing. In this paper, we consider to construct a virtual  antenna array  (VAA) consists of mobile  sensor nodes  (MSNs) and adopt collaborative  beamforming  (CB) to achieve long-distance and efficient uplink  data transmissions  with the ASs. First, we formulate a low interference and high-performance uplink transmission multi-objective optimization problem (UTMOP) of the CB-based UAV-assisted MWSN to simultaneously improve the total transmission rates, suppress the total maximum  sidelobe  levels (SLLs) and reduce the total propulsion energy consumptions of MSNs by jointly optimizing the positions and excitation current weights of MSN-enabled VAA and the order of communicating with different ASs. Then, we propose an improved non-dominated sorting genetic algorithm-III (INSGA-III) with chaos initialization, average grade mechanism and hybrid-solution generate strategy to solve the problem. Simulation results verify that the proposed algorithm can effectively solve the formulated UTMOP, and it has better performance than some other benchmark methods and peer algorithms.",
    "citation_count": "14",
    "year": "2022/11/01",
    "authors": [
        {
            "name": "Jiahui Li",
            "country": ""
        },
        {
            "name": "Geng Sun",
            "country": ""
        },
        {
            "name": "Shuang Liang",
            "country": ""
        },
        {
            "name": "Yuxin Wang",
            "country": ""
        },
        {
            "name": "Aimin Wang",
            "country": ""
        }
    ],
    "keywords": []
}