{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001267",
    "title": "Partitioned scheduling with safety-performance trade-offs in stochastic conditional DAG models",
    "abstract": "This paper is motivated by robotic systems that solve difficult real-world problems such as search and rescue (SAR) or precision agriculture  1 . These applications require robots to operate in complex, uncertain environments while maintaining safe interactions with human teammates within a specified level of performance. In this paper, we study the scheduling of real-time applications on heterogeneous hardware platforms inspired by such contexts. To capture the  stochasticity  due to unpredictable environments, we propose the stochastic heterogeneous parallel conditional DAG (SHPC-DAG) model, which extends the most recent HPC-DAG model in two regards. First, it uses conditional DAG nodes to model the execution of computational pipelines based on  context , while the stochasticity of DAG edges captures the uncertain nature of a system’s environment or the reliability of its hardware. Second, considering the pessimism of deterministic worst-case execution time (WCET), it uses  probability distributions  to model the execution times of subtasks (DAG nodes). We propose a new partitioning algorithm  Least Latency Partitioned (LLP) , which considers precedence constraints among nodes during the allocation process. Coupled with a scheduling algorithm that accounts for varying subtask criticality and constraints, the end-to-end latencies of safety-critical paths/nodes are then minimized. We use tasksets inspired by real robotics to demonstrate that our framework allows for efficient scheduling in complex computational pipelines, with more flexible representation of timing constraints, and ultimately, safety-performance tradeoffs.",
    "citation_count": "0",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Xuanliang Deng",
            "country": ""
        },
        {
            "name": "Ashrarul H. Sifat",
            "country": ""
        },
        {
            "name": "Shao-Yu Huang",
            "country": ""
        },
        {
            "name": "Sen Wang",
            "country": ""
        },
        {
            "name": "Jia-Bin Huang",
            "country": ""
        },
        {
            "name": "Changhee Jung",
            "country": ""
        },
        {
            "name": "Ryan Williams",
            "country": ""
        },
        {
            "name": "Haibo Zeng",
            "country": ""
        }
    ],
    "keywords": []
}