{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762112000586",
    "title": "Perceptual control architecture for cyber–physical systems in traffic incident management",
    "abstract": "Based on Perceptual Control Theory, we study the problem of unified modeling for incompatible approaches of Cyber–Physical Systems (CPSs). Inspired by the effective organization of living systems structure accommodating heterogeneous  information processing  and environmental interaction, we propose Perceptual Control Architecture of CPSs, and take Traffic Incident  Management systems  as the modeling research carrier. Throughout the structure of Traffic Incident Management systems, the hierarchical negative feedback is constituted by perceptual and behavioral loops to ensure a mechanism of intelligence behavior. The internal representation is categorized into two intelligent spaces: physical-reflex space and cyber-virtual space. In physical-reflex space, the sensing-actuation mapping of objective world is built, through four levels of distributed  traffic infrastructure . In cyber-virtual space, subjective decision using  Bayesian reasoning  network is defined by three levels: principles, interrelated factors and situation assessment. Through evaluation of field operation in Dalian, the Traffic Incident Management under the developed architecture shows a considerable reduction in  response time  as well as assessment inaccuracy. The test results explicated the effectiveness of the architecture on integrating complex Cyber–Physical functions. Besides transportation systems, the modeling approach could be a well-defined unified architecture applied to other CPSs.",
    "citation_count": "22",
    "year": "2012/11/01",
    "authors": [
        {
            "name": "Yaodong Wang",
            "country": ""
        },
        {
            "name": "Guozhen Tan",
            "country": ""
        },
        {
            "name": "Yuan Wang",
            "country": ""
        },
        {
            "name": "Yong Yin",
            "country": ""
        }
    ],
    "keywords": []
}