{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116300819",
    "title": "Preference-oriented fixed-priority scheduling for periodic real-time tasks",
    "abstract": "Traditionally, real-time scheduling algorithms prioritize tasks solely based on their timing parameters and cannot effectively handle tasks that have different  execution preferences . In this paper, for a set of periodic real-time tasks running on a single processor, where some tasks are preferably executed  as soon as possible (ASAP)  and others  as late as possible (ALAP) , we investigate  Preference-Oriented Fixed-Priority (POFP)  scheduling techniques. First, based on Audsley’s  Optimal Priority Assignment (OPA) , we study a  Preference Priority Assignment (PPA)  scheme that attempts to assign ALAP (ASAP) tasks lower (higher) priorities, whenever possible. Then, by considering the  non-work-conserving  strategy, we exploit the  promotion times  of ALAP tasks and devise an online dual-queue based POFP  scheduling algorithm . Basically, with the objective of fulfilling the execution preferences of all tasks, the POFP scheduler retains ALAP tasks in the  delay queue  until their promotion times while putting ASAP tasks into the  ready queue  right after their arrivals. In addition, to further expedite (delay) the executions of ASAP (ALAP) tasks using system slack, runtime techniques based on dummy and wrapper tasks are investigated. The proposed schemes are evaluated through extensive simulations. The results show that, compared to the classical fixed-priority  Rate Monotonic Scheduling  (RMS)  algorithm, the proposed priority assignment scheme and POFP scheduler can achieve significant improvement in terms of fulfilling the execution preferences of both ASAP and ALAP tasks, which can be further enhanced at runtime with the wrapper-task based slack management technique.",
    "citation_count": "18",
    "year": "2016/09/01",
    "authors": [
        {
            "name": "Rehana Begam",
            "country": ""
        },
        {
            "name": "Qin Xia",
            "country": ""
        },
        {
            "name": "Dakai Zhu",
            "country": ""
        },
        {
            "name": "Hakan Aydin",
            "country": ""
        }
    ],
    "keywords": []
}