{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001272",
    "title": "Resilient monitoring in self-adaptive systems through behavioral parameter estimation",
    "abstract": "Cyber-physical systems need self-adaptation as a mean to autonomously deal with changes. For runtime adaptation, a cyber-physical system repeatedly monitors the environment for detecting possible changes. Faults in the monitoring devices due to the dynamic and uncertain environment is very likely, necessitating resilient monitoring. In this paper, we discuss imperfect monitoring in self-adaptive systems, and propose a model-driven methodology to represent the self-adaptive system using a parametric  Markov decision process , where the changes are reflected by a set of model parameters. Fault in the monitoring device may result in some parameter valuation miss. We propose a comprehensive framework for parameter estimation using behavioral patterns of the system implemented by a pattern-matching component. The proposed method simulates the current behavior of the system using random walk patterns, and matches it to a history of patterns for estimating the valuation of the omitted data. The results show that the accuracy of the framework is evaluated about 96% under imperfect monitoring. In addition, we elaborate a set of theoretical proofs to support rigorous error analysis, and determine a certain upper-bound of errors to guarantee an accurate decision-making outcome. We establish a logical connection between the error and the accuracy of decisions, and introduce tolerable error metric that is used to guarantee the accuracy of decisions under estimation.",
    "citation_count": "3",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Mehran Alidoost Nia",
            "country": ""
        },
        {
            "name": "Mehdi Kargahi",
            "country": ""
        },
        {
            "name": "Alessandro Abate",
            "country": ""
        }
    ],
    "keywords": []
}