{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001169",
    "title": "Robust authenticated key agreement protocol for internet of vehicles-envisioned intelligent transportation system",
    "abstract": "Internet of Vehicles  (IoV) is a wireless network, which employs well-established  Internet protocols  and networks to  share information  between vehicles, people, and infrastructure by utilising Vehicular Adhoc Networks (VANETs). IoV aims to increase road user safety and lower accident rates. It is one of the main components of an  intelligent transportation system  (ITS). ITS appears as the most crucial component since the cities in any country are evolving into digital civilisations as a result of the  smart city concept , regardless of whether people are travelling within the city, to work, in school, or for other purposes. It can also be used to improve infrastructure utilisation and road safety (i.e., reduction in road accidents), in addition to enhancing traffic management and easing congestion. However, IoV-driven ITS is susceptible to several forms of attacks because of the insecure communication among the participating entities. We, therefore, propose a secure  authentication protocol  for IoV-driven ITS to stop these attacks from happening (in short, SAKP-ITS). Its resistance to a number of potential attacks is confirmed by the security analysis of the proposed SAKP-ITS. Additionally, SAKP-ITS is juxtaposed with other comparable competing methods  put out  in an IoV environment. Additionally, it has been found that SAKP-ITS outperforms competing schemes in terms of critical metrics like communication costs, computation costs, and security and functionality attributes. To test the effect of the proposed SAKP-ITS on the critical performance attributes, a practical implementation of SAKP-ITS is also presented.",
    "citation_count": "7",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Siddhant Thapliyal",
            "country": ""
        },
        {
            "name": "Mohammad Wazid",
            "country": ""
        },
        {
            "name": "D.P. Singh",
            "country": ""
        },
        {
            "name": "Ashok Kumar Das",
            "country": ""
        },
        {
            "name": "SK Hafizul Islam",
            "country": ""
        }
    ],
    "keywords": []
}