{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122001680",
    "title": "Root cause analysis of soft-error-induced failures from hardware and software perspectives",
    "abstract": "Because the dangers of soft errors are increasing with continued technology scaling, reliability against soft errors is becoming an important design concern for modern embedded systems. Various schemes have been proposed to protect embedded systems from the threat of soft errors, but they incur considerable overheads in terms of cost and performance. Selective protection techniques seem promising because they can achieve high levels of protection with low overhead. Though these techniques can be applied to any system, the most vulnerable parts must first be identified. We, therefore, present CFA, a comprehensive failure analysis framework that can analyze the vulnerability of microarchitectural components and software instructions through intensive  fault injection  campaigns. With CFA, we also explore the vulnerability of ten benchmarks from the MiBench benchmark suite. We found that protecting a part of the system heavily affects the reliability of the other parts. Therefore, all combinations of protection methods must be examined to present the most efficient and effective protection guidelines. Throughout the experiments, we observed that protection methods offered by single-perspective analyses are sub-optimal. On the other hand, CFA finds the optimal solution in every case, reducing the  AVF  of a system by up to 82% with minimal protection.",
    "citation_count": "3",
    "year": "2022/09/01",
    "authors": [
        {
            "name": "Jinhyo Jung",
            "country": ""
        },
        {
            "name": "Yohan Ko",
            "country": ""
        },
        {
            "name": "Hwisoo So",
            "country": ""
        },
        {
            "name": "Kyoungwoo Lee",
            "country": ""
        },
        {
            "name": "Aviral Shrivastava",
            "country": ""
        }
    ],
    "keywords": []
}