{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118304673",
    "title": "Scheduling multiple agile earth observation satellites with an edge computing framework and a constructive heuristic algorithm",
    "abstract": "The effective scheduling of multiple agile earth observation satellites plays a key role in improving the efficiency of the agile satellite observation system. Due to the complex constraints and large  solution space  (increases exponentially with the problem size), it has been a big challenge to effectively solve the multiple agile satellites scheduling problem. In this study, an  edge computing  framework is proposed in order to solve this problem in a flexible manner. In this framework, a central node and several edge nodes are included. The central node corresponds to the operation center of the satellite observation system while each edge node corresponds to an agile satellite. The central node filters tasks for edge nodes according to the time of  scheduling period  and visible time windows. Tasks in each edge node are scheduled according to the order of scheduling periods by a constructive  heuristic algorithm based  on the density of residual tasks (HADRT). The efficiency of this algorithm is proved. The time and space complexity are analyzed in detail. The proposed method is compared with other three advanced methods, and the experimental results show that HADRT could achieve higher  task completion rate  and reward rate than other algorithms with acceptable computing time.",
    "citation_count": "50",
    "year": "2019/05/01",
    "authors": [
        {
            "name": "Yongming He",
            "country": ""
        },
        {
            "name": "Yingwu Chen",
            "country": ""
        },
        {
            "name": "Jimin Lu",
            "country": ""
        },
        {
            "name": "Cheng Chen",
            "country": ""
        },
        {
            "name": "Guohua Wu",
            "country": ""
        }
    ],
    "keywords": []
}