{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001170",
    "title": "Scheduling energy consumption-constrained workflows in heterogeneous multi-processor embedded systems",
    "abstract": "Heterogeneous multi-processor architecture which achieves rich functionalities with different types of processors, is widely used to provide powerful calculating capability while keeping energy consumption under control. Although this architecture can improve system flexibility for adapting to future requirement variations, it results in a complex multi-task scheduling problem for system designers to produce a reasonable schedule that satisfies all deadline,  data dependency , and energy limitation constraints. In this paper, we concentrate on the energy consumption-constrained scheduling problem of workflows in heterogeneous multi-processor embedded systems. First, we model the workflows and energy consumption of processors, and formulate the energy consumption-constrained scheduling problem as an optimization one whose objective is to shorten the schedule length of workflows as much as possible. Then, with an improved energy per-assignment strategy, we propose a novel energy difference coefficient-based  scheduling algorithm  to produce an approximately  optimal allocation  of processors, frequencies, and start times for each task while guaranteeing that the data dependency and energy limitation constraints are satisfied. Finally, experiments on both randomly-generated and real-world workflows are conducted to verify the reliability and efficiency of the proposed approach.",
    "citation_count": "77",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Jinchao Chen",
            "country": ""
        },
        {
            "name": "Pengcheng Han",
            "country": ""
        },
        {
            "name": "Ying Zhang",
            "country": ""
        },
        {
            "name": "Tao You",
            "country": ""
        },
        {
            "name": "Pengyi Zheng",
            "country": ""
        }
    ],
    "keywords": []
}