{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117301467",
    "title": "Schedulability analysis and stack size minimization with preemption thresholds and mixed-criticality scheduling",
    "abstract": "Mixed-Criticality Scheduling (MCS) is an effective approach to addressing certification requirements of safety-critical Cyber-Physical Systems that integrate multiple subsystems with different levels of criticality in application domains such as avionics and  automotive systems . Although MCS was originally proposed in the context of safety-critical avionics applications, it is also finding its way into the automotive domain which faces intense cost-cutting pressure in today’s hyper-competitive market, so it is important to minimize  hardware costs  by adopting low-cost processors with limited processing and memory resources. Preemption Threshold Scheduling (PTS) is a well-known technique for controlling the degree of preemption in real-time scheduling, with benefits of reduced stack size and reduced number of preemptions compared to fully-preemptive scheduling. We present  schedulability analysis  to enable integration of PTS with MCS, including two variants PT-rtb and PT-max, in order to reduce application stack space requirement, and enable  efficient implementation  of MCS on resource-constrained embedded platforms. We also integrate our schedulability tests with priority and preemption threshold assignment algorithms, to have a complete solution for analysis and synthesis of mixed-criticality systems. Performance evaluation illustrates the benefits of our approach in terms of increased schedulability and reduced stack requirement.",
    "citation_count": "49",
    "year": "2018/02/01",
    "authors": [
        {
            "name": "Qingling Zhao",
            "country": ""
        },
        {
            "name": "Zonghua Gu",
            "country": ""
        },
        {
            "name": "Haibo Zeng",
            "country": ""
        },
        {
            "name": "Nenggan Zheng",
            "country": ""
        }
    ],
    "keywords": []
}