{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001327",
    "title": "Secure auditing and deduplication with efficient ownership management for cloud storage",
    "abstract": "More and more users opt to outsource their data to the cloud due to its popularity, which also brings some problems. One is that users cannot know whether the data stored in the cloud is intact since they no longer have physical control over it. The other is that the data stored in the cloud are often duplicated, which clearly wastes cloud storage resources. To solve the above problems, cloud auditing technology and secure  deduplication  technology have been widely studied. Furthermore, cloud auditing schemes supporting secure deduplication have also been proposed. However, data ownership management is rarely considered in these schemes. Once the data ownership changes, the revoked user should not be able to obtain the original  ciphertext  stored in the cloud to recover the original data. To solve this problem, we propose a cloud auditing scheme that supports cross-user secure deduplication with efficient data ownership management. We design a lazy update strategy to reduce update frequency and delegate the update task to the cloud, which greatly reduces the computing cost of ownership management. When the data ownership changes, the cloud does not need to update the original  ciphertext  immediately. It will decide whether to update the original ciphertext based on the value of a preset flag. Experimental results and the security analysis demonstrate the effectiveness and security of the proposed scheme.",
    "citation_count": "18",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Min Wang",
            "country": ""
        },
        {
            "name": "Lujun Xu",
            "country": ""
        },
        {
            "name": "Rong Hao",
            "country": ""
        },
        {
            "name": "Ming Yang",
            "country": ""
        }
    ],
    "keywords": []
}