{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001661",
    "title": "Secure boot, trusted boot and remote attestation for ARM TrustZone-based IoT Nodes",
    "abstract": "With the extensive application of  IoT  techniques,  IoT  devices have become ubiquitous in daily lives. Meanwhile, attacks against  IoT  devices have emerged to compromise  IoT devices  by tampering with system pre-installed programs or injecting new  malware . To mitigate these attacks, integrity enforcement of IoT systems has been proposed. The integrity of an IoT device system includes load-time integrity and runtime integrity. In this paper, we design an IoT system based on ARM TrustZone to enforce the system integrity. First, we establish the root of trust and propose a hybrid booting approach consisting of both secure boot and trusted boot to enforce the system load-time integrity. Second, we investigate a paging-based process  integrity measurement  method to measure the NW processes and conduct remote attestation based on the measurement results ensuring the NW runtime process integrity. We implement an IoT prototype system on a NXP i.MX6Q SABRE SD development board to assess its feasibility. Real-world experiment results demonstrate that our prototype introduces negligible performance overhead to the original system.",
    "citation_count": "35",
    "year": "2021/10/01",
    "authors": [
        {
            "name": "Zhen Ling",
            "country": ""
        },
        {
            "name": "Huaiyu Yan",
            "country": ""
        },
        {
            "name": "Xinhui Shao",
            "country": ""
        },
        {
            "name": "Junzhou Luo",
            "country": ""
        },
        {
            "name": "Yiling Xu",
            "country": ""
        },
        {
            "name": "Bryan Pearson",
            "country": ""
        },
        {
            "name": "Xinwen Fu",
            "country": ""
        }
    ],
    "keywords": []
}