{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002879",
    "title": "Smart contract-based security architecture for collaborative services in municipal smart cities",
    "abstract": "The Internet of Things (IoT) can provide intelligent and effective solutions to various applications with higher accuracy that requires less or no human intervention. Smart Cities are one of the significant applications of the IoT comprising a collection of various services such as intelligent transportation, waste management, smart homes, etc. These heterogeneous services offer a wide range of collaborative applications in smart cities. A smart municipality in a smart city is a concept in which a digital municipal corporation is developed to provide comprehensive local government collaboration services based on digitization and automation aiming towards raising the living standards of citizens. Interoperability between heterogeneous services for collaborative tasks creates challenges for data security and privacy. Ensuring integrity and confidentiality of information is critical, and reliable data is essential to both the government and its citizens. In this paper, we proposed a service security architecture based on authentication and authorization for constrained environments during collaborative tasks for Software Defined Networking (SDN) and smart contract-enabled municipal smart cities. The proposed collaborative service security framework is being tested on the Multichain Blockchain networks. We present a novel method for using smart contracts in multichain blockchains for data security during collaborative tasks in smart city municipal architecture. The proposed security solution is based on the dynamism of smart contracts to govern and control all interactions and transactions securely between different heterogeneous IoT networks. We implemented a supportive use case for collaborative services in an SDN-enabled IoT architecture to evaluate the feasibility of the proposed service security architecture.",
    "citation_count": "0",
    "year": "2023/02/01",
    "authors": [
        {
            "name": "Shahbaz Siddiqui",
            "country": ""
        },
        {
            "name": "Sufian Hameed",
            "country": ""
        },
        {
            "name": "Syed Attique Shah",
            "country": ""
        },
        {
            "name": "Abdul Kareem Khan",
            "country": ""
        },
        {
            "name": "Adel Aneiba",
            "country": ""
        }
    ],
    "keywords": []
}