{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117304563",
    "title": "Soft error-aware energy-efficient task scheduling for workflow applications in DVFS-enabled cloud",
    "abstract": "Dynamic Voltage and Frequency Scaling  (DVFS) has been widely used as a promising power management method to reduce the energy consumption of cloud workflows. However, due to the increasing chip density, lowering CPU voltages improperly in cloud  data centers  may inevitably increase soft error rate during  workflow execution . Consequently, failures of timely completion of  workflow applications  may often take place, which raises serious concerns during the  operation and maintenance  of cloud  data centers . To address such a problem, this paper proposes a soft error-aware energy-efficient  task scheduling  approach for workflow applications in DVFS-enabled cloud data centers. Under reliability and completion time constraints requested by tenants, our approach can generate energy-efficient task schedules for workflows by allocating tasks to appropriate virtual machines with specific operating frequencies. Comprehensive experiments on various well-known scientific workflow benchmarks show the effectivenss of our approach. Compared with state-of-the-art methods, our approach can achieve more than 30%  energy savings  while satisfying both reliability and completion time requirements.",
    "citation_count": "62",
    "year": "2018/03/01",
    "authors": [
        {
            "name": "Tingming Wu",
            "country": ""
        },
        {
            "name": "Haifeng Gu",
            "country": ""
        },
        {
            "name": "Junlong Zhou",
            "country": ""
        },
        {
            "name": "Tongquan Wei",
            "country": ""
        },
        {
            "name": "Xiao Liu",
            "country": ""
        },
        {
            "name": "Mingsong Chen",
            "country": ""
        }
    ],
    "keywords": []
}