{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002466",
    "title": "Specification of schedulability assumptions to leverage multiprocessor Analysis",
    "abstract": "In order to ease the early verification of uniprocessor real-time systems, the tool  Cheddar  provides a service that guarantees the applicability of a schedulability analysis method for a given architecture model. This verification service uses a catalog of design patterns. In this article, we propose to extend these patterns to multiprocessor architectures. Designing such extension is a challenge because the knowledge of both the software and the hardware architectures are essential to decide on the schedulability of a task set in that context. Indeed, parallel execution of tasks involves hardware resource sharing, that has in turn an effect on the task execution times. Currently, no general method is able to assess the schedulability of a high-performance multicore system with a limited level of pessimism, except if assumptions or usage restrictions are set to simplify the system analysis. So, the research community is developing multiple schedulability tests based on various assumptions which constrain the task models and their execution platforms. In this article, we propose a framework based on  Prolog  that allows engineers to verify the conditions to apply a test are met.  Prolog  facts model the software and hardware architecture, and the inference engine checks whether these facts conform to a design pattern associated to a given verification method. The design pattern compliance framework is integrated with the Cheddar tool. Three examples of multiprocessor analyses illustrate the proposal. A scalability analysis shows the tool is able to verify the compliance of architectures composed of 600 tasks and 60 cores, in less than  140 s  on a desktop computer.",
    "citation_count": "0",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Stéphane Rubini",
            "country": ""
        },
        {
            "name": "Valérie-Anne Nicolas",
            "country": ""
        },
        {
            "name": "Frank Singhoff",
            "country": ""
        },
        {
            "name": "Alain Plantec",
            "country": ""
        },
        {
            "name": "Hai Nam Tran",
            "country": ""
        },
        {
            "name": "Pierre Dissaux",
            "country": ""
        }
    ],
    "keywords": []
}