{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302910",
    "title": "SVM-based real-time hyperspectral image classifier on a manycore architecture",
    "abstract": "This paper presents a study of the design space of a Support Vector Machine (SVM) classifier with a linear kernel running on a manycore MPPA (Massively Parallel Processor Array) platform. This architecture gathers 256 cores distributed in 16 clusters working in parallel. This study aims at implementing a real-time hyperspectral SVM classifier, where real-time is defined as the time required to capture a hyperspectral image. To do so, two aspects of the SVM classifier have been analyzed: the classification algorithm and the system parallelization. On the one hand, concerning the classification algorithm, first, the classification model has been optimized to fit into the MPPA structure and, secondly, a probability estimation stage has been included to refine the classification results. On the other hand, the system parallelization has been divided into two levels: first, the parallelism of the classification has been exploited taking advantage of the pixel-wise classification methodology supported by the SVM algorithm and, secondly, a double-buffer communication procedure has been implemented to parallelize the image transmission and the cluster classification stages. Experimenting with medical images, an average speedup of 9 has been obtained using a single-cluster and double-buffer implementation with 16 cores working in parallel. As a result, a system whose processing time linearly grows with the number of pixels composing the scene has been implemented. Specifically, only 3 µs are required to process each pixel within the captured scene independently from the spatial resolution of the image.",
    "citation_count": "28",
    "year": "2017/10/01",
    "authors": [
        {
            "name": "D. Madroñal",
            "country": ""
        },
        {
            "name": "R. Lazcano",
            "country": ""
        },
        {
            "name": "R. Salvador",
            "country": ""
        },
        {
            "name": "H. Fabelo",
            "country": ""
        },
        {
            "name": "S. Ortega",
            "country": ""
        },
        {
            "name": "G.M. Callico",
            "country": ""
        },
        {
            "name": "E. Juarez",
            "country": ""
        },
        {
            "name": "C. Sanz",
            "country": ""
        }
    ],
    "keywords": []
}