{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120300722",
    "title": "Task allocation algorithm and optimization model on edge collaboration",
    "abstract": "This paper investigates a  mobile edge computing  environment for video analysis tasks where edge nodes provide their computation capacities to process the computation intensive tasks submitted by end users. First, we introduce a  Cloudlet  Assisted Cooperative Task Assignment (CACTA) system that organizes edge nodes that are geographically close to an end user into a cluster to collaboratively work on the user’s tasks. It is challenging for the system to find an  optimal strategy  that assigns workload to edge nodes to meet the user’s optimization goal. To address the challenge, this paper proposes multiple algorithms for different situations. Firstly, considering the situation that  historical data  cannot be obtained, a multi-round allocation algorithm based on EMA prediction is proposed, and the experimental results prove the efficiency and necessity of multiple rounds of transmission. To address the second case of obtaining historical data, this paper introduces a prediction-based dynamic task assignment algorithm that assigns workload to edge nodes in each time slot based on the prediction of their capacities/costs and an empirical  optimal allocation  strategy which is learned from an offline optimal solution from historical data. Experimental results demonstrate that our proposed algorithm achieves significantly higher performance than several other algorithms, and especially its performance is very close to that of an offline optimal solution. Finally, we propose an online task assignment algorithm based on Q-learning, which uses the model-free Q-learning algorithm to actively learn the allocation strategy of the system, and the experimental results verify the superiority and effectiveness of this algorithm.",
    "citation_count": "70",
    "year": "2020/11/01",
    "authors": [
        {
            "name": "Xiaoheng Deng",
            "country": ""
        },
        {
            "name": "Jun Li",
            "country": ""
        },
        {
            "name": "Enlu Liu",
            "country": ""
        },
        {
            "name": "Honggang Zhang",
            "country": ""
        }
    ],
    "keywords": []
}