{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762119300724",
    "title": "The power impact of hardware and software actuators on self-adaptable many-core systems",
    "abstract": "Many-core systems rely on the advantages of the latest  Complementary Metal Oxide Semiconductor  (CMOS) technologies to increase the number of cores. However, this improvement comes at the cost of higher  power dissipation , which prevents full use of the chip. To continue improving performance on future many-core systems, Resource Management (RM) becomes imperative to handle multi-objective and conflicting requirements such as power, performance, resilience, among others. In this task, RM can use both hardware (e.g., dynamic voltage and frequency scaling) and software actuators (e.g., task remapping). However, the complexity of synchronizing available actuators to follow a particular goal while avoiding  actuation  overlapping is a remaining challenge. This paper evaluates the power impact of each actuator and provides insights that will help engineers develop appropriate resource management heuristics to improve self-adaptable many-core systems. A state-of-the-art comparison shows that no related work provides or details the same comprehensiveness of actuation methods concerning  power consumption . Our proposal is validated in a many-core system described in a true clock-cycle accurate model. Regarding hardware actuators, the results show the power profiling at the core level and detail the contribution of each hardware component. Furthermore, results of software actuators evidence that task events present a more significant power impact on the ratio of active and idle cores changes.",
    "citation_count": "1",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "André Luís del Mestre Martins",
            "country": ""
        },
        {
            "name": "Rafael Garibotti",
            "country": ""
        },
        {
            "name": "Nikil Dutt",
            "country": ""
        },
        {
            "name": "Fernando Gehm Moraes",
            "country": ""
        }
    ],
    "keywords": []
}