{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000783",
    "title": "The effects of audiovisual landmarks on spatial learning and recalling for image browsing interface in virtual environments",
    "abstract": "To allow more accurate and efficient browsing performance, existing works showed that visual landmarks (e.g.3D pins) can facilitate spatial learning and recalling of browsing performance in Virtual Reality (VR). Compared with visual cues, the additional auditory cue is well known to provide benefits of navigational performance in virtual environments. However, less is known about the effects of such audiovisual landmarks on facilitating spatial learning and recalling for VR browsing interfaces. In this work, we followed and extended our previous work to further investigate this study (no landmark (N), 3D visual pin (V)), and newly implemented another two types of landmark interfaces, including spatial auditory landmark (S) and spatial audiovisual landmark (SV) in VR. We examined their effects on facilitating learning and recalling items’ locations in small and large item sets in these four interfaces. We found that three landmark interfaces outperform no landmark in terms efficiency, and the participants performed the best with audiovisual landmark interface, however, no significant difference of retrieval and recall performances between the visual and the audio interfaces. The findings provide the suggestion of enabling audiovisual landmarks for VR browsing interfaces.",
    "citation_count": "8",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "BoYu Gao",
            "country": ""
        },
        {
            "name": "Zhiguo Chen",
            "country": ""
        },
        {
            "name": "Xian Chen",
            "country": ""
        },
        {
            "name": "Huawei Tu",
            "country": ""
        },
        {
            "name": "Feiran Huang",
            "country": ""
        }
    ],
    "keywords": []
}