{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212030179X",
    "title": "TOPSIS inspired Budget and Deadline Aware Multi-Workflow Scheduling for Cloud computing",
    "abstract": "Scheduling is a decision-making mechanism that allows resource sharing among several activities by determining their order of execution on the available resources. In the heterogeneous distributed systems, it is a great challenge to schedule concurrent workflows submitted by different users at different times. Scheduling with deadline and budget constraints are becoming an even more challenging issue for  cloud systems  due to the cloud dynamics such as on-demand provisioning, elasticity, abundant resource types, and various pricing schemes. A well-managed budget and deadline constraint scheduling is required to optimize the  system performance  and end-user satisfaction. Hence, improving system performance and optimizing multiple scheduling criteria at the same time is a big challenge. To address these issues, a novel multi-workflow  scheduling algorithm  based on the Multi-Criteria Decision Making (MCDM) approach, TOPSIS (Technique of  Order Preference  by Similarity to Ideal Solution) is presented. A weighted sum of run time, cost and  data transfer  time are used to determine the optimal resource among the available resources in accordance with the task requirements. The performance of the proposed algorithm is compared with the state-of-the-art algorithms such as Budget-Heterogeneous Earliest Finish Time (BHEFT), Budget and Deadline Constraint Heterogeneous Earliest Finish Time (BDHEFT) and Cloud-based Workflow Scheduling Algorithm (CWSA) algorithms based on budget constraint,deadline constraint, and  resource utilization . The experimental results demonstrate that the proposed T-BDMWS outperforms current state-of-the-art heuristics with the criteria of achieving the user-specified budget or deadline constraints and resource efficiency.",
    "citation_count": "40",
    "year": "2021/03/01",
    "authors": [
        {
            "name": "Koneti Kalyan Chakravarthi",
            "country": ""
        },
        {
            "name": "L. Shyamala",
            "country": ""
        }
    ],
    "keywords": []
}