{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212100206X",
    "title": "Towards functional safety compliance of matrix–matrix multiplication for machine learning-based autonomous systems",
    "abstract": "Autonomous systems  execute complex tasks to perceive the environment and take self-aware decisions with limited  human interaction . This autonomy is commonly achieved with the support of  machine learning algorithms . The nature of these algorithms, that need to process large data volumes, poses high-performance demands on the underlying hardware. As a result, the embedded critical real-time domain is adopting increasingly powerful processors that combine multi-core processors with accelerators such as  GPUs . The resulting hardware and software complexity makes it difficult to demonstrate that the system will run safely and reliably. This is the main objective of  functional safety  standards, such as IEC 61508 or ISO 26262, that deal with the avoidance, detection and control of hardware or software errors. In this paper, we adopt those measures for the safe inference of  machine learning  libraries on multi-core devices, two topics that are not explicitly covered in the current version of standards. To this end, we adapt the matrix-matrix multiplication function, a central element of existing machine learning libraries, according to the recommendations of functional  safety standards . The  paper makes  the following contributions: (i) adoption of recommended programming practices for the avoidance of programming errors in the matrix-matrix multiplication, (ii) inclusion of diagnostic mechanisms based on widely used checksums to control runtime errors, and (iii) evaluation of the impact of previous measures in terms of performance and a quantification of the achieved  diagnostic coverage . For this purpose, we implement the diagnostic mechanisms on one of the ARM R5 cores of a Zynq UltraScale+ multi-processor system-on-chip and we then adapt them to an Intel i7 processor with native code employing  vectorization  for the sake of performance.",
    "citation_count": "11",
    "year": "2021/12/01",
    "authors": [
        {
            "name": "Javier Fernández",
            "country": ""
        },
        {
            "name": "Jon Perez",
            "country": ""
        },
        {
            "name": "Irune Agirre",
            "country": ""
        },
        {
            "name": "Imanol Allende",
            "country": ""
        },
        {
            "name": "Jaume Abella",
            "country": ""
        },
        {
            "name": "Francisco J. Cazorla",
            "country": ""
        }
    ],
    "keywords": []
}