{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000633",
    "title": "Verifiable decentralized identity-based meta-computing in Industrial Internet of Things (IIoT)",
    "abstract": "Meta-computing in Industrial Internet of Things (IIoT) has triggered a dramatic advance due to the gigantic supports of computation power for processing complex IIoT tasks. However, users identities are encountering security and verification issues since emerging threats derive from dynamic inter-operations in the cross-organization context. Even though blockchain-based Decentralized Identity (DID) is an alternative for offering a strengthened identity governance, current verifiability of DID documents still encounters vulnerabilities due to the involvement of the less trustful third parties that maintain the storage of binding relationships between DID identifiers and public keys. In this paper, we propose a novel  V erifiable and  S earchable  D ecentralized  I dentity (VS-DID)  model. We focus on the verifiability of DID documents and propose a verifiable registry scheme that ensures verifiable binding relationships. In order to enable efficient queries in large-scale users’ identities in meta-computing IIoT, we develop an on-chain-off-chain query strategy that adopts a slide window accumulator. The experimental results show that our scheme reduces aggregate proof time and commitment time by 93.5% and 96.5%, respectively, compared to the Merkle SNARK scheme, while maintaining reasonable verification time, significantly improving the efficiency of DID registry in large-scale IIoT environments.",
    "citation_count": "0",
    "year": "2025/05/01",
    "authors": [
        {
            "name": "Kai Ding",
            "country": ""
        },
        {
            "name": "Tianxiu Xie",
            "country": ""
        },
        {
            "name": "Keke Gai",
            "country": ""
        },
        {
            "name": "Chennan Guo",
            "country": ""
        },
        {
            "name": "Liangqi Lei",
            "country": ""
        },
        {
            "name": "Dongjue Wang",
            "country": ""
        },
        {
            "name": "Jing Yu",
            "country": ""
        },
        {
            "name": "Liehuang Zhu",
            "country": ""
        },
        {
            "name": "Weizhi Meng",
            "country": ""
        }
    ],
    "keywords": []
}