{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124002261",
    "title": "Verifiable privacy-preserving semantic retrieval scheme in the edge computing",
    "abstract": "Edge computing, with its characteristics of low latency and low transmission costs, addresses the storage and computation challenges arising from the surge in network edge traffic. It enables users to leverage nearby edge servers for data outsourcing and retrieval. However, data outsourcing poses risks to data privacy. Although searchable encryption is proposed to secure search of outsourced data, existing schemes generally cannot meet the requirements of semantic search, and they also exhibit security risks and incur high search costs. In addition, edge servers may engage in malicious activities such as data tampering or forgery. Therefore, we propose a verifiable privacy-preserving semantic retrieval scheme named VPSR suitable for edge computing environments. We utilize the Doc2Vec method to extract text feature vectors and then convert them into matrix form to reduce storage space requirements for indexes, queries, and keys. We encrypt matrices using an improved secure k-nearest neighbor (kNN) algorithm based on learning with errors (LWE) and calculate text similarity by solving the Hadamard product between matrices. Additionally, we design an aggregable signature scheme and offload part of the result verification tasks to edge servers. Security and performance analysis results demonstrate that the VPSR scheme is suitable for edge computing environments with high encryption and search efficiency and low storage cost while ensuring security.",
    "citation_count": "0",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Jiaqi Guo",
            "country": ""
        },
        {
            "name": "Cong Tian",
            "country": ""
        },
        {
            "name": "Qiang He",
            "country": ""
        },
        {
            "name": "Liang Zhao",
            "country": ""
        },
        {
            "name": "Zhenhua Duan",
            "country": ""
        }
    ],
    "keywords": []
}