{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01055-0",
    "title": "Airline capacity distribution under financial budget and resource consideration",
    "abstract": "Capacity distribution is a challenging issue for an airline under financial budget and resource consideration. It is a large-scale optimization problem covering both long-term planning and short-term operating arrangements. This study investigates on the airline capacity distribution problem with financial budget and resource consideration. It contains subproblems of financial budget arrangement, fleet introduction, and fleet assignment. Among them, financial budget is arranged in multiple decision periods, fleet introduction is decided under fixed time points, while fleet assignment is decided under all available time points. To tackle this problem, an integer programming model is formulated for descriptions. Then, an integrated algorithm of modified Variable Neighborhood Search (VNS) and Branch-and-bound (B&amp;B) strategy is developed to find solutions. In detail, a greedy heuristic approach is utilized to generate an initial solution for fleet introduction, the modified B&amp;B strategy is utilized to generate the optimal solution for fleet assignment and the modified VNS is applied to update current solution for a new one with better quality. In addition, budget limit checks are added for financial budget arrangements. Finally, the hybrid algorithm is tested on efficiency and stability. It is also compared to other algorithms which replace the modified VNS by basic VNS, differential evolution and genetic algorithm. Computational results show that performance of our approach is powerful in terms of objective value, convergence speed and stability.",
    "citation_count": 37,
    "year": "2023/07",
    "authors": [
        {
            "name": "Zhou, Jing",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}