{
    "url": "https://link.springer.com/article/10.1007/s10878-025-01279-2",
    "title": "An improved approximation algorithm for covering vertices by $$4^+$$ -paths",
    "abstract": "Path cover is one of the well-known NP-hard problems that has received much attention. In this paper, we study a variant of path cover, denoted by $$\\hbox {MPC}^{{4}+}_v$$ , to cover as many vertices in a given graph $$G = (V, E)$$ as possible by a collection of vertex-disjoint paths each of order four or above. The problem admits an existing $$O(|V|^8)$$ -time 2-approximation algorithm by applying several time-consuming local improvement operations (Gong et al.: Proceedings of MFCS 2022, LIPIcs 241, pp 53:1–53:14, 2022). In contrast, our new algorithm uses a completely different method and it is an improved $$O(\\min \\{|E|^2|V|^2, |V|^5\\})$$ -time 1.874-approximation algorithm, which answers the open question in Gong et al. (2022) in the affirmative. An important observation leading to the improvement is that the number of vertices in a maximum matching M of G is relatively large compared to that in an optimal solution of $$\\hbox {MPC}^{{4}+}_v$$ . Our new algorithm forms a feasible solution of $$\\hbox {MPC}^{{4}+}_v$$ from a maximum matching M by computing a maximum-weight path-cycle cover in an auxiliary graph to connect as many edges in M as possible.",
    "citation_count": 16,
    "year": "2025/04",
    "authors": [
        {
            "name": "Gong, Mingyang",
            "country": "Canada"
        },
        {
            "name": "Chen, Zhi-Zhong",
            "country": "Japan"
        },
        {
            "name": "Lin, Guohui",
            "country": "Canada"
        },
        {
            "name": "Wang, Lusheng",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}