{
    "url": "https://link.springer.com/article/10.1007/s10878-020-00531-1",
    "title": "An optimized approach of venous thrombus embolism risk assessment",
    "abstract": "In this paper, we aim to find new approaches to assess venous thrombus embolism (VTE) risk level. We have obtained valid data by filtering all data relevant to the VTE risk rating which was collected in Shanghai general hospital from May to July 2018. In our research, the distribution rule of the valid data was found and the differences of VTE risk scores before and after the surgery was analyzed via variance analysis. We also explored the correlation between the VTE risk score and inner diameter and flow rate of deep vein in lower extremities. Meanwhile, We build linear model, nonlinear model and ordered multinamial probit model to give out the VTE risk scores. After repeated test,it was concluded that the ordered multinamial probit model was the optimum way in the assessment of VTE risk scores. In short, this paper suggests that surgery has increased VTE risk level which is closely associated with inner diameter and flow rate of deep vein in lower extremities. By deploying ordered multinamial probit model, we are able to assess the VTE risk level. The paper is significant both in theory and the practical application of risk assessment,prevention and treatment of VTE and it is also a theoretical support in VTE risk forecasting for patients with operation in hospital.",
    "citation_count": 16,
    "year": "2021/11",
    "authors": [
        {
            "name": "Wang, Ruiping",
            "country": "China"
        },
        {
            "name": "Wang, Mei",
            "country": "China"
        },
        {
            "name": "Chang, Jian",
            "country": "China"
        },
        {
            "name": "Luo, Zai",
            "country": "China"
        },
        {
            "name": "Zhang, Feng",
            "country": "China"
        },
        {
            "name": "Huang, Chen",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}