{
    "url": "https://link.springer.com/article/10.1007/s10878-018-0255-0",
    "title": "Channel assignment problem and n-fold t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labeling of graphs",
    "abstract": "This paper considers the channel assignment problem in mobile communications systems. Suppose there are many base stations in an area, each of which demands a number of channels to transmit signals. The channels assigned to the same base station must be separated in some extension, and two channels assigned to two different stations that are within a distance must be separated in some other extension according to the distance between the two stations. The aim is to assign channels to stations so that the interference is controlled within an acceptable level and the spectrum of channels used is minimized. This channel assignment problem can be modeled as the multiple t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labeling of the interference graph. In this paper, we consider the case when all base stations demand the same number of channels. This case is referred as n-fold t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labeling of a graph. This paper first investigates the basic properties of n-fold t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labelings of graphs. And then it focuses on the special case when $$m=1$$ . The optimal n-fold t-separated L(j)-labelings of all complete graphs and almost all cycles are constructed. As a consequence, the optimal n-fold t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labelings of the triangular lattice and the square lattice are obtained for the case $$j_1=j_2=\\cdots =j_m$$ . This provides an optimal solution to the corresponding channel assignment problems with interference graphs being the triangular lattice and the square lattice, in which each base station demands a set of n channels that are t-separated and channels from two different stations at distance at most m must be $$j_1$$ -separated. We also study a variation of n-fold t-separated $$L(j_1,j_2,\\ldots ,j_m)$$ -labeling, namely, n-fold t-separated consecutive $$L(j_1,j_2,\\ldots ,j_m)$$ -labeling. And present the optimal n-fold t-separated consecutive L(j)-labelings of all complete graphs and cycles.",
    "citation_count": 23,
    "year": "2018/05",
    "authors": [
        {
            "name": "Lin, Wensong",
            "country": "People’s Republic of China"
        },
        {
            "name": "Shen, Chenli",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}