{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01039-0",
    "title": "Demand forecasting and information sharing of a green supply chain considering data company",
    "abstract": "The effects of demand forecasting information (IDF) and information sharing on the pricing strategy and emission abatement decision-making in the green supply chain (GSC) are big concerns in this research. We consider a three-level GSC consisting of a data company (DC), a manufacturer and a retailer. DC can predict potential market demand and sell this information to the manufacturer as a product of data services. The manufacturer has the discretion to share IDF with a downstream retailer. By equilibrium analysis, we find that the manufacturer is reluctant to share IDF. When the information is not shared, the more accurate the IDF is, the more profits the manufacturer and DC will get, while the less profit the retailer will get. When information is shared, the profits of all participants increase with prediction accuracy. Moreover, the more accurate the prediction is, the higher the value that information sharing brings to the retailer, but the higher the loss of value to other supply chain members and the whole system. The supply chain system can always benefit from the IDF, which makes DC has the incentive to adopt scientific forecasting methods for demand forecasting in practice. Regarding emission abatement, we find that consumers’ preferences for green products always have a positive influence on the optimal decisions of GSC. Besides, the impacts do not depend on whether forecast information is shared. Thus, highlighting the low carbon preferences of consumers is crucial to the management decisions of the GSC in this paper.",
    "citation_count": 66,
    "year": "2023/07",
    "authors": [
        {
            "name": "Yang, Man",
            "country": "China"
        },
        {
            "name": "Zhang, Tao",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}