{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9925-3",
    "title": "Directed Steiner trees with diffusion costs",
    "abstract": "Given a directed arc-weighted graph G with n nodes, a root r and k terminals, the directed steiner tree problem (DST) consists in finding a minimum-weight tree rooted at r and spanning all the terminals. If this problem has several applications in multicast routing in packet switching networks, the modeling is not adapted anymore in networks based upon the circuit switching principle in which some nodes, called non diffusing nodes, are unable to duplicate packets. We define a more general problem, namely the directed steiner tree with a limited number of diffusing nodes (DSTLD), that enables us to model multicast in a network containing at most d diffusing nodes. We show that DSTLD is XP with respect to d, and use this result to build a $$\\left\\lceil \\frac{k-1}{d} \\right\\rceil $$ -approximation algorithm for DST that is XP in d. We deduce from that result a strong inapproximability property. In particular, we prove that, under the assumption that NP $$\\not \\subseteq $$ ZTIME $$[n^{\\log ^{O(1)}n}]$$ , there is no polynomial-time approximation algorithm for DSTLD with ratio $$\\varOmega \\left( \\frac{k}{d}\\right) $$ . We finally give an evaluation of performances of an exact algorithm dedicated to the case $$d \\le 3$$ .",
    "citation_count": 30,
    "year": "2016/11",
    "authors": [
        {
            "name": "Watel, Dimitri",
            "country": "France"
        },
        {
            "name": "Weisser, Marc-Antoine",
            "country": "France"
        },
        {
            "name": "Bentz, Cédric",
            "country": "France"
        },
        {
            "name": "Barth, Dominique",
            "country": "France"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}