{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01046-1",
    "title": "Fuzzy cleaner production in assembly flexible job-shop scheduling with machine breakdown and batch transportation: Lagrangian relaxation",
    "abstract": "In production scheduling with assembly operations, after processing jobs in the first stage, in the second one, assembly operations are performed. Making these two decisions is very important because optimizing the scheduling of jobs in one stage of production without considering the parameters and capacities of the next stage in the assembly stage will not guarantee the shortening of the total production time and the optimal use of machines. In this study, a mathematical model has been developed for a flexible job-shop scheduling problem with assembly operation. In the first stage, the scheduling is performed according to the job release times and machine breakdowns. Then, jobs enter the assembly stage in a flow-shop environment, and finally, the assembled products are sent to customers in batches. Here, three objective functions must be minimized simultaneously, including (i) the costs of tardiness, earliness, fuzzy transportation, and makespan, (ii) the fuzzy emission of CO2, and (iii) the noise pollution. In this research, after linearization of the proposed model, using the ε-constraint methods and Lagrangian relaxation algorithm, its complexity was reduced. The comparison results of the proposed algorithm and the model that was solved with the GAMS show that the Lagrangian relaxation algorithm is quite efficient.",
    "citation_count": 44,
    "year": "2023/07",
    "authors": [
        {
            "name": "Hajibabaei, M.",
            "country": "Iran"
        },
        {
            "name": "Behnamian, J.",
            "country": "Iran"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}