{
    "url": "https://link.springer.com/article/10.1007/s10878-013-9614-z",
    "title": "Generalized Canadian traveller problems",
    "abstract": "This study investigates a generalization of the Canadian Traveller Problem (CTP), which finds real applications in dynamic navigation systems used to avoid traffic congestion. Given a road network $$G=(V,E)$$ in which there is a source $$s$$ and a destination $$t$$ in $$V$$ , every edge $$e$$ in $$E$$ is associated with two possible distances: original $$d(e)$$ and jam $$d^+(e)$$ . A traveller only finds out which one of the two distances of an edge upon reaching an end vertex incident to the edge. The objective is to derive an adaptive strategy for travelling from $$s$$ to $$t$$ so that the competitive ratio, which compares the distance traversed with that of the static $$s,t$$ -shortest path in hindsight, is minimized. This problem was initiated by Papadimitriou and Yannakakis. They proved that it is PSPACE-complete to obtain an algorithm with a bounded competitive ratio. In this paper, we propose tight lower bounds of the problem when the number of ”traffic jams” is a given constant $$k$$ ; and we introduce a deterministic algorithm with a $$\\mathrm{min}\\{ r, 2k+1\\}$$ -ratio, which meets the proposed lower bound, where $$r$$ is the worst-case performance ratio. We also consider the Recoverable CTP, where each blocked edge is associated with a recovery time to reopen. Finally, we discuss the uniform jam cost model, i.e., for every edge $$e$$ , $$d^+(e) = d(e) + c$$ , for a constant $$c$$ .",
    "citation_count": 11,
    "year": "2015/05",
    "authors": [
        {
            "name": "Liao, Chung-Shou",
            "country": "Taiwan"
        },
        {
            "name": "Huang, Yamming",
            "country": "Taiwan"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}