{
    "url": "https://link.springer.com/article/10.1007/s10878-022-00913-7",
    "title": "Generalized opinion dynamics model for social trust networks",
    "abstract": "The study of opinion dynamics model on social networks is one of the hot spots in the field of social sciences. In this paper, we propose a generalized opinion dynamics model, which dynamically compute each person’s expressed opinion, to solve the opinion maximization problem for social trust networks. In the model, we propose a new, reasonable and interpretable confidence index $$\\alpha _i$$ , which is different from randomly selected $$\\alpha _i$$ and is determined by both person’s social status and the evaluation of his/her predecessors. By using the theory of diagonally dominant, we obtain the optimal analytic solution of the Nash equilibrium with maximum overall opinion. In addition, we design an efficient traditional ADMM algorithm with $$l_1$$ -regulations to maximize the overall opinion. A series of experiments are conducted, and the experimental results show that the proposed model is superior to the state-of-the-art in four datasets. The average benefit has promoted $$67.5\\%$$ , $$83.2\\%$$ , $$31.5\\%$$ , and $$33.7\\%$$ in solving the internal opinion problem and $$215.2\\%$$ , $$225.1\\%$$ , $$33.0\\%$$ , $$21.2\\%$$ in solving the expressed opinion problems on four datasets, respectively.",
    "citation_count": 26,
    "year": "2022/12",
    "authors": [
        {
            "name": "He, Changxiang",
            "country": "China"
        },
        {
            "name": "Zeng, Jiayuan",
            "country": "China"
        },
        {
            "name": "Zhang, Guang",
            "country": "China"
        },
        {
            "name": "Liu, Shuting",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}