{
    "url": "https://link.springer.com/article/10.1007/s10878-019-00482-2",
    "title": "Improved gray neural network model for healthcare waste recycling forecasting",
    "abstract": "This paper addresses the problem of predicting multiple factors of health care waste recycling for promoting the construction of ecological civilization against the background of a comprehensive implementation of the “healthy China” strategy. In this paper, an improved gray neural network model is developed for recovery prediction. The one order single variable gray model and triple exponential smoothing are used for predicting the factors affecting recovery. A particle swarm optimization optimized back propagation (BP) neural network is trained by selecting higher-prediction results by precision comparison, and the trained BP neural network is used to predict the recovery of health care waste. Taking Shanghai as an example, this paper uses the actual data about Shanghai health care waste during 2013–2017, and the historical data of 11 factors affecting the recovery amount; these are used for empirical analysis. The results of this research show that the gray neural network performs better than other benchmark models and traditional predictive models. An accurate prediction of the amount of health care waste recovered can help decision-makers to implement recycling, and can serve as a reference for governmental departments, helping them to formulate relevant laws and regulations, develop a variety of tasks, and rationally allocate resources.",
    "citation_count": 22,
    "year": "2021/11",
    "authors": [
        {
            "name": "Hao, Hao",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Ji",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Qian",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yao, Li",
            "country": "People’s Republic of China"
        },
        {
            "name": "Sun, Yichen",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}