{
    "url": "https://link.springer.com/article/10.1007/s10878-023-01048-z",
    "title": "Internet of things enabled privacy-conserving health record virtual sharing using jungle computing",
    "abstract": "In today's day and age, Internet Of Things data related to the patient's healthcare records maintenance is a critical process. With the proliferation of such a vast volume of data on healthcare, it becomes clear that the confidentiality and safety of this kind of confidential data on healthcare is a topic of more importance. Computer scientists and medical doctors are all worried about the security and privacy issues related to patients' healthcare data. This study of IoT-enabled Privacy-Conserving Health Record Virtual Sharing using Jungle computing addresses the various acts related to patients' healthcare data. Jungle computing supports a high level of heterogeneity as it includes various types of computing, such as grid, cloud, cluster, etc., to achieve maximum performance and minimum complexity.Thisstudy primarily reflects on the prevention methods currently in use or being developed for healthcare data security and privacy conservation techniques and the virtual sharing process and examined various research articles to explore the utilization of intelligent techniques in health systems of virtual sharing using jungle computing against security and privacy issues; the results of the proposed method show that The research suggested an IoT-enabled Privacy-Conserving process for storing and transferring highly protective Health records with 76.8% efficiency. The conservative privacy platform improves security based on identification, utility, data privacy, risk, reward, and security concerns accuracy by 47.98% higher than the existing processing schema. IoT-enabled privacy-conserving system is 45.7% efficient based on identification and security. IoT-enable privacy conserving system has the Training error detection by 73% more efficient than the existing system of probabilistic neural networks efficient.",
    "citation_count": 23,
    "year": "2023/07",
    "authors": [
        {
            "name": "Sivaparthipan, C. B.",
            "country": "India"
        },
        {
            "name": "Gnanasigamani, Lydia J.",
            "country": "India"
        },
        {
            "name": "Agrawal, Ruchi",
            "country": "India"
        },
        {
            "name": "Awaji, Bakri Hossain",
            "country": "Saudi Arabia"
        },
        {
            "name": "Sathyaprakash, P.",
            "country": "India"
        },
        {
            "name": "Jaber, Mustafa Musa",
            "country": "Iraq"
        },
        {
            "name": "Jumani, Awais Khan",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}