{
    "url": "https://link.springer.com/article/10.1007/s10878-020-00533-z",
    "title": "On the robustness of a synchronized multi-robot system",
    "abstract": "Area coverage and communication are fundamental concerns in networks of cooperating robots. The goal is to address the issue of how well a group of collaborating robots having a limited communication range is able to monitor a given geographical space. Typically, an area of interest is partitioned into smaller subareas, with each robot in charge of a given subarea. This gives rise to a communication network that allows robots to exchange information when they are sufficiently close to each other. To be effective, the system must be resilient, i.e., be able to recover from robot failures. In a recent paper Bereg et al. (J Comb Optim 36(2):365–391, 2018), the concept of k-resilience of a synchronized system was introduced as the cardinality of a smallest set of robots whose failure suffices to cause that at least k surviving robots operate without communication, thus entering a state of starvation. It was proven that the problem of computing the k-resilience is NP-hard in general. In this paper, we study several problems related to the resilience of a synchronized system with respect to coverage and communication on realistic topologies including grid and cycle configurations. The broadcasting resilience is the minimum number of robots whose removal may disconnect the network. The coverage resilience is the minimum number of robots whose removal may result in a non-covered subarea. We prove that the three resilience measures can be efficiently computed for these configurations.",
    "citation_count": 28,
    "year": "2020/05",
    "authors": [
        {
            "name": "Bereg, Sergey",
            "country": "USA"
        },
        {
            "name": "Brunner, Andrew",
            "country": "USA"
        },
        {
            "name": "Caraballo, Luis-Evaristo",
            "country": "Spain"
        },
        {
            "name": "Díaz-Báñez, José-Miguel",
            "country": "Spain"
        },
        {
            "name": "Lopez, Mario A.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}