{
    "url": "https://link.springer.com/article/10.1007/s10878-011-9405-3",
    "title": "On the fractionality of the path packing problem",
    "abstract": "Given an undirected graph G=(N,E), a subset T of its nodes and an undirected graph (T,S), G and (T,S) together are often called a network. A&nbsp;collection of paths in G whose end-pairs lie in S is called an integer multiflow. When these paths are allowed to have fractional weight, under the constraint that the total weight of the paths traversing a single edge does not exceed 1, we have a fractional multiflow in G. The problems of finding the maximum weight of paths with end-pairs in S over all fractional multiflows in G is called the fractional path packing problem. In 1989, A. Karzanov had defined the fractionality of the fractional path packing problem for a class of networks {G,(T,S)} as the smallest natural D such that for any network from the class, the fractional path packing problem has a solution which becomes integer-valued when multiplied by D (see A.&nbsp;Karzanov in Linear Algebra Appl. 114–115:293–328, 1989). He proved that the fractional path packing problem has infinite fractionality outside a very specific class of networks, and conjectured that within this class, the fractionality does not exceed 4. A.&nbsp;Karzanov also proved that the fractionality of the path packing problem is at most 8 by studying the fractionality of the dual problem. Special cases of Karzanov’s conjecture were proved in or are implied by the works of L.R.&nbsp;Ford and D.R.&nbsp;Fulkerson, Y.&nbsp;Dinitz, T.C.&nbsp;Hu, B.V.&nbsp;Cherkassky, L.&nbsp;Lovãsz and H.&nbsp;Hirai. We prove Karzanov’s conjecture by showing that the fractionality of the path packing problem is at most 4. Our proof is stand-alone and does not rely on Karzanov’s results.",
    "citation_count": 15,
    "year": "2012/11",
    "authors": [
        {
            "name": "Vanetik, Natalia",
            "country": "Israel"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}