{
    "url": "https://link.springer.com/article/10.1007/s10878-007-9043-y",
    "title": "Online bin packing of fragile objects with application in cellular networks",
    "abstract": "We study a specific bin packing problem which arises from the channel assignment problems in cellular networks. In cellular communications, frequency channels are some limited resource which may need to share by various users. However, in order to avoid signal interference among users, a user needs to specify to share the channel with at most how many other users, depending on the user’s application. Under this setting, the problem of minimizing the total channels used to support all users can be modeled as a specific bin packing problem as follows: Given a set of items, each with two attributes, weight and fragility. We need to pack the items into bins such that, for each bin, the sum of weight in the bin must be at most the smallest fragility of all the items packed into the bin. The goal is to minimize the total number of bins (i.e., the channels in the cellular network) used. We consider the on-line version of this problem, where items arrive one by one. The next item arrives only after the current item has been packed, and the decision cannot be changed. We show that the asymptotic competitive ratio is at least 2. We also consider the case where the ratio of maximum fragility and minimum fragility is bounded by a constant. In this case, we present a class of online algorithms with asymptotic competitive ratio at most of 1/4+3r/2, for any r&gt;1.",
    "citation_count": 9,
    "year": "2007/11",
    "authors": [
        {
            "name": "Chan, Wun-Tat",
            "country": "UK"
        },
        {
            "name": "Chin, Francis Y.-L.",
            "country": "Hong Kong"
        },
        {
            "name": "Ye, Deshi",
            "country": "China"
        },
        {
            "name": "Zhang, Guochuan",
            "country": "China"
        },
        {
            "name": "Zhang, Yong",
            "country": "Hong Kong"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}