{
    "url": "https://link.springer.com/article/10.1007/s10878-017-0144-y",
    "title": "Online set multicover algorithms for dynamic D2D communications",
    "abstract": "Motivated by the dynamic resource allocation problem for device-to-device (D2D) communications, we study the online set multicover problem (OSMC). In the online set multicover, the set X of elements to be covered is unknown in advance; furthermore, the coverage requirement of each element $$x \\in X$$ is initially unknown. Elements of X together with coverage requirements are presented one at a time in an online fashion; and a feasible solution must be maintained at all times. We provide the first deterministic, online algorithms for OSMC with competitive ratios. We consider two versions of OSMC; in the first, each set may be picked only once, while the second version allows each set to be picked multiple times. For both versions, we present the first deterministic, online algorithms, with competitive ratios $$O( \\log n \\log m )$$ and $$O( \\log n (\\log m + \\log k) )$$ , repectively, where n is the number of elements, m is the number of sets, and k is the maximum coverage requirement. By simulation, we show the efficacy of these algorithms for resource allocation in the D2D setting by analyzing network throughput and other metrics, obtaining a large improvement in running time over offline methods.",
    "citation_count": 19,
    "year": "2017/11",
    "authors": [
        {
            "name": "Kuhnle, Alan",
            "country": "USA"
        },
        {
            "name": "Li, Xiang",
            "country": "USA"
        },
        {
            "name": "Smith, J. David",
            "country": "USA"
        },
        {
            "name": "Thai, My T.",
            "country": "Vietnam"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}