{
    "url": "https://link.springer.com/article/10.1007/s10878-022-00910-w",
    "title": "Optimal dynamic mining policy of blockchain selfish mining through sensitivity-based optimization",
    "abstract": "The security and fairness of blockchain are always threatened by selfish mining attacks. To study such selfish mining attacks, some necessary and useful methods need to be developed sufficiently. In this paper, we provide an interesting method for analyzing dynamic decision of blockchain selfish mining by applying the sensitivity-based optimization. Our goal is to find the optimal dynamic blockchain-pegged mining policy of the dishonest mining pool. To this end, we consider a blockchain system with two mining pools: the honest and the dishonest mining pools, where the honest mining pool follows a two-block leading competitive criterion, while the dishonest mining pool follows a modification of two-block leading competitive criterion. To find the optimal blockchain-pegged mining policy, we develop the sensitivity-based optimization to study dynamic decision of blockchain system through setting up a policy-based Poisson equation, and provide an expression for the unique solution of performance potentials. Based on this, we can characterize monotonicity and optimality of the long-run average profit with respect to the blockchain-pegged mining reward. Also, we prove the structure of the optimal blockchain-pegged mining policy. The methodology and results derived in this paper significantly reduce the large search space of finding the optimal policy, thus they can shed light on the optimal dynamic decision research on the selfish mining attacks of blockchain systems.",
    "citation_count": 31,
    "year": "2022/12",
    "authors": [
        {
            "name": "Ma, Jing-Yu",
            "country": "China"
        },
        {
            "name": "Li, Quan-Lin",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}