{
    "url": "https://link.springer.com/article/10.1007/s10878-019-00506-x",
    "title": "Path optimization for joint distribution of medical consumables under hospital SPD supply chain mode",
    "abstract": "The distribution of medical consumables inside the hospital is an important part of the daily operation of the hospital, which directly affects the operating efficiency of the entire hospital. Under the hospital SPD supply chain mode, the medical medicinal materials distribution nodes of various departments, pharmacies and warehouses of the hospital constitute the logistics distribution network of SPD central warehouse-secondary warehouse-consumption point. Considering the influence of time, distance and carrying vehicle on the distribution route of medical consumables in the hospital, the optimal distribution model of medical consumables under the hospital SPD supply chain mode was established with the minimum distribution cost of the hospital. The corresponding GA is designed and solved by MATLAB programming software. According to the established path optimization model, the distribution path optimization of medical consumables in a hospital in Shanghai is realized. The results show that the model is in line with the actual needs of the hospital; the algorithm is validated and the convergence speed is fast; compared with the traditional distribution path of medical consumables in the hospital, It is found that the optimized hospital medical consumables joint distribution path reduces logistics costs and improves the efficiency of distribution services. This article optimizes the joint distribution route of medical consumables in hospitals, promotes the organic combination of hospital SPD supply chain model and hospital operation structure, and promotes the modernization process of Chinese hospitals.",
    "citation_count": 19,
    "year": "2021/11",
    "authors": [
        {
            "name": "Gao, Gengjun",
            "country": "China"
        },
        {
            "name": "Che, Yuxuan",
            "country": "China"
        },
        {
            "name": "Shen, Jian",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}