{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9861-2",
    "title": "Predictive-reactive scheduling for single surgical suite subject to random emergency surgery",
    "abstract": "This paper discusses the surgery scheduling problem for single surgical suite subject to random emergency surgery. In a surgical suite, each patient should be treated by three stages in the same order. This problem can be handled as a no-wait permutation flow-shop scheduling problem with three machines. A predictive-reactive scheduling approach is developed to accommodate the influence of surgery’s arrival on planned schedule while optimizing the objective of combining efficiency and stability. In the predictive scheduling phase, an initial schedule is generated by solely optimizing the efficiency, and then slack time is inserted in the initial schedule to generate a planned schedule based on the occurrence probability of emergency surgery. In the reactive scheduling phase, a “break-in-moment” of emergency surgery is determined to satisfy the requirement of non-preemption surgery and the no-wait constraint. A partial-rescheduling approach is used to revise the schedule of unperformed surgeries after an emergency surgery certainly breaks in the planned schedule. A computational experiment was conducted and the computational results demonstrate that comparing with traditional approaches, the predictive-reactive scheduling approach developed here could significantly improve the stability with a little sacrifice in the efficiency for all tested instances.",
    "citation_count": 31,
    "year": "2015/11",
    "authors": [
        {
            "name": "Wang, Bing",
            "country": "China"
        },
        {
            "name": "Han, Xingbao",
            "country": "China"
        },
        {
            "name": "Zhang, Xianxia",
            "country": "China"
        },
        {
            "name": "Zhang, Shaohua",
            "country": "China"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}