{
    "url": "https://link.springer.com/article/10.1007/s10878-015-9947-x",
    "title": "Reconfiguration of dominating sets",
    "abstract": "We explore a reconfiguration version of the dominating set problem, where a dominating set in a graph G is a set S of vertices such that each vertex is either in S or has a neighbour in S. In a reconfiguration problem, the goal is to determine whether there exists a sequence of feasible solutions connecting given feasible solutions s and t such that each pair of consecutive solutions is adjacent according to a specified adjacency relation. Two dominating sets are adjacent if one can be formed from the other by the addition or deletion of a single vertex. For various values of k, we consider properties of $$D_k(G)$$ , the graph consisting of a node for each dominating set of size at most k and edges specified by the adjacency relation. Addressing an open question posed by Haas and Seyffarth, we demonstrate that $$D_{\\varGamma (G)+1}(G)$$ is not necessarily connected, for $$\\varGamma (G)$$ the maximum cardinality of a minimal dominating set in G. The result holds even when graphs are constrained to be planar, of bounded tree-width, or b-partite for $$b \\ge 3$$ . Moreover, we construct an infinite family of graphs such that $$D_{\\gamma (G)+1}(G)$$ has exponential diameter, for $$\\gamma (G)$$ the minimum size of a dominating set. On the positive side, we show that $$D_{n-\\mu }(G)$$ is connected and of linear diameter for any graph G on n vertices with a matching of size at least $$\\mu +1$$ .",
    "citation_count": 28,
    "year": "2016/11",
    "authors": [
        {
            "name": "Suzuki, Akira",
            "country": "Japan"
        },
        {
            "name": "Mouawad, Amer E.",
            "country": "Japan"
        },
        {
            "name": "Nishimura, Naomi",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Combinatorics",
        "Convex and Discrete Geometry",
        "Mathematical Modeling and Industrial Mathematics",
        "Theory of Computation",
        "Optimization",
        "Operations Research/Decision Theory"
    ]
}