{
    "url": "https://www.sciencedirect.com/science/article/pii/S240595952500030X",
    "title": "A novel radio resource allocation scheme for beam-hopping 6G satellite internet network based on graph mapping and generative adversarial network",
    "abstract": "In this letter, we are the first to focus on the issue of reliable and flexible radio resource allocation (RRA) for beam-hopping (BH) in satellite internet network (SIN). The main new challenges are accurate and dynamic radio resource modeling and high-efficiency RRA in high-dynamic scenarios. Therefore, we propose a novel RRA scheme for BH-SIN based on graph mapping and generative adversarial network (GAN). In our scheme, the characteristics of radio resources are first to be converted to graphical features. Then, the former RRA schemes are modeled as one of the adversarial objects, to adaptively optimize the next best solution to the changeable scenarios and situations. The simulation results show that the proposed RRA schemes improve the throughput and quality of service by 15% and 22%. 2018 The Korean Institute of Communications and Information Sciences. Publishing Services by Elsevier B.V. This is an open access article under the CC BY-NC-ND license ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ).",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Wenliang Lin",
            "country": ""
        },
        {
            "name": "Bohan Zhu",
            "country": ""
        },
        {
            "name": "Minwei Liu",
            "country": ""
        },
        {
            "name": "Ke Wang",
            "country": ""
        },
        {
            "name": "Zhongliang Deng",
            "country": ""
        },
        {
            "name": "Yicheng Liao",
            "country": ""
        },
        {
            "name": "Yang Liu",
            "country": ""
        },
        {
            "name": "Zexi Huang",
            "country": ""
        },
        {
            "name": "Heng Kang",
            "country": ""
        },
        {
            "name": "Yishan He",
            "country": ""
        },
        {
            "name": "Shimin Zhong",
            "country": ""
        }
    ],
    "keywords": []
}