{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9150-9",
    "title": "A content-aware writing mechanism for reducing energy on non-volatile memory based embedded storage systems",
    "abstract": "Emerging byte-addressable non-volatile memory (NVM), such as phase change memory has many advantages in terms of low power consumption, high density, in-place update, and higher write endurance. Reducing the energy consumption of NVM is a fundamental issue when the technology is considered as an alternative to secondary storage in embedded systems. In the design of energy efficiency approaches, one of the most challenging problems is to reduce unnecessary write activities on NVM. In this paper, we present an optimal content-aware NVM memory writing mechanism, CA-NVM, to effectively select a free NVM page for each write request from file system to reduce write activities, since write activities account for most of energy consumption in NVM storage. In order to speed up the procedure of selecting a free page, we introduce a sampling mechanism, by which we only pick a few bits from the free page and the logical page to be written for comparison. Those sample bits of free pages are stored in a special area such that they can be indexed quickly. We conduct a series of experiments based on realistic traces, and the experimental results show that the proposed technique can reduce write activities up to $$36.03\\,\\%,$$ and reduce energy consumption by $$21.3\\,\\%$$ on average compared with a random based free-page allocation mechanism.",
    "citation_count": 36,
    "year": "2013/09",
    "authors": [
        {
            "name": "Li, Jian",
            "country": "China"
        },
        {
            "name": "Zhuge, Qingfeng",
            "country": "China"
        },
        {
            "name": "Liu, Duo",
            "country": "China"
        },
        {
            "name": "Luo, Huizhang",
            "country": "China"
        },
        {
            "name": "Sha, Edwin H.-M.",
            "country": "China"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}