{
    "url": "https://link.springer.com/article/10.1007/s10617-013-9105-6",
    "title": "A framework for reliability-aware design exploration on MPSoC based systems",
    "abstract": "Applying system-level fault-tolerant techniques such as active redundancy is a promising way to enhance the system reliability for safety-related applications. Embedded system design using active redundancy is a challenging task that involves solving two major problems, namely finding the optimal redundancy configuration and mapping/scheduling of the application (including the redundant components) to the platform under timing and reliability constraints. This paper presents a framework for automatic synthesis of fault-tolerant designs on multiprocessor platforms. The core of the framework consists of: (1)&nbsp;a&nbsp;reliability analysis, that computes the system-level reliability in the presence spatial and temporal redundancy, and (2)&nbsp;an&nbsp;optimization approach for reliability-aware design space exploration. The proposed approach considers both transient and permanent faults and is among the first to support system design using imperfect fault detectors. The framework takes an application model, a platform model and a set of application requirements as input, and generates the recommended design parameters, including task-to-processor binding, task schedule and the selection/placement of redundancy. The effectiveness of our approach is illustrated using several case studies.",
    "citation_count": 55,
    "year": "2012/11",
    "authors": [
        {
            "name": "Huang, Jia",
            "country": "Germany"
        },
        {
            "name": "Raabe, Andreas",
            "country": "Germany"
        },
        {
            "name": "Huang, Kai",
            "country": "Germany"
        },
        {
            "name": "Buckl, Christian",
            "country": "Germany"
        },
        {
            "name": "Knoll, Alois",
            "country": "Germany"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}