{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9152-7",
    "title": "An integrated memory-disk system with buffering adapter and non-volatile memory",
    "abstract": "Next generation non-volatile memory devices are promising replacements for DRAM and Flash memories for mobile devices because of their energy efficiency and non-volatile characteristics. In this paper, we propose a new memory hierarchy system for next-generation non-volatile memory devices that is called an integrated memory-disk (IM-D) structure. It can merge a conventional main memory layer and a disk storage layer into a single memory layer using Phase change memory (PCM) and Flash memories. The IM-D architecture, consisting of a dual buffering IM-D adapter to improve the limited endurance and latencies, an array of PCM/Flash hybrid memories, and an associated memory management module called the IM-D translation layer in the operating system, is designed to utilize the advantages of next-generation non-volatile memory devices and at the same time overcome some shortcomings, like the asymmetric read/write access latencies and limited endurance, of a conventional memory hierarchy system. In the IM-D architecture, we propose an array of PCM/Flash hybrid memories and a migration scheme to enhance the cost effective performance and to reduce access latency. Our experimental results show that the miss rate of the proposed IM-D adapter is reduced by 49&nbsp;% as compared with the conventional memory module, and the write count is reduced by 60.15&nbsp;%. In addition, the access latency of the IM-D storage is improved by 45.3&nbsp;%.",
    "citation_count": 33,
    "year": "2013/09",
    "authors": [
        {
            "name": "Yoon, Su-Kyung",
            "country": "South Korea"
        },
        {
            "name": "Bian, Mei-Ying",
            "country": "South Korea"
        },
        {
            "name": "Kim, Shin-Dug",
            "country": "South Korea"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}