{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9129-6",
    "title": "Private reliability environments for efficient fault-tolerance in CGRAs",
    "abstract": "In the era of platforms hosting multiple applications with variable reliability needs, worst-case platform-wide fault-tolerance decisions are neither optimal nor desirable. As a solution to this problem, designs commonly employ adaptive fault-tolerance strategies that provide each application with the reliability level actually needed. However, in the CGRA domain, the existing schemes either only allow to shift between different levels of modular redundancy (duplication, triplication, etc.) or protect only a particular region of a device (e.g. configuration memory, computation, or data memory). To complement these strategies, we propose private fault-tolerance environments which, in addition to modular redundancy, also provide low cost sub-modular (e.g. residue mod 3) redundancy capable of handling both permanent and temporary faults in configuration memory, computation, communication, and data memory. In addition, we also present adaptive configuration scrubbing techniques which prevent fault accumulation in the configuration memory. Simulation results using a few selected algorithms (FFT, matrix multiplication, and FIR filter) show that the approach proposed is capable of providing flexible protection with energy overhead ranging from 3.125&nbsp;% to 107&nbsp;% for different reliability levels. Synthesis results have confirmed that the proposed architecture reduces the area overhead for self-checking (58&nbsp;%) and fault-tolerant (7.1&nbsp;%) versions, compared to the state of the art adaptive reliability techniques.",
    "citation_count": 51,
    "year": "2014/09",
    "authors": [
        {
            "name": "Jafri, Syed M. A. H.",
            "country": "Finland"
        },
        {
            "name": "Piestrak, Stanislaw J.",
            "country": "France"
        },
        {
            "name": "Hemani, Ahmed",
            "country": "Sweden"
        },
        {
            "name": "Paul, Kolin",
            "country": "India"
        },
        {
            "name": "Plosila, Juha",
            "country": "Finland"
        },
        {
            "name": "Tenhunen, Hannu",
            "country": "Sweden"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}