{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885618301616",
    "title": "A comprehensive review of fruit and vegetable classification techniques",
    "abstract": "Recent advancements in  computer vision  have enabled wide-ranging applications in every field of life. One such application area is fresh produce classification, but the classification of fruit and vegetable has proven to be a complex problem and needs to be further developed. Fruit and vegetable classification presents significant challenges due to interclass similarities and irregular intraclass characteristics. Selection of appropriate data acquisition sensors and feature representation approach is also crucial due to the huge diversity of the field. Fruit and vegetable classification methods have been developed for quality assessment and robotic harvesting but the current state-of-the-art has been developed for limited classes and small datasets. The problem is of a multi-dimensional nature and offers significantly hyperdimensional features, which is one of the major challenges with current machine learning approaches. Substantial research has been conducted for the design and analysis of classifiers for hyperdimensional features which require significant computational power to optimise with such features. In recent years numerous  machine learning techniques  for example,  Support Vector Machine  (SVM), K-Nearest Neighbour (KNN), Decision Trees, Artificial  Neural Networks  (ANN) and  Convolutional Neural Networks  (CNN) have been exploited with many different feature description methods for fruit and vegetable classification in many real-life applications. This paper presents a critical comparison of different state-of-the-art computer vision methods proposed by researchers for classifying fruit and vegetable.",
    "citation_count": "176",
    "year": "2018/12/01",
    "authors": [
        {
            "name": "Khurram Hameed",
            "country": ""
        },
        {
            "name": "Douglas Chai",
            "country": ""
        },
        {
            "name": "Alexander Rassau",
            "country": ""
        }
    ],
    "keywords": []
}