{
    "url": "https://www.sciencedirect.com/science/article/pii/S026288562400012X",
    "title": "A deep learning-based illumination transform for devignetting photographs of dermatological lesions",
    "abstract": "Photographs of  skin lesions  taken with standard digital cameras (macroscopic images) have gained wide acceptance in dermatology. However, uneven background lighting caused by nonstandard image acquisition negatively impacts lesion segmentation and diagnosis. To address this, we propose an automated illumination equalization method based on a counter exponential transform (IECET). A modified residual network (ResNet)  regressor  is used to automate the selection of the operational parameter of the IECET. The regressor is designed by modifying the final fully-connected layer of the baseline ResNet-50 model. The modified fully-connected layer is coupled to a regression layer in the modified ResNet regressor. A prior  knowledge base  is created to train the modified ResNet regressor. For this, a set of corrupted images are generated by simulating uneven background illumination on pristine images. The  knowledge base  is created by including pairs of value components obtained from the HSV color space version of the corrupted macroscopic images and ideal operational parameter values that maximize the peak signal-to-noise ratio (PSNR) between the pristine images and the IECET outputs. We evaluated segmentation accuracies of the deep threshold prediction network (DTP-Net), DeepLabV3   +, fully convolutional network (FCN), and U-Net on the corrupted macroscopic images and output images of the IECET. The DTP-Net, DeepLabV3   +, FCN, and U-Net exhibited Dice similarity coefficient (DSC) of 0.71  ±  0.26, 0.85  ±  0.15, 0.75  ±  0.22, and 0.66  ±  0.28 on corrupted images and 0.81  ±  0.17, 0.87  ±  0.12, 0.79  ±  0.18, and 0.79  ±  0.15, on the outputs of the IECET. Increase in DSC proves the ability of the IECET to improve the performance of  deep learning  models used to segment skin lesions on macroscopic images.",
    "citation_count": "7",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Vipin Venugopal",
            "country": ""
        },
        {
            "name": "Malaya Kumar Nath",
            "country": ""
        },
        {
            "name": "Justin Joseph",
            "country": ""
        },
        {
            "name": "M. Vipin Das",
            "country": ""
        }
    ],
    "keywords": []
}