{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885622000014",
    "title": "A dynamic keypoint selection network for 6DoF pose estimation",
    "abstract": "6 DoF pose estimation problem aims to estimate the rotation and translation parameters between two coordinates, such as object world coordinate and camera world coordinate. Although some advances are made with the help of  deep learning , how to full use scene information is still a problem. Prior works tackle the problem by pixel-wise  feature fusion  but need to randomly select numerous points from images, which can not satisfy the demands of fast inference simultaneously and accurate pose estimation. In this work, we present a novel  deep neural network  based on dynamic  keypoint  selection designed for 6DoF pose estimation from a single RGBD image. Our network includes three parts, instance  semantic segmentation , edge points detection and 6DoF pose estimation. Given an RGBD image, our network is trained to predict pixel category and the translation to edge points and center points. Then, a least-square fitting manner is applied to estimate the 6DoF pose parameters. Specifically, we propose a dynamic keypoint  selection algorithm  to choose keypoints from the foreground feature map. It allows us to leverage geometric and appearance information. During 6DoF pose estimation, we utilize the instance semantic segmentation result to filter out background points and only use foreground points to finish edge points detection and 6DoF pose estimation. Experiments on two commonly used 6DoF estimation benchmark datasets, YCB-Video and LineMoD, demonstrate that our method outperforms the state-of-the-art methods and achieves significant improvements over other same category methods time efficiency.",
    "citation_count": "8",
    "year": "2022/02/01",
    "authors": [
        {
            "name": "Haowen Sun",
            "country": ""
        },
        {
            "name": "Taiyong Wang",
            "country": ""
        },
        {
            "name": "Enlin Yu",
            "country": ""
        }
    ],
    "keywords": []
}