{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624004852",
    "title": "A fast and lightweight train image fault detection model based on convolutional neural networks",
    "abstract": "Trains play a vital role in the life of residents. Fault detection of trains is essential to ensuring their safe operation. Aiming at the problems of many parameters, slow detection speed, and low detection accuracy of the current train image fault detection model, a fast and lightweight train image fault detection model using convolutional neural network (FL-TINet) is proposed in this study. First, the joint depthwise separable convolution and divided-channel convolution strategy are applied to the feature extraction network in FL-TINet to reduce the number of parameters and computation amount in the backbone network, thereby increasing the detection speed. Second, a mixed attention mechanism is designed to make FL-TINet focus on key features. Finally, an improved discrete K-means clustering algorithm is designed to set the anchor boxes so that the anchor box can cover the object better, thereby improving the detection accuracy. Experimental results on PASCAL 2012 and train datasets show that FL-TINet can detect faults at 119 frames per second. Compared with the state-of-the-art CenterNet, RetinaNet, SSD, Faster R-CNN, MobileNet, YOLOv3, YOLOv4, YOLOv7-Tiny, YOLOv8_n and YOLOX-Tiny models, FL-TINet’s detection speed is increased by 96.37% on average, and it has higher detection accuracy and fewer parameters. The robustness test shows that FL-TINet can resist noise and illumination changes well.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Longxin Zhang",
            "country": ""
        },
        {
            "name": "Wenliang Zeng",
            "country": ""
        },
        {
            "name": "Peng Zhou",
            "country": ""
        },
        {
            "name": "Xiaojun Deng",
            "country": ""
        },
        {
            "name": "Jiayu Wu",
            "country": ""
        },
        {
            "name": "Hong Wen",
            "country": ""
        }
    ],
    "keywords": []
}