{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620302225",
    "title": "A framework of human action recognition using length control features fusion and weighted entropy-variances based feature selection",
    "abstract": "In this article, we implement an action recognition technique based on  features fusion  and best feature selection. In the proposed method, HSI color transformation is performed in the first step to improve the contrast of video frames and then extract their motion features by  optical flow  algorithm. The frames fusion approach extracts the moving regions that find out by optical flow. After that, extract shape and  texture features  fused by a new parallel approach name length control features. A new Weighted Entropy-Variances approach is applied to a combined vector and selects the best of them for classification. Finally, features are passed in M-SVM for final features classification into relevant human actions. The experimental process is conducted in four famous action datasets- Weizmann, KTH, UCF Sports, and UCF YouTube, with recognition rate 97.9%, 100%, 99.3%, and 94.5%, respectively. Experimental results show that the proposed scheme performed significantly sound output concerning listed methods.",
    "citation_count": "126",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Farhat Afza",
            "country": ""
        },
        {
            "name": "Muhammad Attique Khan",
            "country": ""
        },
        {
            "name": "Muhammad Sharif",
            "country": ""
        },
        {
            "name": "Seifedine Kadry",
            "country": ""
        },
        {
            "name": "Gunasekaran Manogaran",
            "country": ""
        },
        {
            "name": "Tanzila Saba",
            "country": ""
        },
        {
            "name": "Imran Ashraf",
            "country": ""
        },
        {
            "name": "Robertas Damaševičius",
            "country": ""
        }
    ],
    "keywords": []
}