{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300317",
    "title": "A high-efficiency energy and storage approach for IoT applications of facial recognition",
    "abstract": "This work introduces a high-efficiency approach for face recognition applications based on features using a recent algorithm called Floor of Log (FoL). The advantage of this method is the reduction of storage and energy, maintaining accuracy. K-Nearest Neighbors and  Support Vector Machine  algorithm was applied to learn the better parameter of the FoL algorithm using cross-validation. Accuracy and the size after the  compression process  were adopted to evaluate the proposed algorithm. The FoL was tested in CelebA, Extended YaleB, AR, and LFW face datasets obtaining the same or better results when compared with the approach using the same classifiers with uncompressed features, but with a reduction of 86 to 91% compared to the original data size. The proposed method of this work presents a robust and straightforward algorithm of compression of features for face recognition applications. The FoL is a new supervised  compression algorithm  that can be adapted to achieve great results and integrated with  edge computing  systems.",
    "citation_count": "17",
    "year": "2020/04/01",
    "authors": [
        {
            "name": "Solon A. Peixoto",
            "country": ""
        },
        {
            "name": "Francisco F.X. Vasconcelos",
            "country": ""
        },
        {
            "name": "Matheus T. Guimarães",
            "country": ""
        },
        {
            "name": "Aldísio G. Medeiros",
            "country": ""
        },
        {
            "name": "Paulo A.L. Rego",
            "country": ""
        },
        {
            "name": "Aloísio V. Lira Neto",
            "country": ""
        },
        {
            "name": "Victor Hugo C. de Albuquerque",
            "country": ""
        },
        {
            "name": "Pedro P. Rebouças Filho",
            "country": ""
        }
    ],
    "keywords": []
}