{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002615",
    "title": "A locally weighted, correlated subdomain adaptive network employed to facilitate transfer learning",
    "abstract": "Domain adaptation has found extensive applications in diverse fields, including  transfer learning ,  deep learning , and  image processing , to effectively address the challenge of mismatched data distributions. Nevertheless, persistent challenges such as limited  transfer data  and the occurrence of negative transfer continue to exist. These issues not only increase the complexity of model learning but also affect the accuracy of the transfer results. To tackle these challenges, this paper introduces a novel approach called the Related Weighted  Subdomain  Adaptive Network (RWSAN). This network constructs related subdomain clusters in the source domain to encompass a wider spectrum of associated information. It aims to align target domain subdomains with the related subdomain clusters in the source domain as closely as possible, thus increasing the number of transferable samples from the source domain and solving insufficient transferable samples in some adaptations. To address the issue of negative transfer arising from irrelevant subdomains in the source domain during the transfer process, a related weighted maximum mean discrepancy method is introduced. This method optimizes transfer weights, minimizes the feature distribution disparity between the target domain and the source domain, and mitigates the negative impact of irrelevant subdomains on the target domain, thereby enhancing the accuracy of domain adaptation during transfer. To evaluate the proposed RWSAN method, comprehensive  performance tests  were conducted using widely used red-green-blue (RGB) and  hyperspectral image  (HIS) image datasets. The results demonstrate that the RWSAN method effectively resolves insufficient transfer data and negative transfer, proving its high reliability. Additionally, it exhibits excellent performance in error analysis, network convergence analysis, data visualization, and distribution difference.",
    "citation_count": "3",
    "year": "2024/01/01",
    "authors": [
        {
            "name": "Tuo Xu",
            "country": ""
        },
        {
            "name": "Bing Han",
            "country": ""
        },
        {
            "name": "Jie Li",
            "country": ""
        },
        {
            "name": "Yuefan Du",
            "country": ""
        }
    ],
    "keywords": []
}