{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001853",
    "title": "A multi-scale perceptual polyp segmentation network based on boundary guidance",
    "abstract": "Image segmentation of polyps can provide an important basis for the diagnosis of  colorectal  cancer and has a high clinical application value. Segmentation of polyp regions is very challenging due to the high similarity between polyps and background mucosal tissue, many existing methods have failed to produce satisfactory polyp segmentation results. Therefore, scholars have recently used transformer backbone networks to extract features, which captures global information better than CNNs, resulting in more accurate detection results, but their boundary results are still not accurate enough due to the lack of processing for the boundary. In this paper, we propose a multi-scale perceptual polyp segmentation network based on boundary guidance, to obtain higher segmentation accuracy in both regions and boundary. To increase the feature response region, we first propose a multi-scale global perception module to expand the receptive field and aggregate multi-scale contextual information to capture the primary location of polyps at local and global levels. Then, we design a boundary-guided feature enhancement module that utilizes contextual features to mine hidden polyp boundary and employs the boundary to guide region learning to improve segmentation boundary accuracy. Finally, we propose a complementary fusion module that uses higher-level features to filter out the background noise of lower-level features and fuses the features layer by layer. In particular, to refine the extracted features, a detail refinement module is designed to complement the  spatial details  to improve the segmentation performance. Extensive experiments using seven evaluation metrics on five publicly available polyp datasets have shown that the proposed a multi-scale perceptual polyp segmentation network based on boundary guidance outperforms most state-of-the-art models.",
    "citation_count": "11",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Lu Lu",
            "country": ""
        },
        {
            "name": "Shuhan Chen",
            "country": ""
        },
        {
            "name": "Haonan Tang",
            "country": ""
        },
        {
            "name": "Xinfeng Zhang",
            "country": ""
        },
        {
            "name": "Xuelong Hu",
            "country": ""
        }
    ],
    "keywords": []
}