{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300460",
    "title": "A novel edge-oriented framework for saliency detection enhancement",
    "abstract": "Mixed visual scenes and cluttered background commonly exist in natural images, which forms a challenge for  saliency detection . In dealing with complex images, there are two kinds of deficiencies in the existing saliency detection methods: ambiguous object boundaries and fragmented  salient regions . To address these two limitations, we propose a novel edge-oriented framework to improve the performance of existing salient detection methods. Our framework is based on two interesting insights: 1) human eyes are sensitive to the edges between foreground and background even there is hardly any difference in terms of saliency, 2) Guided by semantic integrity, human eyes tend to view a visual scene as several objects, rather than pixels or  superpixels . The proposed framework consists of the following three parts. First, an edge probability map is extracted from an input image. Second, the edge-based over-segmentation is obtained by sharpening the edge probability map, which is ultilized to generate edge-regions using an edge-strength based hierarchical merge model. Finally, based on the prior saliency map generated by existing methods, the framework assigns each edge-region with a saliency value. Based on four publically available datasets, the experiments demonstrate that the proposed framework can significantly improve the detection results of existing saliency detection models, which is also superior to other state-of-the-art methods.",
    "citation_count": "26",
    "year": "2019/07/01",
    "authors": [
        {
            "name": "Qingzhen Xu",
            "country": ""
        },
        {
            "name": "Fengyun Wang",
            "country": ""
        },
        {
            "name": "Yongyi Gong",
            "country": ""
        },
        {
            "name": "Zhoutao Wang",
            "country": ""
        },
        {
            "name": "Kun Zeng",
            "country": ""
        },
        {
            "name": "Qi Li",
            "country": ""
        },
        {
            "name": "Xiaonan Luo",
            "country": ""
        }
    ],
    "keywords": []
}