{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623000823",
    "title": "A semantic fusion based approach for express bill detection in complex scenes",
    "abstract": "With the explosive growth of the express logistics industry, hundreds of millions of images of express bills need to be recognized in the process of express transportation. However, it is challenging to detect express bills in an automated manner as the images of express bills acquired on the assembly line are of inferior quality and in complex scenes. Existing methods have difficulty in extracting semantic texture features at the pixel level for express bills in complex scenes. To solve the problem mentioned above, we propose an oriented frame target detection method Semantic Fusion Rotated Object Detector (SFRDet). In order to enhance the feature extraction capability in complex scenarios by fusing pixel-level texture features, SFRDet employs a semantic fusion mechanism to extract low-level semantic information from images to guide training. On this basis, the Semantic Reinforcement Feature Pyramid Network (SRFPN) is used to enhance the model’s attention to semantic information during the feature extraction process. This enables the model to obtain better feature extraction capability and faster inference at the same time. Extensive experiments are conducted on multiple datasets in practical application scenes. The result indicates the proposed method outperforms other state-of-the-art methods in precision and efficiency. It has a wild application prospect in the industry.",
    "citation_count": "2",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Luming Zhang",
            "country": ""
        },
        {
            "name": "Junjie Peng",
            "country": ""
        },
        {
            "name": "Wenfu Liu",
            "country": ""
        },
        {
            "name": "Haochen Yuan",
            "country": ""
        },
        {
            "name": "Shuhua Tan",
            "country": ""
        },
        {
            "name": "Lu Wang",
            "country": ""
        },
        {
            "name": "Fen Yi",
            "country": ""
        }
    ],
    "keywords": []
}