{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300733",
    "title": "A study on wrist identification for forensic investigation",
    "abstract": "Criminal and victim identification based on crime scene images is an important part of  forensic investigation . Criminals usually avoid identification by covering their faces and tattoos in the evidence images, which are taken in uncontrolled environments. Existing identification methods, which make use of  biometric  traits, such as vein, skin mark, height, skin colour, weight, race, etc., are considered for solving this problem. The soft  biometric traits , including skin colour, gender, height, weight and race, provide useful information but not distinctive enough. Veins and skin marks are limited to high resolution images and some body sites may neither have enough skin marks nor clear veins. Terrorists and rioters tend to expose their wrists in a gesture of triumph, greeting or salute, while paedophiles usually show them when touching victims. However, wrists were neglected by the biometric community for  forensic applications . In this paper, a wrist  identification algorithm , which includes skin segmentation, key point localisation , image to template alignment, large feature set extraction, and classification, is proposed. The proposed algorithm is evaluated on NTU-Wrist-Image-Database-v1, which consists of 3945 images from 731 different wrists, including 205 pairs of wrist images collected from the Internet, taken under uneven illuminations with different poses and resolutions. The experimental results show that wrist is a useful clue for criminal and victim identification.",
    "citation_count": "15",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Wojciech Michal Matkowski",
            "country": ""
        },
        {
            "name": "Frodo Kin Sun Chan",
            "country": ""
        },
        {
            "name": "Adams Wai Kin Kong",
            "country": ""
        }
    ],
    "keywords": []
}