{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300101",
    "title": "Adaptive rational fractal interpolation function for image super-resolution via local fractal analysis",
    "abstract": "Image super-resolution aims to generate high-resolution image based on the given low-resolution image and to recover the details of the image. The common approaches include reconstruction-based methods and interpolation-based methods. However, these existing methods show difficulty in processing the regions of an image with complicated texture. To tackle such problems,  fractal geometry  is applied on image super-resolution, which demonstrates its advantages when describing the complicated details in an image. The common fractal-based method regards the whole image as a single  fractal set . That is, it does not distinguish the complexity difference of texture across all regions of an image regardless of smooth regions or texture rich regions. Due to such strong presumption, it causes artificial errors while recovering smooth area and texture blurring at the regions with rich texture. In this paper, the proposed method produces rational fractal  interpolation model  with various setting at different regions to adapt to the local texture complexity. In order to facilitate such mechanism, the proposed method is able to segment the image region according to its complexity which is determined by its local  fractal dimension . Thus, the image super-resolution process is cast to an optimization problem where local fractal dimension in each region is further optimized until the optimization convergence is reached. During the optimization (i.e. super-resolution), the overall image complexity (determined by local fractal dimension) is maintained. Compared with state-of-the-art method, the proposed method shows promising performance according to qualitative evaluation and  quantitative evaluation .",
    "citation_count": "25",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Xunxiang Yao",
            "country": ""
        },
        {
            "name": "Qiang Wu",
            "country": ""
        },
        {
            "name": "Peng Zhang",
            "country": ""
        },
        {
            "name": "Fangxun Bao",
            "country": ""
        }
    ],
    "keywords": []
}