{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624002221",
    "title": "Adaptive attribute distribution similarity for few-shot learning",
    "abstract": "Modern  deep learning  has many drawbacks, including a heavy reliance on labeled data. One of the key strategies for solving this problem is few-shot learning (FSL). With just a few labeled samples, FSL seeks to identify previously unknown classes. The majority of works that have been published thus far focus on comparing the features of query samples and support classes, which do not fully utilize the training set's data and do not help sustain  performance improvement . In our study, we compute a new attribute distribution similarity between support classes and a query sample of novel classes using attribute information on the training set. We suggest a fresh approach to three phases to accomplish our objective: 1) A attribute provider harnesses the visual features of the training set to construct attributes. 2) Choosing appropriate attributes for novel classes and enriching attributes to determine how similar novel classes and attributes are to one another. 3) To help with classification, attribute distribution similarity is computed for the first time by creating new correlations between the support classes and the query samples, which increases the accuracy of picture classification. Be aware that our solution won't make the initial network settings larger. Experiments on inductive FSL tasks demonstrate the usefulness and practicality of our strategy. Specifically, Our method has achieved the highest performance in the 5-way 1-shot task settings on the tiered-ImageNet and CUB 200–2011 datasets, with impressive results of  73.22 %  and  82.34 %  respectively.",
    "citation_count": "0",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Anping Cai",
            "country": ""
        },
        {
            "name": "Leiting Chen",
            "country": ""
        },
        {
            "name": "Yongqi Chen",
            "country": ""
        },
        {
            "name": "Ziyu He",
            "country": ""
        },
        {
            "name": "Shuqing Tao",
            "country": ""
        },
        {
            "name": "Chuan Zhou",
            "country": ""
        }
    ],
    "keywords": []
}