{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623000331",
    "title": "An automated hyperparameter tuned deep learning model enabled facial emotion recognition for autonomous vehicle drivers",
    "abstract": "The progress of  autonomous driving  cars is a difficult movement that causes problems regarding safety, ethics, social acceptance, and cybersecurity. Currently, the  automotive industry  is utilizing these technologies to assist drivers with  advanced driver assistance systems . This system helps different functions to careful driving and predict drivers' ability of stable driving behavior and road safety. A  great number  of researches have shown that the driver's emotion is the major factor that handles the emotions, resulting in serious vehicle collisions. As a result, continuous monitoring of drivers' behavior could assist to evaluate their behavior to prevent accidents. The study proposes a new Squirrel Search Optimization with  Deep Learning  Enabled Facial Emotion Recognition (SSO-DLFER) technique for Autonomous Vehicle Drivers. The proposed SSO-DLFER technique focuses mainly on the identification of driver facial emotions in the AVs. The proposed SSO-DLFER technique follows two major processes namely face detection and emotion recognition. The RetinaNet model is employed at the initial phase of the face detection process. For emotion recognition, the SSO-DLFER technique applied the Neural Architectural Search (NASNet) Large feature extractor with a  gated recurrent unit  (GRU) model as a classifier. For improving the emotion recognition performance, the SSO-based hyperparameter tuning procedure is performed. The simulation analysis of the SSO-DLFER technique is tested under benchmark datasets and the experimental outcome was investigated under various aspects. The comparative analysis reported the enhanced performance of the SSO-DLFER algorithm on recent approaches.",
    "citation_count": "33",
    "year": "2023/05/01",
    "authors": [
        {
            "name": "Deepak Kumar Jain",
            "country": ""
        },
        {
            "name": "Ashit Kumar Dutta",
            "country": ""
        },
        {
            "name": "Elena Verdú",
            "country": ""
        },
        {
            "name": "Shtwai Alsubai",
            "country": ""
        },
        {
            "name": "Abdul Rahaman Wahab Sait",
            "country": ""
        }
    ],
    "keywords": []
}