{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885625000150",
    "title": "An ontological approach to investigate the impact of deep convolutional neural networks in anomaly detection of left ventricular hypertrophy using echocardiography images",
    "abstract": "Left Ventricular Hypertrophy (LVH) is a critical predictor of cardiovascular disease, making it essential to incorporate it as a fundamental parameter in both diagnostic screening and clinical management. Addressing the need for efficient, accurate, and scalable medical image analysis, we introduce a state-of-the-art preprocessing pipeline coupled with a novel Deep Convolutional Neural Network (DCNN) architecture. This paper details our choice of the HMC-QU dataset, selected for its robustness and its proven efficacy in enhancing model generalization. We also describe innovative preprocessing techniques aimed at improving the quality of input data, thereby boosting the model's feature extraction capabilities. Our multi-disciplinary approach includes deploying a DCNN for automated LVH diagnosis using echocardiography A4C and A2C images. We evaluated the model using architectures based on VGG16, ResNet50, and InceptionV3, where our proposed DCNN exhibited enhanced performance. In our study, 93 out of 162 A4C recordings and 68 out of 130 A2C recordings confirmed the presence of LVH. The novel DCNN model achieved an impressive 99.8% accuracy on the training set and 98.0% on the test set. Comparatively, ResNet50 and InceptionV3 models showed lower accuracy and higher loss values both in training and testing phases. Our results underscore the potential of our DCNN architecture in enhancing the precision of MRI echocardiograms in diagnosing LVH, thereby providing critical support in the screening and treatment of cardiovascular conditions. The high accuracy and minimal losses observed with the novel DCNN model indicate its utility in clinical settings, making it a valuable tool for improving patient outcomes in cardiovascular care.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Umar Islam",
            "country": ""
        },
        {
            "name": "Hathal Salamah Alwageed",
            "country": ""
        },
        {
            "name": "Saleh Alyahyan",
            "country": ""
        },
        {
            "name": "Manal Alghieth",
            "country": ""
        },
        {
            "name": "Hanif Ullah",
            "country": ""
        },
        {
            "name": "Naveed Khan",
            "country": ""
        }
    ],
    "keywords": []
}