{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620301013",
    "title": "Application of 3D laser scanning technology for image data processing in the protection of ancient building sites through deep learning",
    "abstract": "To study the conservation of architectural heritage, computer algorithms are used to process the artificial field measurements and  reference data  maps. A 3D virtual model of traditional architecture is constructed for the direct learning and feature extraction from  image data  through  deep learning . A set of tools and processes for pixel-level  image processing  labeling are proposed, and a label quality checking tool is written specially. Through the training method of  transfer learning , the convergence speed and accuracy of the network are accelerated and improved. Based on the field data collection of the architectural heritage by a 3D  laser scanner , the impacts of the number of stations, the number of targets, and the distance on the data scanning results are analyzed, thereby drawing the rules and principles of setting up the survey stations. While processing the point cloud data, for the redundant data and the rough difference points found in the original point cloud data, the program is written by the gross error elimination algorithm, which realizes the automatic elimination of the point cloud gross error data and provides a convenient method for data processing. The data collection, data processing, and model construction of architectural heritage are performed by the 3D laser scanner. The 3D models of traditional architecture with texture photos are obtained. The results show that through correlation error analysis and model evaluation, the requirements for the measurement of traditional architecture can be achieved. Therefore, the technology has a guiding significance for the conservation of traditional architecture, which proves that the 3D laser scanner has broad application prospects in the surveying and mapping of architectural heritage.",
    "citation_count": "33",
    "year": "2020/10/01",
    "authors": [
        {
            "name": "Yongsheng Yin",
            "country": ""
        },
        {
            "name": "Juan Antonio",
            "country": ""
        }
    ],
    "keywords": []
}