{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616302013",
    "title": "Binary feature fusion for discriminative and secure multi-biometric cryptosystems",
    "abstract": "Biometric cryptosystem has been proven to be a promising approach for template protection. Cryptosystems such as fuzzy extractor and fuzzy commitment require discriminative and informative binary  biometric  input to offer accurate and secure recognition. In multi-modal biometric recognition, binary features can be produced via fusing the real-valued unimodal features and binarizing the fused features. However, when the extracted features of certain modality are represented in binary and the extraction parameters are not known, real-valued features of other modalities need to be binarized and the  feature fusion  needs to be carried out at the binary level. In this paper, we propose a  binary feature  fusion method that extracts a set of fused binary features with high  discriminability  (small intra-user and large inter-user variations) and entropy (weak dependency among bits and high bit uniformity) from multiple sets of binary unimodal features. Unlike existing fusion methods that mainly focus on discriminability, the proposed method focuses on both feature discriminability and system security: The proposed method 1) extracts a set of weakly dependent feature groups from the multiple unimodal features; and 2) fuses each group to a bit using a mapping that minimizes the intra-user variations and maximizes the inter-user variations and uniformity of the fused bit. Experimental results on three multi-modal databases show that fused binary feature of the proposed method has both higher discriminability and higher entropy compared to the unimodal features and the fused features generated from the state-of-the-art binary fusion approaches.",
    "citation_count": "21",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Guangcan Mai",
            "country": ""
        },
        {
            "name": "Meng-Hui Lim",
            "country": ""
        },
        {
            "name": "Pong C. Yuen",
            "country": ""
        }
    ],
    "keywords": []
}