{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885625000022",
    "title": "Co-salient object detection with consensus mining and consistency cross-layer interactive decoding",
    "abstract": "The main goal of co-salient object detection (CoSOD) is to extract a group of notable objects that appear together in the image. The existing methods face two major challenges: the first is that in some complex scenes or in the case of interference by other salient objects, the mining of consensus cues for co-salient objects is inadequate; the second is that other methods input consensus cues from top to bottom into the decoder, which ignores the compactness of the consensus and lacks cross-layer interaction. To solve the above problems, we propose a consensus mining and consistency cross-layer interactive decoding network, called CCNet, which consists of two key components, namely, a consensus cue mining module (CCM) and a consistency cross-layer interactive decoder (CCID). Specifically, the purpose of CCM is to fully mine the cross-consensus clues among the co-salient objects in the image group, so as to achieve the group consistency modeling of the group of images. Furthermore, CCID accepts features of different levels as input and receives semantic information of group consensus from CCM, which is used to guide features of other levels to learn higher-level feature representations and cross-layer interaction of group semantic consensus clues, thereby maintaining the consistency of group consensus cues and enabling accurate co-saliency map prediction. We evaluated the proposed CCNet using four widely accepted metrics across three challenging CoSOD datasets and the experimental results demonstrate that our proposed approach outperforms other existing state-of-the-art CoSOD methods, particularly on the CoSal2015 and CoSOD3k datasets. The results of our method are available at  https://github.com/jinghuaipan/CCNet .",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Yanliang Ge",
            "country": ""
        },
        {
            "name": "Jinghuai Pan",
            "country": ""
        },
        {
            "name": "Junchao Ren",
            "country": ""
        },
        {
            "name": "Min He",
            "country": ""
        },
        {
            "name": "Hongbo Bi",
            "country": ""
        },
        {
            "name": "Qiao Zhang",
            "country": ""
        }
    ],
    "keywords": []
}