{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616300993",
    "title": "Comparing random forest approaches to segmenting and classifying gestures",
    "abstract": "A complete  gesture recognition  system should localize and classify each gesture from a given gesture vocabulary, within a continuous video stream. In this work, we compare two approaches: a method that performs the tasks of temporal segmentation and classification simultaneously with another that performs the tasks sequentially. The first method trains a single  random forest model  to recognize gestures from a given vocabulary, as presented in a training dataset of video plus 3D body joint locations, as well as out-of-vocabulary (non-gesture) instances. The second method employs a cascaded approach, training a binary random forest model to distinguish gestures from background and a multi-class random forest model to classify segmented gestures. Given a test input video stream, both frameworks are applied using sliding windows at multiple temporal scales. We evaluated our formulation in segmenting and recognizing gestures from two different benchmark datasets: the  NATOPS  dataset of 9600 gesture instances from a vocabulary of 24 aircraft handling signals, and the ChaLearn dataset of 7754 gesture instances from a vocabulary of 20 Italian communication gestures. The performance of our method compares favorably with state-of-the-art methods that employ  Hidden Markov Models  or Hidden  Conditional Random Fields  on the NATOPS dataset. We conclude with a discussion of the advantages of using our model for the task of gesture recognition and segmentation, and outline weaknesses which need to be addressed in the future.",
    "citation_count": "49",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Ajjen Joshi",
            "country": ""
        },
        {
            "name": "Camille Monnier",
            "country": ""
        },
        {
            "name": "Margrit Betke",
            "country": ""
        },
        {
            "name": "Stan Sclaroff",
            "country": ""
        }
    ],
    "keywords": []
}