{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885618301069",
    "title": "Convolutional Neural Networks for Subjective Face Attributes",
    "abstract": "Describable visual facial attributes are now commonplace in human  biometrics  and  affective computing , with existing algorithms even reaching a sufficient point of maturity for placement into commercial products. These algorithms model objective facets of  facial appearance , such as hair and  eye color , expression, and aspects of the geometry of the face. A natural extension, which has not been studied to any great extent thus far, is the ability to model subjective attributes that are assigned to a face based purely on visual  judgments . For instance, with just a glance, our first impression of a face may lead us to believe that a person is smart, worthy of our trust, and perhaps even our admiration — regardless of the underlying truth behind such attributes. Psychologists believe that these judgments are based on a variety of factors such as  emotional states ,  personality traits , and other physiognomic cues. But work in this direction leads to an interesting question: how do we create models for problems where there is only measurable behavior? In this paper, we introduce a convolutional neural network-based regression framework that allows us to train  predictive models  of crowd behavior for social attribute assignment. Over images from the AFLW face database, these models demonstrate strong correlations with human crowd ratings.",
    "citation_count": "4",
    "year": "2018/10/01",
    "authors": [
        {
            "name": "Mel McCurrie",
            "country": ""
        },
        {
            "name": "Fernando Beletti",
            "country": ""
        },
        {
            "name": "Lucas Parzianello",
            "country": ""
        },
        {
            "name": "Allen Westendorp",
            "country": ""
        },
        {
            "name": "Samuel Anthony",
            "country": ""
        },
        {
            "name": "Walter J. Scheirer",
            "country": ""
        }
    ],
    "keywords": []
}