{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001294",
    "title": "Discriminable feature enhancement for unsupervised domain adaptation",
    "abstract": "Unsupervised domain adaptation addresses the problem of knowledge transformation from source domain to target domain, aiming to effectively alleviate data distribution mismatch and data labeling consumption. The issue of data distribution mismatches is widespread in actual agricultural visual tasks. Moreover, it is expensive and time-consuming to construct and label  visual image  data. For in-field cotton boll, its maturing status can greatly affect the yield and quality. Uneven distribution restrains the performance for maturing status recognition. Therefore, domain adaptation is essential for identifying cross-domain cotton boll maturity. Existing unsupervised domain adaptation methods obtain domain invariant feature for achieving domain alignment. However, the discriminability of features is less considered, which may result in unsatisfactory classification results. In this paper, an unsupervised domain adaptation method called discriminable feature enhancement(DFE-DA) is proposed to identify cross-domain cotton boll maturity. It enables to minimize intra-class distance by maximizing intra-domain density(MID) loss and realizes discriminable feature enhancement. The effectiveness of DFE-DA is verified on in-field cotton boll V2(IFCB-V2) dataset containing 2400 images. The experimental results demonstrate that DFE-DA has an average improvement of 12.8%, 10.3% and 7.6% compared with other methods in three different transfer tasks. Furthermore, the MID loss can cooperate well with other adversarial methods. To verity the robustness of DFE-DA, additional experiments conducted on the public benchmark Office-31 and Office-Home indicates it is comparable to the state-of-the-arts.",
    "citation_count": "11",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Yanan Li",
            "country": ""
        },
        {
            "name": "Yifei Liu",
            "country": ""
        },
        {
            "name": "Dingrun Zheng",
            "country": ""
        },
        {
            "name": "Yuhan Huang",
            "country": ""
        },
        {
            "name": "Yuling Tang",
            "country": ""
        }
    ],
    "keywords": []
}