{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885622000816",
    "title": "Double chain networks for monocular 3D human pose estimation",
    "abstract": "The 2D-3D lifting task for Human Pose Estimation is a highly  nonlinear mapping  problem, which requires mutual constraints among human  joints . In this paper, we mainly discuss how to represent the constraints among the joints by their global and local dependencies, and how to fuse them more effectively. Therefore, we propose a novel end-to-end  neural network architecture  named Double chain Networks (DCN), for monocular 2D-3D human pose lifting task. The DCN consists of two parts. One is a global constraint module based on full connection layer, which extracts the global dependency information of human body joints; the other is  graph convolution  based local constraint module, which represents the local dependency information of human body joints. The global and local constraint features are fused by interleaved addition to combine the global and local spatial constraint features of human joints in DCN regression, which outperforms the way of concatenating them. We perform abundant ablation experiments on Human3.6M dataset to verify the advantages of the constraint modules, and compare the performance of the single/double chain networks. Experimental results show that the DCN achieves state-of-the-art performance and exhibits strong  generalization ability , and its performance is comparable to the methods based on temporal information. Finally, we apply the DCN to reconstruct 3D  skeletons  in 3D anime characters. The equipotential-joints connection mode to extract the constraint relationships between the human equipotential-joints; The DCN can effectively extract and combine the global and local constraints of human joints; The DCN achieves state-of-the-art performance and exhibits strong generalization ability; We apply the DCN to the posture construction of 3D virtual characters.",
    "citation_count": "6",
    "year": "2022/07/01",
    "authors": [
        {
            "name": "Guihu Bai",
            "country": ""
        },
        {
            "name": "Yanmin Luo",
            "country": ""
        },
        {
            "name": "Xueliang Pan",
            "country": ""
        },
        {
            "name": "Youjie Wang",
            "country": ""
        },
        {
            "name": "Jia Wang",
            "country": ""
        },
        {
            "name": "Jing-Ming Guo",
            "country": ""
        }
    ],
    "keywords": []
}