{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624005110",
    "title": "Edge guided and Fourier attention-based Dual Interaction Network for scene text erasing",
    "abstract": "Scene text erasing (STE) aims to remove the text regions and inpaint those regions with reasonable content in the image. It involves a potential task, i.e., scene text segmentation, in implicate or explicate ways. Most previous methods used cascaded or parallel pipelines to segment text in one branch and erase text in another branch. However, they have not fully explored the information between the two subtasks, i.e., using an interactive method to enhance each other. In this paper, we introduce a novel one-stage STE model called Dual Interaction Network (DINet), which encourages interaction between scene text segmentation and scene text erasing in an end-to-end manner. DINet adopts a shared encoder and two parallel decoders for text segmentation and erasing respectively. Specifically, the two decoders interact via an Interaction Enhancement Module (IEM) in each layer, aggregating the residual information from each other. To facilitate effective and efficient mutual enhancement between the dual tasks, we propose a novel Fourier Transform-based Attention Module (FTAM). In addition, we incorporate an Edge-Guided Module (EGM) into the text segmentation branch to better erase the text boundary regions and generate natural-looking images. Extensive experiments demonstrate that the DINet achieves state-of-the-art performances on several benchmarks. Furthermore, the ablation studies indicate the effectiveness and efficiency of our proposed modules in DINet.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Ran Gong",
            "country": ""
        },
        {
            "name": "Anna Zhu",
            "country": ""
        },
        {
            "name": "Kun Liu",
            "country": ""
        }
    ],
    "keywords": []
}