{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885606002848",
    "title": "EM enhancement of 3D head pose estimated by point at infinity",
    "abstract": "Head pose estimation  is a key task for visual surveillance, HCI and  face recognition  applications. In this paper, a new approach is proposed for estimating 3D head pose from a monocular image. The approach assumes the full perspective projection camera model. Our approach employs general prior knowledge of face structure and the corresponding geometrical constraints provided by the location of a certain vanishing point to determine the pose of human faces. To achieve this, eye-lines, formed from the far and near eye corners, and mouth-line of the mouth corners are assumed parallel in 3D space. Then the vanishing point of these  parallel lines  found by the intersection of the eye-line and mouth-line in the image can be used to infer the 3D orientation and location of the human face. In order to deal with the variance of the facial model parameters, e.g. ratio between the eye-line and the mouth-line, an EM framework is applied to update the parameters. We first compute the 3D pose using some initially learnt parameters (such as ratio and length) and then adapt the parameters statistically for individual persons and their facial expressions by minimizing the residual errors between the projection of the model features points and the actual features on the image. In doing so, we assume every facial feature point can be associated to each of features points in 3D model with some  a posteriori  probability. The expectation step of the  EM algorithm  provides an iterative framework for computing the  a posterori  probabilities using  Gaussian  mixtures defined over the parameters. The robustness analysis of the algorithm on synthetic data and some real images with known ground-truth are included.",
    "citation_count": "91",
    "year": "2007/12/03",
    "authors": [
        {
            "name": "Jian-Gang Wang",
            "country": ""
        },
        {
            "name": "Eric Sung",
            "country": ""
        }
    ],
    "keywords": []
}