{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885617300495",
    "title": "Estimation of measurement uncertainty in stereo vision system",
    "abstract": "Stereo vision  systems are becoming increasingly popular and widespread. These systems are widely used in many applications, such as navigation of autonomous mobile robots, 3D measurements, object tracking, the movie industry,  augmented reality  or people tracking and identification systems. Surprisingly, in the literature, little attention is paid to practical verification procedures in which proper operation of the calibrated stereo vision system can be demonstrated. Therefore, in this paper, a novel approach is proposed that allows accurate estimation of the measurement uncertainty of the ( x , y , z ) coordinates reconstructed by the stereo vision system. The proposed method does not require any additional equipment beyond the standard calibration board and a general-purpose laser distance meter. The authors introduce a simulation model and mathematical formulas that can be employed to determine the accuracy of the stereo vision system precisely along each of the  X ,  Y  and  Z  axes. The measurement uncertainties obtained are statistically reliable because they are calculated with the use of a large amount of data. A series of experiments are conducted to confirm the correctness of the presented approach and to demonstrate how to apply the developed solution in practical applications. The proposed method can be easily integrated with both newly created and existing solutions because it does not require the introduction of any modifications in the system structure and calibration process.",
    "citation_count": "45",
    "year": "2017/05/01",
    "authors": [
        {
            "name": "W. Sankowski",
            "country": ""
        },
        {
            "name": "M. Włodarczyk",
            "country": ""
        },
        {
            "name": "D. Kacperski",
            "country": ""
        },
        {
            "name": "K. Grabowski",
            "country": ""
        }
    ],
    "keywords": []
}