{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623000835",
    "title": "Extended neighborhood-based road and median filter for impulse noise removal from depth map",
    "abstract": "In recent years there has been growing interest in the study of depth map's impulse noise detection and removal. The Rank-ordered Absolute Differences (ROAD) based on neighborhood statistics can effectively detect impulse noise for  RGB images . However, since the statistical object of the ROAD is each pixel value in the neighborhood, and the neighborhood may contain other impulse noise, invalid depth zero-pixel points and other  singular points , especially for large areas with depth missing, it is difficult for the algorithm to ensure the correctness and accuracy of the detection results. Therefore, the ROAD algorithm is not fully applicable to depth maps. Similarly, the  median filter , as an effective impulse noise  filtering algorithm , also has the same deficiency, so it is not suitable for areas in depth maps with no depth value. To address these issues, we present here an Extended Neighborhood-based ROAD and Median Filter algorithm to remove impulse noise from depth map. This approach improves the functionality of the ROAD algorithm and the Median Filter by extending the neighborhood of the current pixel adaptively, shielding zero-valued pixels and filtering out detected impulse noises in real time during detection, therefore effectively improving the accuracy of impulse noise filtering. It consequently reduces the miss rate and the error detection rate, and ultimately achieves a better edge-preserving and denoising effect. Our empirical evidence shows that the proposed algorithm outperforms existing denoising algorithms on both quantitative measures and visual perception qualities.",
    "citation_count": "9",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Shuaihao Li",
            "country": ""
        },
        {
            "name": "Xiang Bi",
            "country": ""
        },
        {
            "name": "Yajun Zhao",
            "country": ""
        },
        {
            "name": "Hongliang Bi",
            "country": ""
        }
    ],
    "keywords": []
}