{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885612001837",
    "title": "Face verification of age separated images under the influence of internal and external factors",
    "abstract": "In this paper we study the task of  face verification  of age-separated images with the presence of various internal and external factors. We propose a hierarchical  local binary pattern  (HLBP)  feature descriptor  for robust face representation across age. The effective representation by HLBP across minimal age, illumination, and expression variations combined with its hierarchical computation provides a discriminative representation of the face image. The proposed face descriptor is combined with an  AdaBoost  classification framework to model the face verification task as a two-class problem. Experimental results on the FG-NET and MORPH aging datasets indicate that the performance of the proposed framework is robust with respect to images of both adults and children. A detailed empirical analysis on the effects of internal (age gap, gender, and ethnicity) and external (pose, expressions, facial hair, and glasses) factors in the face verification performance is also studied. The results indicate that the verification accuracy reduces as the age gap between the image pair increases. A  quantitative comparison  on the effects of gender on verification performance by both humans and the proposed  machine learning approach  is provided. The analysis indicate that the cues aid humans in verifying image pairs with large age gaps, while it aids machines for all age gaps. However, the cues mislead humans in the case of images of children and extra-personal pairs with large age gaps. Our analyses indicate that the pose and expression variations affect the performance, despite training with such variations, while facial hair and glasses act as discriminative cues. A study on the effects of ethnicity indicate that non-linear algorithms have insignificant effect in performance with the use of both generalized and individual ethnicity models when compared with linear algorithms.",
    "citation_count": "11",
    "year": "2012/12/01",
    "authors": [
        {
            "name": "Gayathri Mahalingam",
            "country": ""
        },
        {
            "name": "Chandra Kambhamettu",
            "country": ""
        }
    ],
    "keywords": []
}