{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885620300895",
    "title": "Feature based video stabilization based on boosted HAAR Cascade and representative point matching algorithm",
    "abstract": "The success of handheld video capturing devices has further fueled the need of improved video stabilization. The videos often contain many foreground  facial features  like eyes, nose etc. These foreground features can be considered as feature points and may be used to stabilize videos. This paper proposes an innovative and effective digital video stabilization technique, which utilizes foreground features present in the video to produce consistent and stabilized output. It uses successive stages of Boosted HAAR cascade and  representative point  matching digital motion stabilization algorithm to identify and stabilize the video. The feature based tracking of object improves motion estimation accuracy between two frames thereby increasing the correlation calculation and compensation  motion vector . This work achieves a significantly smoother sequence after the motion compensation. It also improves the robustness, precision and quality of the video when compared to traditional digital stabilization algorithms. The simulation results compared with pre-existing techniques reflect distinct improvements in Inter-Frame Transformation Fidelity values and  Structural Similarity  Index along with lesser standard deviation between image frames.",
    "citation_count": "23",
    "year": "2020/09/01",
    "authors": [
        {
            "name": "Rohit Raj",
            "country": ""
        },
        {
            "name": "Pooshkar Rajiv",
            "country": ""
        },
        {
            "name": "Prabhat Kumar",
            "country": ""
        },
        {
            "name": "Manju Khari",
            "country": ""
        },
        {
            "name": "Elena Verdú",
            "country": ""
        },
        {
            "name": "Rubén González Crespo",
            "country": ""
        },
        {
            "name": "Gunasekaran Manogaran",
            "country": ""
        }
    ],
    "keywords": []
}