{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624004025",
    "title": "Global information regulation network for multimodal sentiment analysis",
    "abstract": "Human language is considered multimodal, containing natural language, visual elements, and acoustic signals. Multimodal Sentiment Analysis (MSA) concentrates on the integration of various modalities to capture the sentiment polarity or intensity expressed in human language. Nevertheless, the absence of a comprehensive strategy for processing and integrating multimodal representations results in the inclusion of inaccurate or noisy data from diverse modalities in the ultimate decision-making process, potentially leading to the neglect of crucial information within or across modalities. To address this issue, we propose the Global Information Regulation Network (GIRN), a novel framework designed to regulate information flow and decision-making processes across various stages, ranging from unimodal feature extraction to multimodal outcome prediction. Specifically, before modal fusion stage, we maximize the mutual information between modalities and refine the input signals through random feature erasing, yielding a more robust unimodal representation. In the process of modal fusion, we enhance the traditional Transformer encoder through the gate mechanism and stacked attention to dynamically fuse the target and auxiliary modalities. After modal fusion, cross-hierarchical contrastive learning and decision gate are employed to integrate the valuable information represented in different categories and hierarchies. Extensive experiments conducted on the CMU-MOSI and CMU-MOSEI datasets suggest that our methodology outperforms existing approaches across nearly all criteria.",
    "citation_count": "0",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Shufan Xie",
            "country": ""
        },
        {
            "name": "Qiaohong Chen",
            "country": ""
        },
        {
            "name": "Xian Fang",
            "country": ""
        },
        {
            "name": "Qi Sun",
            "country": ""
        }
    ],
    "keywords": []
}