{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621001943",
    "title": "Graph-based reasoning attention pooling with curriculum design for content-based image retrieval",
    "abstract": "Global single-pass methods have shown superior efficiency over local aggregation methods on content-based image retrieval. However, they tend to fail under challenging environments since the structural relations among regions are not exploited. To address this issue, we propose a novel Graph-based Reasoning Attention Pooling with Curriculum Design (GRAP-CD) to improve the network capability through training modification and trainable pooling. GRAP-CD can not only explore relations among salient regions but also gradually train the network to achieve better local minima. The graph-based reasoning layers regard the feature map from the last convolution layer as a graph and construct the structural relations. Then the graph-based attention layer enhances the key information guided by the relations. Besides, a front-end curriculum design is introduced to split the training dataset from simple to complex and train the model step by step, which further helps the GRAP firstly learn the basic feature information from simple samples and then learn to dig the more representative features with hard positive samples. Experimental results on popular benchmarks  R Oxford and  R Paris datasets achieve improvement over state-of-the-art global single-pass methods and competitive results with local aggregation methods.",
    "citation_count": "8",
    "year": "2021/11/01",
    "authors": [
        {
            "name": "Xiaoguang Zhu",
            "country": ""
        },
        {
            "name": "Haoyu Wang",
            "country": ""
        },
        {
            "name": "Peilin Liu",
            "country": ""
        },
        {
            "name": "Zhantao Yang",
            "country": ""
        },
        {
            "name": "Jiuchao Qian",
            "country": ""
        }
    ],
    "keywords": []
}