{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624002336",
    "title": "Hierarchical slice interaction and multi-layer cooperative decoding networks for remote sensing image dehazing",
    "abstract": "Recently, U-shaped neural networks have gained widespread application in  remote sensing   image dehazing  and achieved promising performance. However, most of the existing U-shaped dehazing networks neglect the global and local information interaction across layers during the encoding phase, which leads to incomplete utilization of the extracted features for image restoration. Moreover, in the process of image reconstruction, utilizing only the information from the terminal layers of the decoding phase for haze-free image restoration leads to a dilution of semantic information, resulting in color and texture deviations in the dehazed image. To address these issues, We propose a Hierarchical Slice Interaction and Multi-layer Cooperative Decoding Networks for Remote Sensing Image dehazing (HSMD-Net). Specifically, a hierarchical slice information interaction module (HSIIM) is proposed to introduce Intra-layer feature  autocorrelation  and Inter-layer feature cross-correlation to facilitate global and local information interaction across layers, thereby enhancing the encoding features representation capability and improving the network dehazing performance. Furthermore, a multi-layer cooperative decoding reconstruction module (MCDRM) is proposed to fully utilize feature information in each decoding layer, mitigate semantic information dilution, and improve the network capability to restore image colors and textures. Experimental results demonstrate that our HSMD-Net outperforms several state-of-the-art methods in dehazing on two publicly available datasets. The  source code  is available at  https://github.com/xushouyi1/HSMD-Net .",
    "citation_count": "2",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Mei Yu",
            "country": ""
        },
        {
            "name": "ShouYi Xu",
            "country": ""
        },
        {
            "name": "Hang Sun",
            "country": ""
        },
        {
            "name": "YueLin Zheng",
            "country": ""
        },
        {
            "name": "Wen Yang",
            "country": ""
        }
    ],
    "keywords": []
}