{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619301258",
    "title": "Image fusion method based on spatially masked convolutional sparse representation",
    "abstract": "The technique of  sparse representation  (SR) has achieved enormous successes in multi-source image fusion. However, using SR-based fusion methods, there exists the  performance degradation  in limited detail preservation caused by the independent processing of image patches. To remedy this deficiency, in this paper, a novel method based on spatially masked convolutional sparse representation (SMCSR-based) is proposed for image fusion, which is composed of three steps as follows. Firstly, low-frequency and high-frequency bands are separated from each source image by the designed two-scale gradient optimization approach. Secondly, the SMCSR model is employed to fuse the high-frequency bands, and the “average\" rule is applied to the combination of the low-frequency bands. At last, the fused image is reconstructed. Compared with traditional SR-based algorithms, the proposed SMCSR-based method is focused on entire images instead of those divided patches to reduce detail-loss. In addition, this method can overcome the difficulty in the selection of  decomposition levels  originated by multi-scale transform (MST) based fusion strategies, as well as also suppress the boundary artifacts produced by the traditional convolutional sparse representation (CSR) model. Extensive experiments and related analysis are given to verify the effectiveness of the proposed SMCSR-based fusion method.",
    "citation_count": "16",
    "year": "2019/10/01",
    "authors": [
        {
            "name": "Changda Xing",
            "country": ""
        },
        {
            "name": "Zhisheng Wang",
            "country": ""
        },
        {
            "name": "Quan Ouyang",
            "country": ""
        },
        {
            "name": "Chong Dong",
            "country": ""
        },
        {
            "name": "Chaowei Duan",
            "country": ""
        }
    ],
    "keywords": []
}