{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002603",
    "title": "Improved SiamCAR with ranking-based pruning and optimization for efficient UAV tracking",
    "abstract": "UAV  tracking is a burgeoning task with vast application prospects in various fields such as agriculture, navigation, and public safety. However, the computational constraints and limited processing speed of drones hinder the deployment of Siamese tracking algorithms. In order to better apply tracking algorithms to drone devices, this paper proposes a novel Ranking-Based SiamCAR (RB-SiamCAR) tracker. The RB-SiamCAR tracker achieves  model compression  by utilizing a ranking-based filter pruning method, which sorts the filters in the  backbone network  based on their importance and prunes the filters with low ranks for efficient feature extraction. Additionally, considering existing Siamese trackers overlook the correlation between positive and negative samples and the coherence between classification and localization, we introduce two ranking-based losses. The classification ranking loss ensures that the ranking of positive samples is higher than that of hard negative samples, allowing the tracker to successfully select foreground samples without being fooled by distractors. The IoU-guided ranking loss aims to align the classification with the intersection over union (IoU) of the corresponding localizations of positive samples, enabling well-localized predictions to be represented by high classification confidence. To further enhance the tracking performance, we employ an effective channel attention module (ECA) that allows the network to automatically learn and focus on the most important channels for capturing more  discriminative features . Experimental evaluations on  UAV tracking  benchmarks demonstrate that the proposed RB-SiamCAR outperforms existing state-of-the-art trackers. It is noteworthy that our RB-SiamCAR achieves an impressive tracking speed of nearly 100 fps. The experimental results validate its effectiveness and efficiency in  UAV  tracking applications.",
    "citation_count": "8",
    "year": "2024/01/01",
    "authors": [
        {
            "name": "Xiaoqiang Jin",
            "country": ""
        },
        {
            "name": "Dawei Zhang",
            "country": ""
        },
        {
            "name": "Qiner Wu",
            "country": ""
        },
        {
            "name": "Xin Xiao",
            "country": ""
        },
        {
            "name": "Pengsen Zhao",
            "country": ""
        },
        {
            "name": "Zhonglong Zheng",
            "country": ""
        }
    ],
    "keywords": []
}