{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621001463",
    "title": "Learning auto-scale representations for person re-identification",
    "abstract": "Person re-identification (ReID) is a hot topic in  computer vision . The data in the  ReID  is often collected from the cameras with different views and is affected by other environmental factors, which poses a significant challenge to ReID. The omni-scales proposed by OSNet can extract  discriminative feature  representations, which shows that omni-scales are adequate for the task of the ReID. However, the OSNet is mainly based on a manually designed  network architecture . In the OSnet, each block uses the same architecture and has only four scale feature representations. Inspired by  neural network architecture  search (NAS), we propose a method of auto-scale representations for ReID. Specifically, we first design the auto-scale block, mainly composed of the Lite 3 × 3 operations and the RCB 1 × 1 operations. The connection status among the Lite 3 × 3 operations is just our  search space . Then we give our entire macro network architecture, the auto-scale network, which is mainly composed of 6 auto-scale blocks. Unlike other NAS-related work, each block in our search space does not need to share the same architecture but can maintain a different architecture. In the search process, we propose the entropy  regularization , the validity  regularization  and the consistent regularization to alleviate the discretized gap, no valid path, and meaningless edges, respectively. Finally, we verify the effectiveness of the model we searched on four commonly used datasets. Our model can maintain the same 2.2 M parameters as OSNet but can achieve the performance of SOTA. The  mAP  on the Market1501 dataset can reach 88.7%.",
    "citation_count": "2",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Hongyang Gu",
            "country": ""
        },
        {
            "name": "Guangyuan Fu",
            "country": ""
        },
        {
            "name": "Xu Wang",
            "country": ""
        },
        {
            "name": "Jun Zhu",
            "country": ""
        }
    ],
    "keywords": []
}