{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003172",
    "title": "Multi-scale large kernel convolution and hybrid attention network for remote sensing image dehazing",
    "abstract": "Remote sensing (RS) image dehazing holds significant importance in enhancing the quality and information extraction capability of RS imagery. The enhancement in image dehazing quality has progressively advanced alongside the evolution of convolutional neural network (CNN). Due to the fixed receptive field of CNN, there is insufficient utilization of contextual information on haze features in multi-scale RS images. Additionally, the network fails to adequately extract both local and global information of haze features. In addressing the above problems, in this paper, we propose an RS image dehazing network based on multi-scale large kernel convolution and hybrid attention (MKHANet). The network is mainly composed of multi-scale large kernel convolution (MSLKC) module, hybrid attention (HA) module and feature fusion attention (FFA) module. The MSLKC module fully fuses the multi-scale information of features while enhancing the effective receptive field of the network by parallel multiple large kernel convolutions. To alleviate the problem of uneven distribution of haze and effectively extract the global and local information of haze features, the HA module is introduced by focusing on the importance of haze pixels at the channel level. The FFA module aims to boost the interaction of feature information between the network's deep and shallow layers. The subjective and objective experimental results on on multiple RS hazy image datasets illustrates that MKHANet surpasses existing state-of-the-art (SOTA) approaches. The source code is available at  https://github.com/tohang98/MKHA_Net .",
    "citation_count": "0",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Hang Su",
            "country": ""
        },
        {
            "name": "Lina Liu",
            "country": ""
        },
        {
            "name": "Zenghui Wang",
            "country": ""
        },
        {
            "name": "Mingliang Gao",
            "country": ""
        }
    ],
    "keywords": []
}