{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001993",
    "title": "Multi-layer capsule network with joint dynamic routing for fire recognition",
    "abstract": "Fire recognition has emerged as a critical concern in the field of fire safety.  Deep learning  techniques, specifically  convolutional neural networks  (CNNs), have found  widespread application  in fire recognition tasks. The capsule network, a higher-level variant of CNN, offers distinct advantages in terms of enhanced  recognition accuracy , making it suitable for fire recognition applications. However, the capsule network  faces  challenges in effectively determining the presence or absence of fire objects due to the idiosyncrasies of its dynamic  routing algorithm . To address this issue and enable effective fire recognition, we propose a novel approach that involves a multi-layer capsule network. Within this framework, we introduce a  joint  dynamic  routing algorithm  that computes output values during  forward propagation  within the multi-layer capsule network. Additionally, we present a new loss function and a fully connected  auxiliary  training layer designed to train the multi-layer capsule networks effectively.  Comparative evaluations  against conventional  CNN architectures  and recent state-of-the-art fire recognition methods demonstrate that the enhanced multi-layer capsule network achieves higher test accuracy, even with limited  training samples  and fewer training iterations. Furthermore, owing to its reduced model  parameter scale , the multi-layer capsule network exhibits faster recognition speeds compared to the aforementioned methods.",
    "citation_count": "6",
    "year": "2023/11/01",
    "authors": [
        {
            "name": "Yuming Wu",
            "country": ""
        },
        {
            "name": "Lihui Cen",
            "country": ""
        },
        {
            "name": "Shichao Kan",
            "country": ""
        },
        {
            "name": "Yongfang Xie",
            "country": ""
        }
    ],
    "keywords": []
}