{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885625000587",
    "title": "Multi-information guided camouflaged object detection",
    "abstract": "Camouflaged Object Detection (COD) aims to identify the objects hidden in the background environment. Though more and more COD methods have been proposed in recent years, existing methods still perform poorly for detecting small objects, obscured objects, boundary-rich objects, and multi-objects, mainly because they fail to effectively utilize context information, texture information, and boundary information simultaneously. Therefore, in this paper, we propose a Multi-information Guided Camouflaged Object Detection Network (MIGNet) to fully utilize multi-information containing context information, texture information, and boundary information to boost the performance of camouflaged object detection. Specifically, firstly, we design the texture and boundary label and the Texture and Boundary Enhanced Module (TBEM) to obtain differentiated texture information and boundary information. Next, the Neighbor Context Information Exploration Module (NCIEM) is designed to obtain rich multi-scale context information. Then, the Parallel Group Bootstrap Module (PGBM) is designed to maximize the effective aggregation of context information, texture information and boundary information. Finally, Information Enhanced Decoder (IED) is designed to effectively enhance the interaction of neighboring layer features and suppress the background noise for good detection results. Extensive quantitative and qualitative experiments are conducted on four widely used datasets. The experimental results indicate that our proposed MIGNet with good performance of camouflaged object detection outperforms the other 22 COD models.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Caijuan Shi",
            "country": ""
        },
        {
            "name": "Lin Zhao",
            "country": ""
        },
        {
            "name": "Rui Wang",
            "country": ""
        },
        {
            "name": "Kun Zhang",
            "country": ""
        },
        {
            "name": "Fanyue Kong",
            "country": ""
        },
        {
            "name": "Changyu Duan",
            "country": ""
        }
    ],
    "keywords": []
}