{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624000350",
    "title": "Multi-branch residual image semantic segmentation combined with inverse weight gated-control",
    "abstract": "The loss of pixel-level information in the multi-class  segmentation task  based on the U-net model results in unclear boundaries and low  semantic segmentation  accuracy. Aiming at this, a deep multi-branch residual Unet (IWG-MRUN) with fused inverse weight gated-control is proposed to improve the quality of image semantic segmentation. Specifically, we first introduce a deep multi-branch residual module, which used parallel convolution mode to capture the contextual feature to extract the detailed features of the input image at a deeper level. Then, we adopt an inverse weight gated-control module to enhance the diversity of up-sampling information by counterclockwise transmitting attention horizontally to improve the restoration accuracy of up-sampled image pixels. Finally, to obtain finer  granularity  features from low spatial resolution images, we adopt the different receptive field pyramid  attention mechanisms  at the highest level of the U-shaped encoder to capture high-level context information at different scales, thereby improving the accuracy of semantic segmentation. The experimental results show that the  segmentation accuracy  of the proposed algorithm reaches 91.80% and the CCE loss is reduced to 0.21. When compared to the Unet, BiSeNet, DeeplabV3   + and U-net + BLR model, the pixel accuracy of semantic segmentation is improved by 15.0%, 1.98%, 0.9% and 6.5%, respectively. The semantic  segmentation model  proposed in this paper provides an end-to-end semantic segmentation capability with the enriched  finer granularity  features of the target boundary and realizes the accurate segmentation of the objects in different categories.",
    "citation_count": "2",
    "year": "2024/03/01",
    "authors": [
        {
            "name": "Haicheng Qu",
            "country": ""
        },
        {
            "name": "Xiaona Wang",
            "country": ""
        },
        {
            "name": "Ying Wang",
            "country": ""
        },
        {
            "name": "Yao Chen",
            "country": ""
        }
    ],
    "keywords": []
}