{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624004396",
    "title": "Non-negative subspace feature representation for few-shot learning in medical imaging",
    "abstract": "Unlike typical visual scene recognition tasks, where massive datasets are available to train deep neural networks (DNNs), medical image diagnosis using DNNs often faces challenges due to data scarcity. In this paper, we investigate the effectiveness of data-based few-shot learning in medical imaging by exploring different data attribute representations in a low-dimensional space. We introduce different types of non-negative matrix factorization (NMF) in few-shot learning to investigate the information preserved in the subspace resulting from dimensionality reduction, which is crucial to mitigate the data scarcity problem in medical image classification. Extensive empirical studies are conducted in terms of validating the effectiveness of NMF, especially its supervised variants (e.g., discriminative NMF, and supervised and constrained NMF with sparseness), and the comparison with principal component analysis (PCA), i.e., the collaborative representation-based dimensionality reduction technique derived from eigenvectors. With 14 different datasets covering 11 distinct illness categories, thorough experimental results and comparison with related techniques demonstrate that NMF is a competitive alternative to PCA for few-shot learning in medical imaging, and the supervised NMF algorithms are more discriminative in the subspace with greater effectiveness. Furthermore, we show that the part-based representation of NMF, especially its supervised variants, is dramatically impactful in detecting lesion areas in medical imaging with limited samples.",
    "citation_count": "0",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Keqiang Fan",
            "country": ""
        },
        {
            "name": "Xiaohao Cai",
            "country": ""
        },
        {
            "name": "Mahesan Niranjan",
            "country": ""
        }
    ],
    "keywords": []
}