{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616302049",
    "title": "Non-convex regularized self-representation for unsupervised feature selection",
    "abstract": "Feature selection aims to select a subset of features to decrease time complexity, reduce storage burden and improve the  generalization ability  of classification or clustering. For the countless unlabeled  high dimensional data , unsupervised feature selection is effective in alleviating the curse of dimensionality and can find applications in various fields. In this paper, we propose a non-convex regularized self-representation (RSR) model where features can be represented by a  linear combination  of other features, and propose to impose  L 2, p -norm (0 ≤  p  < 1)  regularization  on self-representation coefficients for unsupervised feature selection. Compared with the conventional  L 2,1 -norm  regularization , when  p  < 1, much  sparser solution  is obtained on the self-representation coefficients, and it is also more effective in selecting  salient features . To solve the non-convex (0 <  p  < 1) RSR model, we further propose an efficient iterative reweighted  least square  (IRLS) algorithm with guaranteed convergence to a stationary point. When  p   =   0, we exploit the augmented  Lagrangian method  (ALM) to solve the RSR model. Extensive experimental results on nine datasets show that our feature selection method with small  p  is more effective. It mostly outperforms RSR with  p   =   1 and other state-of-the-art unsupervised feature selection methods in terms of  classification accuracy  and clustering performance.",
    "citation_count": "36",
    "year": "2017/04/01",
    "authors": [
        {
            "name": "Pengfei Zhu",
            "country": ""
        },
        {
            "name": "Wencheng Zhu",
            "country": ""
        },
        {
            "name": "Weizhi Wang",
            "country": ""
        },
        {
            "name": "Wangmeng Zuo",
            "country": ""
        },
        {
            "name": "Qinghua Hu",
            "country": ""
        }
    ],
    "keywords": []
}