{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885621000263",
    "title": "Novel features for art movement classification of portrait paintings",
    "abstract": "The increasing availability of extensive digitized fine art collections opens up new research directions. In particular, correctly identifying the artistic style or art movement of paintings is crucial for large artistic database indexing, painter authentication, and mobile recognition of painters. Even though the implementation of CNN on artwork classification improved the performance dramatically compared to tradition classifier, the feature extraction methods are still valuable to help establishing better image representation for both common classifiers and neural networks. The main goal of this article is to present three novel features and a mature model structure for artistic movement recognition of portrait paintings. The proposed features include two unique color features and one texture feature: (a) Modified Color Distance (MCD), (b) ColorRatio Feature and (c) Weber's law Based Texture Feature. We demonstrate the superiority of our proposed method over the state-of-the-art approaches, and how successful our features are to support features from various neural networks. Another contribution of our work is a new portrait database that consists of 927 paintings from 6 different art movements. Extensive computer evaluations on this database show that we achieved an average accuracy of 98% for classifying two categories and 82.6% for classifying all 6 categories. Besides, our novel features improved the performance of pre-trained CNN significantly.",
    "citation_count": "24",
    "year": "2021/04/01",
    "authors": [
        {
            "name": "Shao Liu",
            "country": ""
        },
        {
            "name": "Jiaqi Yang",
            "country": ""
        },
        {
            "name": "Sos S. Agaian",
            "country": ""
        },
        {
            "name": "Changhe Yuan",
            "country": ""
        }
    ],
    "keywords": []
}