{
    "url": "https://www.sciencedirect.com/science/article/pii/S026288562200244X",
    "title": "Object detection via inner-inter relational reasoning network",
    "abstract": "Exploiting relationships between objects and (or) labels under graph message passing mechanism to facilitate object detection has been widely investigated in recent years. However, these methods heavily rely on hand-crafted graph structures, which may introduce unreliable relationships and in turn hurt the object detection performance. Aiming to address this issue, we propose a novel object detection framework that fully explores the  relational representations  for objects and labels under a full attention architecture. Specifically, we directly regard the extracted proposals and candidate labels as two  independent sets  in visual  feature space  and label embedding space, respectively. And we design a self-attention module to discover the inner-relationships within the visual feature space or label embedding space. In addition, a cross-attention module is developed to explore the inter-relationships between the two spaces. Furthermore, both the inner-relationships and inter-relationships are utilized to enhance the object features and label embedding representations to facilitate the object detection. To validate the proposed framework in improving object detection performance, we embed it into several state-of-the-art baselines and perform extensive experiments on two public benchmarks (named Pascal VOC and COCO 2017). The experimental results demonstrate the effectiveness and flexibility of the proposed framework.",
    "citation_count": "5",
    "year": "2023/02/01",
    "authors": [
        {
            "name": "He Liu",
            "country": ""
        },
        {
            "name": "Xiuting You",
            "country": ""
        },
        {
            "name": "Tao Wang",
            "country": ""
        },
        {
            "name": "Yidong Li",
            "country": ""
        }
    ],
    "keywords": []
}