{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885618300659",
    "title": "On the generalization of color texture-based face anti-spoofing",
    "abstract": "Despite the significant attention given to the problem of face spoofing, we still lack generalized  presentation attack detection  (PAD) methods performing robustly in practical face recognition systems. The existing face anti-spoofing techniques have indeed achieved impressive results when trained and evaluated on the same database (i.e. intra-test protocols). Cross-database experiments have, however, revealed that the performance of the state-of-the-art methods drops drastically as they fail to cope with new attacks scenarios and other operating conditions that have not been seen during training and development phases. So far, even the popular  convolutional neural networks  (CNN) have failed to derive well-generalizing features for face anti-spoofing. In this work, we explore the effect of different factors, such as acquisition conditions and presentation attack instrument (PAI) variation, on the generalization of color texture-based face anti-spoofing. Our extensive cross-database evaluation of seven color texture-based methods demonstrates that most of the methods are unable to generalize to unseen  spoofing attack  scenarios. More importantly, the experiments show that some facial color texture representations are more robust to particular PAIs than others. From this observation, we propose a face PAD solution of attack-specific countermeasures based solely on color texture analysis and investigate how well it generalizes under display and print attacks in different conditions. The evaluation of the method combining attack-specific detectors on three benchmark face anti-spoofing databases showed remarkable  generalization ability  against display attacks while print attacks require still further attention.",
    "citation_count": "67",
    "year": "2018/09/01",
    "authors": [
        {
            "name": "Zinelabidine Boulkenafet",
            "country": ""
        },
        {
            "name": "Jukka Komulainen",
            "country": ""
        },
        {
            "name": "Abdenour Hadid",
            "country": ""
        }
    ],
    "keywords": []
}