{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623002366",
    "title": "Open-set face recognition with maximal entropy and Objectosphere loss",
    "abstract": "Open-set  face recognition  characterizes a scenario where unknown individuals, unseen during the training and enrollment stages, appear on operation time. This work concentrates on watchlists, an open-set task that is expected to operate at a low false-positive identification rate and generally includes only a few enrollment samples per identity. We introduce a compact adapter network that benefits from additional  negative  face images when combined with distinct  cost functions , such as Objectosphere Loss (OS) and the proposed Maximal Entropy Loss (MEL). MEL modifies the traditional Cross-Entropy loss in favor of increasing the entropy for negative samples and attaches a penalty to known target classes in pursuance of gallery specialization. The proposed approach adopts pre-trained  deep neural networks  (DNNs) for face recognition as feature extractors. Then, the adapter network takes deep feature representations and acts as a substitute for the output layer of the pre-trained DNN in exchange for an agile  domain adaptation . Promising results have been achieved following open-set protocols for three different datasets: LFW, IJB-C, and UCCS as well as state-of-the-art performance when supplementary negative data is properly selected to fine-tune the adapter network.",
    "citation_count": "6",
    "year": "2024/01/01",
    "authors": [
        {
            "name": "Rafael Henrique Vareto",
            "country": ""
        },
        {
            "name": "Yu Linghu",
            "country": ""
        },
        {
            "name": "Terrance Edward Boult",
            "country": ""
        },
        {
            "name": "William Robson Schwartz",
            "country": ""
        },
        {
            "name": "Manuel Günther",
            "country": ""
        }
    ],
    "keywords": []
}