{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003457",
    "title": "Probability based dynamic soft label assignment for object detection",
    "abstract": "By defining effective supervision labels for network training, the performance of object detectors can be improved without incurring additional inference costs. Current label assignment strategies generally require two steps: first, constructing a positive sample candidate bag, and then designing labels for these samples. However, the construction of candidate bag of positive samples may result in some noisy samples being introduced into the label assignment process. We explore a single-step label assignment approach: directly generating a probability map as labels for all samples. We design the label assignment approach from the following perspectives: Firstly, it should be able to reduce the impact of noise samples. Secondly, each sample should be treated differently because each one matches the target to a different extent, which assists the network to learn more valuable information from high-quality samples. We propose a probability-based dynamic soft label assignment method. Instead of dividing the samples into positive and negative samples, a probability map, which is calculated based on prediction quality and prior knowledge, is used to supervise all anchor points of the classification branch. The weight of prior knowledge in the labels decreases as the network improves the quality of instance predictions, as a way to reduce noise samples introduced by prior knowledge. By using continuous probability values as labels to supervise the classification branch, the network is able to focus on high-quality samples. As demonstrated in the experiments on the MS COCO benchmark, our label assignment method achieves 40.9% AP in the ResNet-50 under 1x schedule, which improves FCOS performance by approximately 2.0% AP. The code has been available at  https://github.com/Liyi4578/PDSLA .",
    "citation_count": "0",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Yi Li",
            "country": ""
        },
        {
            "name": "Sile Ma",
            "country": ""
        },
        {
            "name": "Xiangyuan Jiang",
            "country": ""
        },
        {
            "name": "Yizhong Luan",
            "country": ""
        },
        {
            "name": "Zecui Jiang",
            "country": ""
        }
    ],
    "keywords": []
}