{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003238",
    "title": "Reverse cross-refinement network for camouflaged object detection",
    "abstract": "Due to the high intrinsic similarity between camouflaged objects and the background, camouflaged objects often exhibit blurred boundaries, making it challenging to distinguish the boundaries of objects. Existing methods still focus on the overall regional accuracy but not on the boundary quality and are not competent to identify camouflaged objects from the background in complex scenarios. Thus, we propose a novel reverse cross-refinement network called RCR-Net. Specifically, we design a diverse feature enhancement module that simulates the correspondingly expanded receptive fields of the human visual system by using convolutional kernels with different dilation rates in parallel. Also, the boundary attention module is used to reduce the noise of the bottom features. Moreover, a multi-scale feature aggregation module is proposed to transmit the diverse features from pixel-level camouflaged edges to the entire camouflaged object region in a coarse-to-fine manner, which consists of reverse guidance, group guidance, and position guidance. Reverse guidance mines complementary regions and details by erasing already estimated object regions. Group guidance and position guidance integrate different features through simple and effective splitting and connecting operations. Extensive experiments show that RCR-Net outperforms the existing 18 state-of-the-art methods on four widely-used COD datasets. Especially, compared with the existing top-1 model HitNet, RCR-Net significantly improves the performance by ∼   16.4% (Mean Absolute Error) on the CAMO dataset, showing that RCR-Net could accurately detect camouflaged objects.",
    "citation_count": "0",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Qian Ye",
            "country": ""
        },
        {
            "name": "Yaqin Zhou",
            "country": ""
        },
        {
            "name": "Guanying Huo",
            "country": ""
        },
        {
            "name": "Yan Liu",
            "country": ""
        },
        {
            "name": "Yan Zhou",
            "country": ""
        },
        {
            "name": "Qingwu Li",
            "country": ""
        }
    ],
    "keywords": []
}