{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623000653",
    "title": "Robust visual tracking based on modified mayfly optimization algorithm",
    "abstract": "In this study, MOA is applied to visual target tracking for the first time, and a novel meta-heuristic tracking algorithm with efficiency and precision is obtained. Similar to the common problems of other classical swarm intelligence algorithms, standard MOA faces a high probability of falling into local extremals, early maturity and a low efficiency of a late convergence speed. Therefore, super-MOA, a modified MOA method, is proposed in this study. By designing the updating mechanism, the position and velocity parameters of ephemera are monitored and dynamically adjusted with the iteration degree, and the balance of the global and local optimization process in different iteration stages is improved. A mayfly progeny mutation strategy was proposed to alleviate the prematurity problem of the standard MOA algorithm. Meanwhile, we introduce a chaos algorithm to reconstruct the velocity parameter iteration mechanism, which alleviates the efficiency loss caused by the frequent repeated searching of historical locations by mayflies in standard MOA. In addition, we further understand and improve the parameters such as the dynamic gravitational coefficient and dance coefficient during the courtship flight of mayflies. We also design a frame size adaptive adjustment strategy, which effectively decreases the interference of invalid features. In terms of experiments, we compare this algorithm with other classical trackers from the qualitative, quantitative and statistical perspectives through OTB2015, VOT2018 and typical large-scale benchmarks. Sufficient tracking experiments in various tracking scenes show that our tracker performs great in terms of efficiency, robustness and accuracy.",
    "citation_count": "7",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Yuqi Xiao",
            "country": ""
        },
        {
            "name": "Yongjun Wu",
            "country": ""
        }
    ],
    "keywords": []
}