{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885619300587",
    "title": "Scaled layout recovery with wide field of view RGB-D",
    "abstract": "In this work, we propose a method that integrates depth and fisheye cameras to obtain a wide  3D scene  reconstruction with scale in one single shot. The motivation of such integration is to overcome the narrow field of view in consumer RGB-D cameras and lack of depth and scale information in fisheye cameras. The hybrid camera system we use is easy to build and calibrate, and currently consumer devices with similar configuration are already available in the market. With this system, we have a portion of the scene with shared field of view that provides simultaneously color and depth. In the rest of the color image we estimate the depth by recovering the structural information of the scene. Our method finds and ranks corners in the scene combining the extraction of lines in the color image and the depth information. These corners are used to generate plausible layout hypotheses, which have real-world scale due to the usage of depth. The wide angle camera captures more information from the environment (e.g. the ceiling), which helps to overcome severe occlusions. After an automatic evaluation of the hypotheses, we obtain a scaled 3D model expanding the original depth information with the wide scene reconstruction. We show in our experiments with real images from both home-made and commercial systems that our method achieves high success ratio in different scenarios and that our hybrid camera system outperforms the single color camera set-up while additionally providing scale in one single shot.",
    "citation_count": "1",
    "year": "2019/07/01",
    "authors": [
        {
            "name": "Alejandro Perez-Yus",
            "country": ""
        },
        {
            "name": "Gonzalo Lopez-Nicolas",
            "country": ""
        },
        {
            "name": "Jose J. Guerrero",
            "country": ""
        }
    ],
    "keywords": []
}