{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624004736",
    "title": "Scene flow estimation from point cloud based on grouped relative self-attention",
    "abstract": "3D scene flow estimation is a fundamental task in computer vision, which aims to estimate the 3D motions of point clouds. The point cloud is disordered, and the point density in the local area of the same object is non-uniform. The features extracted by previous methods are not discriminative enough to obtain accurate scene flow. Besides, scene flow may be misestimated when two adjacent frames of point clouds have large movements. From our observation, the quality of point cloud feature extraction and the correlations of two-frame point clouds directly affect the accuracy of scene flow estimation. Therefore, we propose an improved self-attention structure named Grouped Relative Self-Attention (GRSA) that simultaneously utilizes the grouping operation and offset subtraction operation with normalization refinement to process point clouds. Specifically, we embed the Grouped Relative Self-Attention (GRSA) into feature extraction and each stage of flow refinement to gain lightweight but efficient self-attention respectively, which can extract discriminative point features and enhance the point correlations to be more adaptable to long-distance movements. Furthermore, we use a comprehensive loss function to avoid outliers and obtain robust results. We evaluate our method on the FlyingThings3D and KITTI datasets and achieve superior performance. In particular, our method outperforms all other methods on the FlyingThings3D dataset, where Outliers achieves a 16.9% improvement. On the KITTI dataset, Outliers also achieves a 6.7% improvement.",
    "citation_count": "0",
    "year": "2025/02/01",
    "authors": [
        {
            "name": "Xuezhi Xiang",
            "country": ""
        },
        {
            "name": "Xiankun Zhou",
            "country": ""
        },
        {
            "name": "Yingxin Wei",
            "country": ""
        },
        {
            "name": "Xi Wang",
            "country": ""
        },
        {
            "name": "Yulong Qiao",
            "country": ""
        }
    ],
    "keywords": []
}