{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616301500",
    "title": "Semi self-training beard/moustache detection and segmentation simultaneously",
    "abstract": "This paper presents a robust, fully automatic and semi self-training system to detect and segment facial beard/moustache simultaneously in challenging  facial images . Based on the observation that some certain facial areas, e.g. cheeks, do not typically contain any facial hair whereas the others, e.g. brows, often contain facial hair, a self-trained model is first built using a testing image itself. To overcome the limitation of that facial hairs in brows regions and beard/moustache regions are different in length, density, color, etc., a pre-trained model is also constructed using  training data . The pre-trained model is only pursued when the self-trained model produces low confident  classification results . In the proposed system, we employ the  superpixel  together a combination of two classifiers, i.e. Random Ferns (rFerns) and  Support Vector Machines  (SVM) to obtain good classification performance as well as improve time efficiency. A feature vector, consisting of Histogram of Gabor (HoG) and  Histogram of Oriented Gradient  of Gabor (HOGG) at different directions and frequencies, is generated from both the  bounding box  of the superpixel and the super pixel foreground. The segmentation result is then refined by our proposed aggregately searching strategy in order to deal with inaccurate landmarking points. Experimental results have demonstrated the robustness and effectiveness of the proposed system. It is evaluated in images drawn from three entire databases i.e. the Multiple  Biometric   Grand Challenge  (MBGC) still face database, the NIST color  Facial Recognition  Technology FERET database and a large subset from Pinellas County database.",
    "citation_count": "18",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "T. Hoang Ngan Le",
            "country": ""
        },
        {
            "name": "Khoa Luu",
            "country": ""
        },
        {
            "name": "Chenchen Zhu",
            "country": ""
        },
        {
            "name": "Marios Savvides",
            "country": ""
        }
    ],
    "keywords": []
}