{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885623001567",
    "title": "Temporally consistent reconstruction of 3D clothed human surface with warp field",
    "abstract": "Implicit functions are widely used in 3D human surface reconstruction due to their advantage to represent details. However, human reconstruction based on implicit functions struggles to maintain the integrity (unbroken body structure) and accuracy (no non-human parts) of human models. To address these issues, we propose a method, called TCR, for temporally consistent reconstruction of 3D clothed human surface with warp field. The fact that the general shape of a person does not change largely over time inspires us to exploit the temporally consistent shape information from previous frames to refine the human model of current frame. Therefore, we construct a canonical space and then store the shape information by updating the canonical model. To align the observed space with the canonical space, a warp field is firstly estimated for the forward and inverse warping of the human model. A probabilistic fusion strategy is then used to update the canonical model. In addition, the reconstructed result is further refined through the orthogonality constraints between the surface and its normal, which fully exploits the detailed information of estimated normal maps. Experiments on the Adobe and MonoPerfCap datasets show that TCR achieves the state-of-the-art performance. Furthermore, TCR is more robust and can maintain the integrity and accuracy of the reconstructed human body even with extreme poses and partial occlusions.",
    "citation_count": "0",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Yong Deng",
            "country": ""
        },
        {
            "name": "Baoxing Li",
            "country": ""
        },
        {
            "name": "Yehui Yang",
            "country": ""
        },
        {
            "name": "Xu Zhao",
            "country": ""
        }
    ],
    "keywords": []
}