{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885624003676",
    "title": "UAV image object detection based on self-attention guidance and global feature fusion",
    "abstract": "Unmanned aerial vehicle (UAV) image object detection has garnered considerable attentions in fields such as Intelligent transportation, urban management and agricultural monitoring. However, it suffers from key challenges of the deficiency in multi-scale feature extraction and the inaccuracy when processing complex scenes and small-sized targets in practical applications. To address this challenge, we propose a novel UAV image object detection network based on self-attention guidance and global feature fusion, named SGGF-Net. First, in order to optimizing feature extraction in global perspective and enhancing target localization precision, the global feature extraction module (GFEM) is introduced by exploiting the self-attention mechanism to capture and integrate long-range dependencies within images. Second, a normal distribution-based prior assigner (NDPA) is developed by measuring the resemblance between ground truth and the priors, which improves the precision of target position matching and thus handle the problem of inaccurate localization of small targets. Furthermore, we design an attention-guided ROI pooling module (ARPM) via a deep fusion strategy of multilevel features for optimizing the integration of multi-scale features and improving the quality of feature representation. Finally, experimental results demonstrate the effectiveness of the proposed SGGF-Net approach.",
    "citation_count": "4",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Jing Bai",
            "country": ""
        },
        {
            "name": "Haiyang Hu",
            "country": ""
        },
        {
            "name": "Xiaojing Liu",
            "country": ""
        },
        {
            "name": "Shanna Zhuang",
            "country": ""
        },
        {
            "name": "Zhengyou Wang",
            "country": ""
        }
    ],
    "keywords": []
}