{
    "url": "https://www.sciencedirect.com/science/article/pii/S0262885616300701",
    "title": "Variable-state Latent Conditional Random Field models for facial expression analysis",
    "abstract": "Automated recognition of facial expressions of emotions, and detection of  facial action  units (AUs) from videos depends critically on modeling of their dynamics. Some of these dynamics are characterized by changes in  temporal phases  (onset-apex-offset) and intensity of emotion expressions and AUs. The appearance of these changes may vary considerably among subjects, making the recognition/detection task very challenging. The state-of-the-art Latent  Conditional Random Fields  (L-CRF) framework allows us to efficiently encode these dynamics through the latent states accounting for the temporal consistency in emotion expression and ordinal relationships between its intensity levels. These latent states are typically assumed to be either unordered (nominal) or fully ordered (ordinal). Yet, while the video segments containing activation of the target AU may better be described using ordinal latent states (corresponding to the AU intensity levels), the segments where this AU does not occur, may better be described using unordered (nominal) latent states. To address this, we propose the variable-state L-CRF (VSL-CRF) model that automatically selects the optimal latent states for the target image sequence, based on the input data and underlying dynamics of the sequence. To reduce the model overfitting, we propose a novel graph-Laplacian  regularization  of the latent states. We evaluate the VSL-CRF on the tasks of  facial expression recognition  using the CK+ dataset, and AU detection using the GEMEP-FERA and DISFA datasets, and show that the proposed model achieves better  generalization performance  compared to traditional L-CRFs and other related state-of-the-art models.",
    "citation_count": "7",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Robert Walecki",
            "country": ""
        },
        {
            "name": "Ognjen Rudovic",
            "country": ""
        },
        {
            "name": "Vladimir Pavlovic",
            "country": ""
        },
        {
            "name": "Maja Pantic",
            "country": ""
        }
    ],
    "keywords": []
}