{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02212-9",
    "title": "5G Edge Intelligence-based Refined Power Distribution Monitoring Technology and Application",
    "abstract": "The operating environment of electric meter boxes is very complex and contains various emergencies such as power theft and fire. When emergency occurs, it is urgent to dispatch correlated sensors to collect and upload related data under constrained energy budget. In this paper, we explore 5G edge intelligence for refined distribution power grid monitoring, and propose an access scheduling and power control optimization algorithm based on correlation predictive learning. First, we develop correlation prediction neural network to predict the correlation between occurred emergencies and dispatched sensors. Second, we reduce the problem dimension by combining decisions of access scheduling and power control, and construct the performance correlated upper performance confidence bound to learn the optimal strategy. Finally, the parameters of both neural network and upper performance confidence bound are updated by observed decision benefit and empirical correlation performance. Experiment has been carried out in real-world electric meter boxes. The results show that the proposed algorithm could greatly improves the operation safety and stability of the electric meter box.",
    "citation_count": 34,
    "year": "2024/10",
    "authors": [
        {
            "name": "Wen, Kehuan",
            "country": "China"
        },
        {
            "name": "Feng, Junhao",
            "country": "China"
        },
        {
            "name": "Yang, Xiangyong",
            "country": "China"
        },
        {
            "name": "Geng, Bo",
            "country": "China"
        },
        {
            "name": "Huang, Boyang",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}