{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0820-2",
    "title": "A DOA Estimation Approach for Transmission Performance Guarantee in D2D Communication",
    "abstract": "In Device-to-Device (D2D) communications of massive Multiple-Input Multiple-Output (MIMO) system, the inter-channel interference (ICI) can severely deteriorate the entire system performance. The beamforming technique can be used to alleviate this situation. Thus the localization of the users’ equipment (UE) should be known as a prior. In wireless communication, due to the effect of multipath, the model of incident signal should be regarded as distributed sources instead of point sources. In this paper, we propose a 2-D DOA estimation algorithm for coherently distributed (CD) sources based on conformal array. First, three rational invariance relationships are constructed based on generalized steering vectors (GSVs). Then the propagator method (PM) is used for estimating three rational invariance matrices. Finally, the 2-D DOA of CD sources can be obtained from the eigenvalues of three rational invariance matrices. Without spectrum peaking searching, and estimation and eigendecomposition of sampling covariance matrix, the proposed algorithm has low computational complexity. For the condition with a large amount of data, the distributed and parallel PM is proposed to deal with this problem. Simulation results verify the effectiveness of the proposed algorithm.",
    "citation_count": 28,
    "year": "2017/12",
    "authors": [
        {
            "name": "Wan, Liangtian",
            "country": "China"
        },
        {
            "name": "Han, Guangjie",
            "country": "China"
        },
        {
            "name": "Jiang, Jinfang",
            "country": "China"
        },
        {
            "name": "Zhu, Chunsheng",
            "country": "Canada"
        },
        {
            "name": "Shu, Lei",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}