{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02204-9",
    "title": "An Effective Transformation-Encoding-Attention Framework for Multivariate Time Series Anomaly Detection in IoT Environment",
    "abstract": "The emergence of the Internet of Things (IoT) has realized the connection between objects and the Internet, realized intelligent identification and management, and made the interconnection of everything a reality. The IoT, using various sensors, captures the indicators stored in the form of multivariate time series in real time. The multivariate time series anomaly detection is a crucial step to ensure regular IoT operation. However, due to the nonlinearity, nonstationarity, and noise of the generated data, as well as the scarcity and randomness of anomalies in the data, multivariate time series anomaly detection in the IoT faces the challenges of high computational costs and uncertain detection results. To address these issues, we take into account different aspects of IoT real-time data, and propose a new anomaly detection framework based on Neural Transformation (NT) and attention-based autoregressive Long-Short Term Memory (LSTM), namely Transformation-Encoding-Attention (TEA). The framework generates various transformation views by NT from the original data, and combines the Convolutional Long-Short Term Memory (ConvLSTM) encoding network and two attention-layer integrated autoregressive LSTM to realize the Spatio-Temporal feature extraction and integration to achieve better detection accuracy in IoT environment. Experimental results demonstrate that TEA outperforms six baseline methods on four open datasets, achieving the highest average F1(0.885) on these datasets. In particular,compared with six state-of-the-art baselines, TEA results in an improvement of 8.18% in terms of average accuracy.",
    "citation_count": 42,
    "year": "2024/10",
    "authors": [
        {
            "name": "Zhang, Rui",
            "country": "China"
        },
        {
            "name": "Chen, Juan",
            "country": "China"
        },
        {
            "name": "Song, Yujia",
            "country": "China"
        },
        {
            "name": "Shan, Wenyu",
            "country": "China"
        },
        {
            "name": "Chen, Peng",
            "country": "China"
        },
        {
            "name": "Xia, Yunni",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}