{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1114-z",
    "title": "An Image-guided Endoscope System for the Ureter Detection",
    "abstract": "The ureter injury occasionally happens in the gynecology, abdominal and urinary surgeries. The medical negligence may cause severe problems for the hospital, and mental pressure for the doctors. Furthermore, the serious accident brings painful complications for the patients. Thus, it is necessary to locate the ureter, which is covered by peritoneum and connective tissue, for the assisted surgery. The aim is to detect the ureter position, and avoid iatrogenic ureter injury. In order to indicate the ureter position in surgery, we propose an image-guided endoscope system that has both traditional functions of the endoscope system and the additional function of ureter detection. We design an infrared-based pipe that its shape is similar to the ureteral catheter to mark the ureter, and use the multi-spectral camera that can capture both the visual and infrared light to obtain the endoscopic images. To extract the precise contour of the ureter, we propose a hardware-aided detection method, and a high-efficient segmentation algorithm. The hardware-aided method is used to recognize the kind of the captured images. Then the ureter position is extract by the segmentation algorithm. Before the image segmentation, the image enhancement and denoising algorithms are executed to reduce the noise level of images. The extracted contour of the ureter is fused with visible-light images to generate the endoscopic images highlighting the location of ureter. Experimental results indicate that the proposed system can achieve 83.54% and 88.38% of true positive rate (TPR) and positive predictive value (PPV ) respectively. In addition, the frame rate is about 25 frames per second (f/s), which reaches the real-time performance. We proposed a novel image-guided endoscope system for the ureter detection, and the ureter position can be displayed during the surgery. The proposed system may reduce the ureter injury in surgery, and improve the surgical success rate.",
    "citation_count": 61,
    "year": "2018/12",
    "authors": [
        {
            "name": "Song, Enmin",
            "country": "China"
        },
        {
            "name": "Yu, Feng",
            "country": "China"
        },
        {
            "name": "Li, Yunlong",
            "country": "China"
        },
        {
            "name": "Liu, Hong",
            "country": "China"
        },
        {
            "name": "Wan, Youming",
            "country": "China"
        },
        {
            "name": "Hung, Chih-Cheng",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}