{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01381-w",
    "title": "Analyzing Customer Outage Cost in a Microgrid",
    "abstract": "In today’s era of socioeconomic and environmental concerns, conventional energy sources are incapable of meeting increasing energy demands which leads to the significance of Microgrid (MG) systems incorporating renewable energy sources. An ideally designed microgrid capable of operating in standalone and grid connected mode is considered with photovoltaic panels, wind turbines, fuel cell, battery and Microturbines (MT) as sources. The two noteworthy disadvantages of microgrid are very expensive power supply and intermittency of power generation. Besides ensuring a steady supply, the power delivered should be of moderate cost. So, this work focuses on reducing the cost associated with its operation and emission by simultaneously analyzing the impact of uncertainty. The uncertainties can be caused due to different DGs present in MG and the load varations. The variations of uncertainty are included as outage cost. The MG operating under islanded and grid connected modes are analyzed for different scenarios to obtain optimal value of customer outage cost and operating cost. So a heuristic optimization technique which can handle the multi-objective problem is considered. The optimal solution for different operational scenarios of grid connected and islanded mode are obtained using Multi-Objective Particle Swarm Optimization (MOPSO) algorithm.",
    "citation_count": 25,
    "year": "2019/12",
    "authors": [
        {
            "name": "Rajarajeswari, R.",
            "country": "India"
        },
        {
            "name": "Suchitra, D.",
            "country": "India"
        },
        {
            "name": "Vijayakumar, K.",
            "country": "India"
        },
        {
            "name": "Jegatheesan, R.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}