{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0917-7",
    "title": "Cognitive Heterogeneous Networks with Unreliable Backhaul Connections",
    "abstract": "To enhance the spectrum scarcity of cooperative heterogeneous networks (HetNets) with unreliable backhaul connections, we examine the impact of cognitive spectrum sharing over multiple small-cell transmitters in Nakagami-m fading channels. In this system, the secondary transmitters are connected to macro-cell via wireless backhaul links and communicate with the secondary receiver by sharing the same spectrum with the primary user. Integrating cognitive radio (CR) network into the system, we address the combined power constraints: 1) the peak interference power at the primary user and 2) the maximal transmit power at the secondary transmitters. In addition, to exclude the signaling overhead for exchanging channel-state-information (CSI) at the transmitters, the selection combining (SC) protocol is assumed to employ at the receivers. To evaluate the performance, we first derive the closed-form statistics of the end-to-end signal-to-noise (SNR) ratio, from which the exact outage probability, ergodic capacity and symbol error rate expressions are derived. To reveal further insights into the effective unreliable backhaul links and the diversity of fading parameters, the asymptotic expressions are also attained. The two interesting non-cooperative and Rayleigh fading scenarios are also investigated. Numerical results are conducted to verify the performance of the considered system via Monte-Carlo simulations.",
    "citation_count": 38,
    "year": "2018/12",
    "authors": [
        {
            "name": "Nguyen, Huy T.",
            "country": "Korea"
        },
        {
            "name": "Ha, Dac-Binh",
            "country": "Vietnam"
        },
        {
            "name": "Nguyen, Sang Quang",
            "country": "Vietnam"
        },
        {
            "name": "Hwang, Won-Joo",
            "country": "Korea"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}