{
    "url": "https://link.springer.com/article/10.1007/s11036-016-0734-4",
    "title": "Compressive Sensing Based Soft Video Broadcast Using Spatial and Temporal Sparsity",
    "abstract": "Video broadcasting over wireless network has become a very popular application. However, the conventional digital video broadcasting framework can hardly accommodate heterogeneous users with diverse channel conditions, which is called the cliff effects. To overcome this cliff effects and provide a graceful degradation to multi-receivers, in this paper, we use the nonlocal sparsity and hierarchical GOP structure to propose a novel CS based soft video broadcast scheme. CS has properties of minimizing bandwidth consumption and generating measurements with equal importance which are exactly needed by video soft broadcast. In the proposed scheme, the measurement data are generated by block-wise compressive sensing (BCS), and then the measurement data packets are sent over a highly dense constellation though OFDM channel to achieve a simple encoder. Ideally, with the GOP structure, inter frame has lower sampling rate than intra frame to achieve better compression efficiency. At the decoder side, due to equally-important packets and property of soft broadcast, each user can receive the noise-corrupted measurements matching its channel condition and reconstruct video. The hierarchical GOP structure is presented to explode the correlation and non-local sparsity among video frames during the recover process. Additionally, using non-local sparsity, group based CS reconstruction with adaptive dictionaries is proposed to improve decoding quality. The experimental results show that the proposed scheme provides better performance compared with the traditional SoftCast with up to 8&nbsp;dB coding gain for some channel conditions.",
    "citation_count": 39,
    "year": "2016/12",
    "authors": [
        {
            "name": "Yin, Wenbin",
            "country": "China"
        },
        {
            "name": "Fan, Xiaopeng",
            "country": "China"
        },
        {
            "name": "Shi, Yunhui",
            "country": "China"
        },
        {
            "name": "Xiong, Ruiqin",
            "country": "China"
        },
        {
            "name": "Zhao, Debin",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}