{
    "url": "https://link.springer.com/article/10.1023/B:MONE.0000042507.74516.00",
    "title": "Data Protection and Data Sharing in Telematics",
    "abstract": "Automotive telematics may be defined as the information-intensive applications enabled for vehicles by a combination of telecommunications and computing technology. Telematics by its nature requires the capture, storage, and exchange of sensor data to obtain remote services. Such data likely include personal, sensitive information, which require proper handling to protect the driver's privacy. Some existing approaches focus on protecting privacy through anonymous interactions or by stopping information flow altogether. We complement these by concentrating instead on giving different stakeholders control over data sharing and use. In this paper, we identify several data protection challenges specifically related to the automotive telematics domain, and propose a general data protection framework to address some of those challenges. The framework enables data aggregation before data is released to service providers, which minimizes the disclosure of privacy sensitive information. We have implemented the core component, the privacy engine, to help users manage their privacy policies and to authorize data requests based on policy matching. The policy manager provides a flexible privacy policy model that allows data subjects to express rich constraint-based policies, including event-based, and spatio-temporal constraints. Thus, the policy engine can decide on a large number of requests without user assistance and causes no interruptions while driving. A performance study indicates that the overhead is stable with an increasing number of data subjects.",
    "citation_count": 27,
    "year": "2004/12",
    "authors": [
        {
            "name": "Duri, Sastry",
            "country": "USA"
        },
        {
            "name": "Elliott, Jeffrey",
            "country": "USA"
        },
        {
            "name": "Gruteser, Marco",
            "country": "USA"
        },
        {
            "name": "Liu, Xuan",
            "country": "USA"
        },
        {
            "name": "Moskowitz, Paul",
            "country": "USA"
        },
        {
            "name": "Perez, Ronald",
            "country": "USA"
        },
        {
            "name": "Singh, Moninder",
            "country": "USA"
        },
        {
            "name": "Tang, Jung-Mu",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}