{
    "url": "https://link.springer.com/article/10.1007/s11036-014-0543-6",
    "title": "Decentralized Positioning Algorithm for Relative Nodes Localization in Wireless Body Area Networks",
    "abstract": "Wireless Body Area Networks (WBAN) can offer motion capture capabilities through peer-to-peer ranging and on-body nodes positioning, by relying on transmitted signals and data packets. In this paper, we describe a solution to localize wireless nodes relatively to a body-strapped Local Coordinate System (LCS). In particular, we consider coupling a Constrained Distributed Weighted Multi-Dimensional Scaling algorithm (CDWMDS), which asynchronously estimates the nodes’ locations under geometric constraints related to fixed-length links, with new messages censoring, location updates scheduling and forced measurements symmetry. The idea is to mitigate error propagation (e.g. with respect to the fastest nodes), as well as harmful effects caused by the loss of critical packets. We also introduce a real beacon-aided Time Division Multiple Access (TDMA) scheme to suitably support both peer-to-peer ranging and decentralized positioning transactions under real-time constraints. Simulation results are provided to assess the performance of the proposed solution for various levels of connectivity and ranging quality, showing interesting gains on the average location error per node under moderate pedestrian mobility. Comparisons are finally provided with a more conventional centralized and synchronous Multidimensional Scaling (MDS) algorithm that would require completing the matrix of measured distances under partial network connectivity.",
    "citation_count": 16,
    "year": "2014/12",
    "authors": [
        {
            "name": "Hamie, Jihad",
            "country": "France"
        },
        {
            "name": "Denis, Benoit",
            "country": "France"
        },
        {
            "name": "Richard, Cedric",
            "country": "France"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}