{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02173-z",
    "title": "Designing a Human Enterprise Management Model Using Deep Learning and Wireless Connectivity",
    "abstract": "As the Internet era has progressed, more and more candidates are getting their recruitment information online. At the same time, a problem of information overload for human enterprise management services has arisen due to the massive volume of information. The main instrument to combat information overload in the Internet era has emerged as the human enterprise management system (HEMS). It can actively search through the information overload to discover and present the material that people are interested in. To ensure wide spread adaptability, the role of wireless communication for HEMS cannot be ignored. Wireless connectivity ensures that plethora of HEMS-related information can be accessed and managed effectively around the globe. To extract features from this massive information, deep learning can be used. There has not been much progress in the area of HEM systems as far as deep learning is concerned. This paper proposes an HDCF algorithm, which resolves the main issues of data sparseness and cold start in conventional collaborative filtering algorithms with the aid of deep learning feature extraction capabilities and wireless connectivity. The HDCF is essentially a recommendation algorithm that suggests to newly registered users the most prevalent and recent jobs in the system and employs an online algorithm based on content filtering to calculate the candidate’s rating for the most recently listed positions. According to the testing findings, the HDCF algorithm performed better than existing human business management algorithms like probability matrix factorization (PMF) and content-based filtering (CBF).",
    "citation_count": 23,
    "year": "2023/12",
    "authors": [
        {
            "name": "Song, Zhenxing",
            "country": "China"
        },
        {
            "name": "Zhang, Di",
            "country": "China"
        },
        {
            "name": "Wang, Yue",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}