{
    "url": "https://link.springer.com/article/10.1023/B:MONE.0000042504.21014.61",
    "title": "Disconnected Processes, Mechanisms and Architecture for Mobile E-Business",
    "abstract": "With the tremendous advances in hand-held computing and communication capabilities, rapid proliferation of mobile devices, and decreasing device costs, we are seeing a growth in mobile e-business in various consumer and business markets. In this paper, we present a novel architecture and framework for end-to-end mobile e-business applications (e.g., point of sales). The architecture takes into consideration disconnection, application context, synchronization, transactions and failure recovery modes to provide mobile users with seamless and transparent access to business transactions and business-context specific data. In our architecture, we consider a novel business process design based on state-machines and event management to handle disconnection, resource limitations and failures. We designed, implemented and deployed a system for mobile e-business on clients (e.g., PDAs and PocketPCs) integrated with private exchanges and sell-side servers. The state-machine model with failure recovery mechanisms enables handling of one-to-many and many-to-one disconnections in large mobile e-business environments. The e-business framework on mobile clients is implemented based on J2ME, Webservices, and open XML standards. A detailed performance study of commerce transactions was done on different mobile client devices with diverse computing, memory and storage capabilities. We compare the performance of a purchasing application and the middleware on various devices such as PDAs and Laptops. We demonstrated that for small devices with limited capability the performance is reasonable. For devices with more computing capability, the response time is excellent.",
    "citation_count": 20,
    "year": "2004/12",
    "authors": [
        {
            "name": "Sairamesh, J.",
            "country": "USA"
        },
        {
            "name": "Goh, S.",
            "country": "USA"
        },
        {
            "name": "Stanoi, I.",
            "country": "USA"
        },
        {
            "name": "Padmanabhan, S.",
            "country": "USA"
        },
        {
            "name": "Li, C.S.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}