{
    "url": "https://link.springer.com/article/10.1007/s11036-006-0056-z",
    "title": "Distributed Web-based Management Framework for Ambient Reconfigurable Services in the Intelligent Environment",
    "abstract": "Existing and emerging technologies in the areas of mobile computing, wireless communications/networking, sensor and control devices, context awareness, user interfaces, etc., provide the ground for the support of human activities in a certain space. More specifically, these recent advances now allow the gradual “disappearance” of computers and/or other end-user devices into the environment creating a system that can facilitate everyday living. Such an intelligent environment system offers personalised, context-aware services that can support and improve everyday life. In spite of the large number and variety of devices, networking technologies and ambient intelligence subsystems there is a lack of a framework that brings the different relevant actors together and exploits the full potential of emerging technologies to meet the requirements of an intelligent environment system, not only in the context of the home but also in the corporate and public sectors. Intelligent environments necessitate new, advanced management mechanisms. This paper presents an approach for a D istributed Web-based m a nagement f ramework for ambient reconfigurable services in the i n telligent e nvironment (DAFNE).",
    "citation_count": 29,
    "year": "2006/12",
    "authors": [
        {
            "name": "Stavroulaki, V.",
            "country": "Greece"
        },
        {
            "name": "Demestichas, K.",
            "country": "Greece"
        },
        {
            "name": "Adamopoulou, E.",
            "country": "Greece"
        },
        {
            "name": "Demestichas, P.",
            "country": "Greece"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}