{
    "url": "https://link.springer.com/article/10.1007/s11036-021-01783-9",
    "title": "Edge User Allocation in Overlap Areas for Mobile Edge Computing",
    "abstract": "The rapid development of mobile communication technology has promoted the emergence of mobile edge computing (MEC), which allows mobile users to transfer their computing tasks to nearby edge servers to reduce access latency. In the actual MEC environment, the signal coverage areas of edge servers usually overlap partially, and users in the overlapped areas can choose to connect to one of the edge servers that cover them. How to allocate these users will seriously affect MEC performance. To solve this issue, we focus on the overlapped area user allocation (OAUA) problem in the MEC environment and model it as a multi-objective optimization problem. The objective is to balance the workload among edge servers and minimize the access delay between users and edge servers. Pareto model is universal for solving multi-objective optimization problems. However, the traditional method has high computational complexity to find the Pareto boundary. Therefore, we propose a Pareto boundary search algorithm based on convex hull to reduce the complexity of the algorithm. Since the Pareto boundary is a set of optimal solutions, which contains multiple optimal solutions, we further propose to use the principal component analysis algorithm to find the most suitable solution from the Pareto boundary as the final user allocation strategy. Our experiments use real data sets and compare the performance with several other baseline methods to verify the effectiveness of our proposed solution.",
    "citation_count": 33,
    "year": "2021/12",
    "authors": [
        {
            "name": "Liu, Fangzheng",
            "country": "China"
        },
        {
            "name": "Lv, Bofeng",
            "country": "China"
        },
        {
            "name": "Huang, Jiwei",
            "country": "China"
        },
        {
            "name": "Ali, Sikandar",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}