{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01387-4",
    "title": "Efficient Machine Learning Model for Movie Recommender Systems Using Multi-Cloud Environment",
    "abstract": "A recommender system or a recommendation system is a subclass of information filtering system which in turn predicts the “preference” or “ratings” which a user would provide to the specified item. Recommender systems are utilized in a variety of areas comprising news, music, movies, books, search queries, social tags, research articles, and products in general. The primary aim of the recommender system is to allow the computers learn automatically without any human intervention or assistance and regulate activities consequently. The existing methods had a lower amount of search result quality and a minimum rate of ranking accuracy. To overcome this issue and to enhance the ranking quality and search result quality a novel recommender system in the multi-cloud with the use of proposed machine learning algorithm. In this proposed work (NPCA-HAC), the social data set are pre-processed to remove the noise and making them pure. Then, the method of feature selection is carried out with the use of principle component analysis method (PCA). The selected features are then clustered with the use of k-means followed by the Hierarchical Agglomerative Clustering algorithm (HAC). These clusters are then ranked by the use of trust ranking algorithm. Finally, the ranked output was evaluated and the performance measure was analyzed which provides the efficient results from the recommender system.",
    "citation_count": 36,
    "year": "2019/12",
    "authors": [
        {
            "name": "Indira, K.",
            "country": "India"
        },
        {
            "name": "Kavithadevi, M. K.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}