{
    "url": "https://link.springer.com/article/10.1007/s11036-022-02005-6",
    "title": "Empirical Mode Decomposition-empowered Network Traffic Anomaly Detection for Secure Multipath TCP Communications",
    "abstract": "The development of new technologies such as the Internet of Things and cloud computing tests the transmission capabilities of communication networks. With the widespread application of multiple wireless access technologies, it has become popular for modern communication devices to be equipped with multiple network access interfaces. The increasing of various network attacks significantly reduces the robustness of multipath TCP (MPTCP) transport systems. To address this problem, this paper proposes a network traffic anomaly detection model based on MPTCP networks, called MPTCP-EMD. The model combines multi-scale detection and digital signal processing theory to implement anomaly detection based on the self-similarity of MPTCP network traffic. It uses the empirical modal decomposition (EMD) method to decompose MPTCP traffic data and reconstruct the valid signal by removing high-frequency noise and residual trend term. Using the idea of sliding windows, the model then compares the changes in the Hurst exponent of the MPTCP network under different attack conditions to determine whether anomalies have occurred. The simulation results show that the EMD method can be used for anomaly detection of MPTCP network traffic. The Hurst exponent of the attacked MPTCP network significantly exceeds the range of the unattacked network, and exhibits significant jitter.",
    "citation_count": 32,
    "year": "2022/12",
    "authors": [
        {
            "name": "Cao, Yuanlong",
            "country": "China"
        },
        {
            "name": "Ji, Ruiwen",
            "country": "China"
        },
        {
            "name": "Huang, Xin",
            "country": "China"
        },
        {
            "name": "Lei, Gang",
            "country": "China"
        },
        {
            "name": "Shao, Xun",
            "country": "Japan"
        },
        {
            "name": "You, Ilsun",
            "country": "Korea"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}