{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02265-w",
    "title": "Energy-Efficient joint Resource Allocation and Computation Offloading in NOMA-enabled Vehicular Fog Computing",
    "abstract": "The rapid growth in vehicle data fosters the development of vehicular computational offloading. By exploiting the superiority of non-orthogonal multiple access (NOMA) in the offloading process, NOMA-enabled vehicular computation offloading enables collaborative transmissions of multiple fog nodes and is promising for distributed wireless communications environments. Nonetheless, to the best of our knowledge, the problem of task allocation and resource allocation in NOMA-enabled multipoint collaborative offloading in Vehicular Fog Computing (VFC) still remains open. With this consideration, the NOMA-enabled vehicular fog computing problem is investigated in this work, as well as an energy-efficient NOMA-enabled vehicular computing offloading scheme is proposed. The scheme combines task vehicles, main fog access points (F-APs), idle vehicles, and auxiliary F-APs to collaborate on tasks. However, the corresponding optimization problem turns out to be a non-convex issue. To this end, through in-depth mathematical analysis, the monotonicity of NOMA power allocation is discussed to find the optimal power allocation coefficient. Furthermore, an interior-point method based on successive convex approximation (SCA) is proposed to obtain the sub-optimal solution of task division and bandwidth&nbsp;allocation. Simulations are conducted to validate our analysis and corroborate the effectiveness of the proposed scheme.",
    "citation_count": 34,
    "year": "2024/10",
    "authors": [
        {
            "name": "Lin, Zhijian",
            "country": "China"
        },
        {
            "name": "Lin, Yonghang",
            "country": "China"
        },
        {
            "name": "Yang, Jianjie",
            "country": "China"
        },
        {
            "name": "Zhang, Qingsong",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}