{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1064-5",
    "title": "Energy Efficiency and Superlative TTT for Equitable RLF and Ping Pong in LTE Networks",
    "abstract": "Data hungry users engage radio resources over long periods of time thus resulting into higher energy consumption by Base Stations (BSs). Mobile operators’ operational expenditure (OPEX) is directly affected by augmented electricity bills due to increased power consumption, thereby ensuing reduced economic and environmental benefits, i.e. profitability of vendors and green communication accordingly. This work provides performance analysis of our proposed reduced early handover (REHO) scheme which results in increased energy efficiency. Impact of reduced energy consumption is shown on OPEX, as well as greener aspects are investigated by inclusion of real life commercial tariffs adopted by one of the mobile operators in the UK. Performance analysis revealed that varying time to trigger (TTT) values significantly impact radio link failure (RLF), ping pong effect as well as call drop ratio (CDR) and Handover ratio (HOR), at changing users’ velocities. Paper investigates and provides a very useful insight for superlative value of TTT for unbiased RLF and Ping Pong, which can help vendors not only to achieve increased energy efficiency, but also maintain other salient performance parameters within acceptable limits. The work also achieves the fact that the time difference in terms of transmission time intervals (TTIs) for reduced early handover in REHO, always remain the same irrespective of the value of TTT, thus ensuring that REHO continuously achieves increased energy efficiency compared to LTE standard.",
    "citation_count": 24,
    "year": "2018/12",
    "authors": [
        {
            "name": "Kanwal, Kapil",
            "country": "UK"
        },
        {
            "name": "Safdar, Ghazanfar Ali",
            "country": "UK"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}