{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01385-6",
    "title": "Extreme Gradient Boost Classification Based Interesting User Patterns Discovery for Web Service Composition",
    "abstract": "Web mining is the application of data mining techniques to discover the user interesting patterns from the web server. The behaviors of web users are monitored for services composition from a similar set of services accessed by the user. Various mining techniques have been developed for mining user interesting patterns but still discovering the most interesting patterns with less time complexity is a major research area. In order to extract the interesting actionable patterns with less time complexity, Best First Decision Tree Based Extreme Gradient Boost Classification (BFDT-XGBC) technique is introduced. At first, the user accessed patterns are extracted from the server log. Then, the base learner called Best First Decision Tree is employed to identify user interesting web patterns. In a decision tree, the first node is selected through the information gain to make a decision for classifying the web patterns. The classification is performed based on the correlation between the two web patterns. The Pearson correlation coefficient is used for measuring the correlation between web patterns and it provides the results as positive and negative correlation. Based on the positive correlation measure, the web patterns are classified through the node in a best first decision tree. The output of each best first decision tree is taken as base learners. Then the several base learners are combined to provide strong classification results by applying Extreme Gradient Boost Classification in BFDT-XGBC technique. Extreme Gradient Boost classifier is employed to compute the loss function of all base learners for constructing the strong classifier. Thus the similar user interesting patterns are correctly identified with higher accuracy and minimal time. Experimental evaluation of proposed BFDT-XGBC technique and existing methods are carried out with the web server log files. The results reported that the BFDT-XGBC technique effectively discoverered the web user interesting patterns through Web pattern identification accuracy, computational time, false positive rate and space complexity. Based on the result observations, BFDT-XGBC technique is more efficient than the existing methods.",
    "citation_count": 30,
    "year": "2019/12",
    "authors": [
        {
            "name": "Chakravarthy, D. Gowtham",
            "country": "India"
        },
        {
            "name": "Kannimuthu, S.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}