{
    "url": "https://link.springer.com/article/10.1007/s11036-022-02002-9",
    "title": "Intelligent Predicting Method for Optimizing Remote Loading Efficiency in Edge Service Migration",
    "abstract": "In mobile edge computing (MEC) systems, enhancing the learning capabilities of edge nodes through Artificial Intelligence (AI) can improve the efficiency of dynamically allocating resources. For the scenario of edge service migration, various tasks in lightweight IoT devices are offloaded to edge nodes and the services on edge nodes are migrated adaptively to another available node nearer to the users while they move. To speed up network application loading during service migration, this paper proposes an intelligent trace-driven predicting approach (ITPA) that improves the efficiency of I/O scheduling and the hit ratio of caching when migrating services between resource-constrained edge nodes. First, based on the characteristics of sequential access to the binary codes of an application during its startup progress, the request loading list is generated by tracing key I/O requests at that phase. Then, an intelligent algorithm is designed to search and select the key I/O requests in the loading list. Finally, the efficiency of data acquisition is improved by implementing a prefetch strategy for the client side and a three-level caching strategy for the server side. Experimental results show that the ITPA reduces the service startup time during stateless migration.",
    "citation_count": 16,
    "year": "2022/12",
    "authors": [
        {
            "name": "Meng, Xianyu",
            "country": "China"
        },
        {
            "name": "Shao, Xun",
            "country": "Japan"
        },
        {
            "name": "Masui, Hiroshi",
            "country": "Japan"
        },
        {
            "name": "Lu, Wei",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}