{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02222-7",
    "title": "Intrusion Detection Method Based on Denoising Diffusion Probabilistic Models for UAV Networks",
    "abstract": "Security is important for UAV networks because of the need for a cyber-secure flying air space for UAV group communication to complete the complex tasks cooperatively. Network intrusion detection is an effective method to identify normal and abnormal data packets to ensure the security of network. Denoising diffusion probabilistic models (DDPM) are a class of generative models, and have recently been proved to produce excellent samples. With the advantages of DDPM, this paper introduces DDPM into the field of network security for UAV communication, and proposes a network intrusion detection method based on DDPM to improve the performance for UAV. By using an unsupervised reconstruction error method, a large amount of annotations is reduced. To examine the effect of the proposed method, this paper uses KDDcup99 dataset for verification. In the comparative experiment, the experimental results of the proposed model based on DDPM are better than the ones of seq2seq, VAE, PCA, where the accuracy, precision, recall, f1_score and AUC of DDPM are 0.9766, 0.9793, 0.9933, 0.9981 and 0.958, showing that the method can effectively achieve network intrusion detection.",
    "citation_count": 29,
    "year": "2024/10",
    "authors": [
        {
            "name": "Wang, Yingshu",
            "country": "China"
        },
        {
            "name": "Ding, Jian",
            "country": "China"
        },
        {
            "name": "He, Xiaomeng",
            "country": "China"
        },
        {
            "name": "Wei, Qian",
            "country": "China"
        },
        {
            "name": "Yuan, Shu",
            "country": "China"
        },
        {
            "name": "Zhang, Jun",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}