{
    "url": "https://link.springer.com/article/10.1007/s11036-005-4447-3",
    "title": "Localized Algorithms for Energy Efficient Topology in Wireless Ad Hoc Networks",
    "abstract": "Topology control in wireless ad hoc networks is to select a subgraph of the communication graph (when all nodes use their maximum transmission range) with some properties for energy conservation. In this paper, we propose two novel localized topology control methods for homogeneous wireless ad hoc networks. Our first method constructs a structure with the following attractive properties: power efficient, bounded node degree, and planar. Its power stretch factor is at most $$\\rho=\\frac{1}{{1-(2\\sin {\\frac{\\pi}{k}})^{\\beta}}}$$ , and each node only has to maintain at most $$k\\,+\\,5$$ neighbors where the integer $$k&gt;6$$ is an adjustable parameter, and β is a real constant between 2 and 5 depending on the wireless transmission environment. It can be constructed and maintained locally and dynamically. Moreover, by assuming that the node ID and its position can be represented in $$O(\\log n)$$ bits each for a wireless network of n nodes, we show that the structure can be constructed using at most 24n messages, where each message is $$O(\\log n)$$ bits. Our second method improves the degree bound to k, relaxes the theoretical power spanning ratio to $$\\rho=\\frac{\\sqrt 2 ^\\beta}{{1- (2\\sqrt 2 \\sin {\\frac{\\pi}{k}})^{\\beta}}} $$ , where $$k&gt;8$$ is an adjustable parameter, and keeps all other properties. We show that the second structure can be constructed using at most 3n messages, where each message has size of $$O(\\log n)$$ bits. We also experimentally evaluate the performance of these new energy efficient network topologies. The theoretical results are corroborated by the simulations: these structures are more efficient in practice, compared with other known structures used in wireless ad hoc networks and are easier to construct. In addition, the power assignment based on our new structures shows low energy cost and small interference at each wireless node.",
    "citation_count": 28,
    "year": "2005/12",
    "authors": [
        {
            "name": "Song, Wen-Zhan",
            "country": "Vancouver"
        },
        {
            "name": "Wang, Yu",
            "country": "Chicago"
        },
        {
            "name": "Li, Xiang-Yang",
            "country": "Vancouver"
        },
        {
            "name": "Frieder, Ophir",
            "country": "Vancouver"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}