{
    "url": "https://link.springer.com/article/10.1007/s11036-005-4451-7",
    "title": "MAC Layer Admission Control and Priority Re-allocation for Handling QoS Guarantees in Non-cooperative Wireless LANs",
    "abstract": "Providing QoS guarantee with appropriate service differentiation in IEEE 802.11 wireless LANs is quite desirable. However, users may be selfish and thus rigorously try to maximize their performance by demanding high services even though the network has already saturated. On the other hand, user misbehaviors such as misuse of priority and over-rate transmission pose further harm to performance of existing flows. These application layer non-cooperation makes successful resource allocation very challenging with existing contention based CSMA/CA channel access. In this paper, we propose a MAC layer coordinated QoS framework of admission control and priority re-allocation for quality of services of real-time applications in wireless LANs. Our focus is on priority based MAC schedulers where each user can set its flow priority in order to receive appropriate level of services. With channel condition information such as available bandwidth and mean delay exchanged among neighboring stations, users can enforce admission control based on the perceived channel status and may re-allocate their priorities to accommodate existing flows as desired. User misbehaviors are identified by estimating the flow transmitting rate and matching priority setting, or even punished by assigning appropriate low priorities. Extensive simulations results show that the proposed framework can effectively coordinate wireless users on keeping reserved transmission rate, using appropriate MAC priority, and allocating sufficient resource.",
    "citation_count": 31,
    "year": "2005/12",
    "authors": [
        {
            "name": "Li, Ming",
            "country": "USA"
        },
        {
            "name": "Prabhakaran, B.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}