{
    "url": "https://link.springer.com/article/10.1007/s11036-008-0044-6",
    "title": "Mobile Traversal Schemes based on Triangulation Coverage",
    "abstract": "In harsh outdoor terrains like disaster areas and urban toxic, regions optimal placements of static sensor nodes might not be possible, leading to possible incomplete coverage of the region. In such situations, mobile sensor nodes (MSNs) might be a better option and a significantly fewer number of nodes are required than their static counterparts. A triangulation-based coverage where, groups of three MSNs position themselves to form equilateral triangles, has several applications in localization, 3D imaging and coordinated search operation. In this paper, we present several mobile traversal algorithms (MTA) based on triangulation coverage that employs N ≥ 3 MSNs such that, up to N − 3 node failures can be tolerated. MTA achieves three objectives: (a) as N increases, the total time to cover the field decreases in the absence of a failure; (b) each MSN travels a minimum distance; (c) upon a failure, the remaining MSNs efficiently complete the coverage of the field. The bounds on the total traveling distance and time are derived and the tightness of the bounds are proven through simulations. Furthermore, we also derive the bounds on the distance traveled by an MSN to complete the coverage process. The bounds on the individual traveling distances are useful in minimizing and bounding the energy consumption of the MSNs.",
    "citation_count": 7,
    "year": "2007/12",
    "authors": [
        {
            "name": "Khan, Asheq",
            "country": "USA"
        },
        {
            "name": "Qiao, Chunming",
            "country": "USA"
        },
        {
            "name": "Tripathi, Satish K.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}