{
    "url": "https://link.springer.com/article/10.1007/s11036-005-4444-6",
    "title": "On Node Lifetime Problem for Energy-Constrained Wireless Sensor Networks",
    "abstract": "A fundamental problem in wireless sensor networks is to maximize network lifetime under given energy constraints. In this paper, we study the network lifetime problem by considering not only maximizing the time until the first node fails, but also maximizing the lifetimes for all the nodes in the network, which we define as the Lexicographic Max-Min (LMM) node lifetime problem. The main contributions of this paper are two-fold. First, we develop a polynomial-time algorithm to derive the LMM-optimal node lifetime vector, which effectively circumvents the computational complexity problem associated with an existing state-of-the-art approach, which is exponential. The main ideas in our approach include: (1) a link-based problem formulation, which significantly reduces the problem size in comparison with a flow-based formulation, and (2) an intelligent exploitation of parametric analysis technique, which in most cases determines the minimum set of nodes that use up their energy at each stage using very simple computations. Second, we present a simple (also polynomial-time) algorithm to calculate the flow routing schedule such that the LMM-optimal node lifetime vector can be achieved. Our results in this paper advance the state-of-the-art algorithmic design for network-wide node lifetime problem and facilitate future studies of the network lifetime problem in energy-constrained wireless sensor networks.",
    "citation_count": 29,
    "year": "2005/12",
    "authors": [
        {
            "name": "Hou, Y. Thomas",
            "country": "USA"
        },
        {
            "name": "Shi, Yi",
            "country": "USA"
        },
        {
            "name": "Sherali, Hanif D.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}