{
    "url": "https://link.springer.com/article/10.1007/s11036-023-02208-5",
    "title": "Parallel Implementation of Key Algorithms for Intelligent Processing of Graphic Signal Data of Consumer Digital Equipment",
    "abstract": "With the rapid development of Internet of Things (IoT) and information technology, there are more and more data storage about graphic signals in digital devices. Therefore, enterprises need to improve the efficiency of graphic signal processing in digital devices. The purpose of this paper is to process the graphic signal data in enterprise digital equipment and improve the efficiency of algorithm task processing in the system. Firstly, the background of informatization process and intelligent data processing is analyzed. Through data information mining and model analysis, a data processing framework is proposed in the physical layer, media access control layer, and network layer. In the process of model processing, through the optimization of cloud computing resource allocation strategy, the optimization and design of Parallel Neural Network Algorithm (PNNA) are put forward, and finally the results of model processing are stored in the management and operation mode library. The results show that the signal reception intensity of all models will increase with the increase of the number of users. When the number of users increases to 250, the signal strength received by the Wireless Local Area Network-1 (WLAN-1) model is -60 dBm, the signal strength received by the WLAN-2 model is -57.5 dBm, and the signal strength received by the PNNA model is -52.5 dBm. Therefore, the proposed intelligent parallel algorithm has a remarkable effect on data signal enhancement. It has important reference value for studying the intelligent processing of graphic signal data.",
    "citation_count": 26,
    "year": "2024/10",
    "authors": [
        {
            "name": "Huang, Changbing",
            "country": "China"
        },
        {
            "name": "Li, Ruibo",
            "country": "USA"
        },
        {
            "name": "Li, Aiping",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}