{
    "url": "https://link.springer.com/article/10.1007/s11036-019-01386-5",
    "title": "Performing Data Assessment in Terms of Sensor Node Positioning over Three Dimensional Wireless Sensor Network",
    "abstract": "The formation of groups over the three-dimensional wireless sensor networks experiences increased overlying of signals because of circular range resulting in data duplications within the network. For addressing the disputes the intention is to model a sensing mechanism for the three-dimensional wireless sensor networks based on standards termed as three-dimensional scattered grouping (3D – SG) scheme. Based on the 3D – SG scheme precise data mining resembles a crucial dispute because of the surrounding noise where the group head node collects and calculates the data over each and every group. Therefore for mining accurate data in each and every group, the intention is to design three-dimensional data assessment (3D – DA) scheme. Additionally, the node positioning policies portray a crucial feature in increasing the data precision in three-dimensional wireless sensor networks. For several cases, the sensor nodes are positioned erratically but for both, the conditions they are not conscious about their positioning for mining increased data in terms of precision. Hence the positioning of nodes in their precise location over the three-dimensional wireless sensor networks is quite an intricate process. The intention is to design a three-dimensional node positioning scheme for locating probable nodes and their positioning policies for increasing the data precision within the network.",
    "citation_count": 15,
    "year": "2019/12",
    "authors": [
        {
            "name": "Karthikeyan, A.",
            "country": "India"
        },
        {
            "name": "Arunachalam, V. P.",
            "country": "India"
        },
        {
            "name": "Karthik, S.",
            "country": "India"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}