{
    "url": "https://link.springer.com/article/10.1007/s11036-016-0730-8",
    "title": "Performance Analysis and Optimisation of FFR-Aided OFDMA Networks using Channel-Aware Scheduling",
    "abstract": "Modern cellular standards typically incorporate interference coordination schemes allowing near universal frequency reuse while preserving reasonably high spectral efficiencies over the whole coverage area. In particular, fractional frequency reuse (FFR) and its variants are deemed to play a fundamental role in the next generation of cellular deployments (B4G/5G systems). This paper presents an analytical framework allowing the downlink performance evaluation of FFR-aided OFDMA networks when using channel-aware scheduling policies. Remarkably, the framework contemplates the use of different rate allocation strategies, thus allowing to assess the network behaviour under ideal (capacity-based) or realistic (throughput-based) conditions. Analytical performance results are used to optimise the FFR parameters as a function of, for instance, the resource block scheduling policy or the density of UEs per cell. Furthermore, different optimisation designs of the FFR component are proposed that allow a tradeoff between throughput performance and fairness by suitably dimensioning the FFR-defined cell-centre and cell-edge areas and the corresponding frequency allocation to each region. Numerical results serve to confirm the accuracy of the proposed analytical model while providing insight on how the different parameters and designs affect network performance.",
    "citation_count": 29,
    "year": "2017/12",
    "authors": [
        {
            "name": "García-Morales, Jan",
            "country": "Spain"
        },
        {
            "name": "Femenias, Guillem",
            "country": "Spain"
        },
        {
            "name": "Riera-Palou, Felip",
            "country": "Spain"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}