{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1109-9",
    "title": "Q-Learning-Based Dynamic Spectrum Access in Cognitive Industrial Internet of Things",
    "abstract": "In recent years, Industrial Internet of Things (IIoT) has attracted growing attention from both academia and industry. Meanwhile, when traditional wireless sensor networks are applied to complex industrial field with high requirements for real time and robustness, how to design an efficient and practical cross-layer transmission mechanism needs to be fully investigated. In this paper, we propose a Q-learning-based dynamic spectrum access method for IIoT by introducing cognitive self-learning technical solution to solve the difficulty of distributed and ordered self-accessing for unlicensed terminals. We first devise a simplified MAC access protocol for unlicensed users to use single available channel. Then, a Q-learning-based multi-channels access scheme is raised for the unlicensed users migrating to other lower cells. The channel with most Q value will be considered to be selected. Every mobile terminals store and update their own channel lists due to distributed network mode and non-perfect sensing ability. Numerical results are provided to evaluate the performances of our proposed method on dynamic spectrum access in IIoT. Our proposed method outperforms the traditional simplified accessing methods without self-learning capability on channel usage rate and conflict probability.",
    "citation_count": 32,
    "year": "2018/12",
    "authors": [
        {
            "name": "Li, Feng",
            "country": "China"
        },
        {
            "name": "Lam, Kwok-Yan",
            "country": "Singapore"
        },
        {
            "name": "Sheng, Zhengguo",
            "country": "Singapore"
        },
        {
            "name": "Zhang, Xinggan",
            "country": "UK"
        },
        {
            "name": "Zhao, Kanglian",
            "country": "China"
        },
        {
            "name": "Wang, Li",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}