{
    "url": "https://link.springer.com/article/10.1007/s11036-021-01881-8",
    "title": "Research on the Dynamic Monitoring System Model of University Network Public Opinion under the Big Data Environment",
    "abstract": "There are some problems in the network public opinion monitoring, such as long monitoring time, low monitoring accuracy and so on. The network public opinion information of colleges and universities is collected through the public opinion information collection module; the collected network public opinion information is cleaned, filled, corrected and de noised by the public opinion information preprocessing module, and the network public opinion text is processed in parallel based on the parallel computing framework. To obtain the formatted data and extract the text feature items; through the network public opinion analysis module, the machine learning method is used to collect and cluster a large number of documents of the same event, identify the main theme of the document, track and evaluate the public opinion theme; through the network public opinion monitoring module, the probabilistic neural network is used to monitor the abnormal behavior of the university network public opinion data. The simulation results show that the dynamic monitoring system model of university network public opinion constructed in the big data environment has short monitoring time and high monitoring accuracy.",
    "citation_count": 22,
    "year": "2022/12",
    "authors": [
        {
            "name": "He, Wei-na",
            "country": "China"
        },
        {
            "name": "Xia, Dong-liang",
            "country": "China"
        },
        {
            "name": "Liu, Jian-fang",
            "country": "China"
        },
        {
            "name": "Ghosh, Uttam",
            "country": "USA"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}