{
    "url": "https://link.springer.com/article/10.1007/s11036-006-0055-0",
    "title": "Seamless Streaming Media for Heterogeneous Mobile Networks",
    "abstract": "As the mobile networking technologies evolve, people are able to access the Internet through heterogeneous wireless access networks, such as WLAN, GPRS, 3G and Beyond 3G networks. For the coverage, bandwidth and cost of these heterogeneous mobile access networks are quite different, a mobile host may hand over among them, and this is called vertical handoffs. One of the most important issues for heterogeneous mobile networks is that vertical handoffs may degrade the quality of the time-sensitive streaming media services, even interrupt them. To overcome the problem, in the paper a multicast-based redundant streaming architecture is proposed. The proposed architecture is implemented in the all-IPv6 heterogeneous mobile networks. Five experiments are performed to evaluate the performance of the proposed architecture. The experimental results and the analysis show that the proposed architecture is capable of providing seamless streaming services even if the vertical handoffs or the traffic congestion occurs. Moreover, it is found that the traffic overhead is only 1.0368% per vertical handoff for each mobile access network, and thus the feasibility of the proposed architecture is demonstrated.",
    "citation_count": 19,
    "year": "2006/12",
    "authors": [
        {
            "name": "Chou, Li-Der",
            "country": "Republic of China"
        },
        {
            "name": "Chen, Jui-Ming",
            "country": "Republic of China"
        },
        {
            "name": "Kao, Hung-Sheng",
            "country": "Republic of China"
        },
        {
            "name": "Wu, Shao-Feng",
            "country": "Republic of China"
        },
        {
            "name": "Lai, Wayne",
            "country": "Republic of China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}