{
    "url": "https://link.springer.com/article/10.1007/s11036-017-0984-9",
    "title": "User-relay Assignment based Antenna Selection Scheme in Multi-user Multi-relay AF Cooperative Communication Network",
    "abstract": "In this paper, the user-relay assignment based antenna selection scheme for multi-user cooperative network is proposed to improve the transmission bit rate and system performance. The low complexity suboptimal user-relay assignment algorithm is first proposed to simultaneously improve both the system performance and individual user’ performance in the multi-user amplify-and-forward (AF) cooperative user-relay network, where each user can fairly select its best relay according to the instantaneous channel state information (CSI). Based on the user-relay assignment scheme and space shift keying (SSK), we further present the antenna selection scheme to further enhance the system performance for the multi-user AF cooperative user-relay network. In order to minimize the system bit error rate (BER), three antenna selection criteria based on the maximum likelihood (ML) detection have been proposed. Numerical results and theoretical analysis show that the proposed schemes can effectively improve the average system sum rate, the outage probability of the worst user, and the system BER performance, compared with the other schemes.",
    "citation_count": 23,
    "year": "2018/12",
    "authors": [
        {
            "name": "Bai, Zhiquan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Su, Yingyan",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Na",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Qi",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}