{
    "url": "https://link.springer.com/article/10.1007/s11036-018-1101-4",
    "title": "Verifiable Public-Key Encryption with Keyword Search Secure against Continual Memory Attacks",
    "abstract": "Public-key encryption with keyword search (PEKS) enables users to search on encrypted data which is applicable to scenario of sharing data in the cloud storage. The existing PEKS schemes fail to verify the returned result from the tester, i.e. they cannot guarantee the correctness and completeness of the result. In this paper, we resolve this problem by constructing a verifiable PEKS scheme which can efficiently verify the completeness of the result and thus the correctness. We also consider the security of verifiable PEKS scheme against a kind of side-channel attacks called the continual memory attacks which allow the adversary to obtain some leakage information of the secret key used in the search trapdoor generation algorithm and can help it break the security of the scheme. We extend our scheme to an enhanced one which remains secure even when the adversary can obtain unbounded total leakage information during the whole lifetime. Moreover, to make it resist keyword guessing attacks, we extend our scheme to one with a designated tester.",
    "citation_count": 50,
    "year": "2021/12",
    "authors": [
        {
            "name": "Hu, Chengyu",
            "country": "China"
        },
        {
            "name": "Li, Zhen",
            "country": "China"
        },
        {
            "name": "Liu, Pengtao",
            "country": "China"
        },
        {
            "name": "Yang, Rupeng",
            "country": "China"
        },
        {
            "name": "Guo, Shanqing",
            "country": "China"
        },
        {
            "name": "Zhang, Hailong",
            "country": "China"
        }
    ],
    "keywords": [
        "Communications Engineering, Networks",
        "Computer Communication Networks",
        "Electrical Engineering",
        "IT in Business"
    ]
}