{
    "url": "https://link.springer.com/article/10.1007/s10044-014-0375-9",
    "title": "A GA-based feature selection and parameter optimization of an ANN in diagnosing breast cancer",
    "abstract": "Breast cancer is the most common cancer diagnosed and cause of death among women worldwide. There is evidence that early detection and treatment can increase the survival rate of breast cancer patients. The traditional method for diagnosing the disease relies on human experiences to identify the presence of certain pattern from the database. It is prone to human error, time consuming and labour intensive. Therefore, this work proposes an automatic breast cancer diagnosis technique using a genetic algorithm (GA) for simultaneous feature selection and parameter optimization of an artificial neural network (ANN). The proposed algorithm is implemented with three different variations of the backpropagation technique namely the resilient back-propagation (GAANN_RP), Levenberg–Marquardt (GAANN_LM) and gradient descent with momentum (GAANN_GD) for fine tuning of the weight of ANN, and their performances are compared. Besides, the effect of the feature selection and manual determination of the hidden node size has also been investigated. Interestingly, one of the proposed algorithms called GAANN_RP produces the best and on average, 99.24 and 98.29&nbsp;% correct classification, respectively, on the Wisconsin breast cancer dataset, which is comparable with the results gathered from other works found in the literature.",
    "citation_count": 53,
    "year": "2015/11",
    "authors": [
        {
            "name": "Ahmad, Fadzil",
            "country": "Malaysia"
        },
        {
            "name": "Mat Isa, Nor Ashidi",
            "country": "Malaysia"
        },
        {
            "name": "Hussain, Zakaria",
            "country": "Malaysia"
        },
        {
            "name": "Osman, Muhammad Khusairi",
            "country": "Malaysia"
        },
        {
            "name": "Sulaiman, Siti Noraini",
            "country": "Malaysia"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}