{
    "url": "https://link.springer.com/article/10.1007/s10044-022-01068-1",
    "title": "A hybrid loss balancing algorithm based on gradient equilibrium and sample loss for understanding of road scenes at basic-level",
    "abstract": "Object detection is indispensable to visual environment sensing at basic-level. During that detection there are imbalance between the losses of multi-task and multi-object in state-of-the-art algorithms, resulting in the slowdown of training process and low precision. To address this issue, a hybrid loss balancing (HLB) algorithm combined a loss balancing strategy based on gradient equilibrium (LBGE) with a multi-sample loss balancing (MSLB) strategy is proposed. The LBGE strategy increases the accuracy of the Basic network by 3.38% on VOC dataset and by 4.22% on KITTI dataset by updating the weight of each loss during the training iteration. The MSLB strategy with the optimal super-parameter value 200 can improve the accuracy of the basic network by 2.51% on VOC dataset and by 6.62% on KITTI dataset by assigning larger weights to the proposal regions which are more difficult to train. With both strategies working together, the proposed HLB algorithm improves the accuracy by 3.88% on VOC and by 7.24% on KITTI, enhancing robustness to the cross-domain datasets than single strategy. Moreover, the proposed HLB loss function obtains the highest accuracy at 84.02%, a 2.39% higher than that of original loss and other loss functions on average. In a word, the HLB algorithm with the LBGE and MSLB strategies have better understanding ability of basic-level road scenes than Basic network on VOC and KITTI dataset, and can also accelerate the early training speed of the Basic network.",
    "citation_count": 27,
    "year": "2022/11",
    "authors": [
        {
            "name": "Su, Tao",
            "country": "China"
        },
        {
            "name": "Shi, Ying",
            "country": "China"
        },
        {
            "name": "Xie, Changjun",
            "country": "China"
        },
        {
            "name": "Luo, Wenguang",
            "country": "China"
        },
        {
            "name": "Ye, Hongtao",
            "country": "China"
        },
        {
            "name": "Xu, Lamei",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}