{
    "url": "https://link.springer.com/article/10.1007/s10044-018-0687-2",
    "title": "A novel method for binarization of scene text images and its application in text identification",
    "abstract": "The aim of this article is twofold. First, we propose an effective methodology for binarization of scene images. For our present study, we use the publicly available ICDAR 2011 Born Digital Data set. We introduce a new concept of variance map of a gray-level image for detection of text boundary in an image. Based on this boundary information, the image is binarized by means of adaptive thresholding. This binarization procedure produces a number of connected components. Next, these connected components are examined in order to identify possible text components. In this context, a number of shape-based features that distinguish between text and non-text components are proposed. We consider text component identification as an one-class classification problem, i.e., the ground truth information for only the text class is available for the ICDAR 2011 Born Digital Data set. Then, the ground truth text components are used to obtain a certain statistical distribution of the shape-based features. Here, we observe that all the features may not follow a single family of distributions. Therefore, we construct a joint distribution by using multivariate Gaussian copula which allows a coupling of different marginal distributions. As our experiments suggest, the copula-based method is superior to multivariate Gaussian distribution in describing the feature distribution. Finally, a text connected component of an unknown class is subjected to the trained statistical model, and by performing a hypothesis test we successfully identify a possible text component. For a comparative study, we consider a number of state-of-the-art methods. Our proposed approach significantly outperforms most of these methods in terms of recall, precision and F-measure in both the binarization and text identification tasks.",
    "citation_count": 33,
    "year": "2019/11",
    "authors": [
        {
            "name": "Ghoshal, Ranjit",
            "country": "India"
        },
        {
            "name": "Roy, Anandarup",
            "country": "India"
        },
        {
            "name": "Banerjee, Ayan",
            "country": "India"
        },
        {
            "name": "Dhara, Bibhas Chandra",
            "country": "India"
        },
        {
            "name": "Parui, Swapan K.",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}