{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01355-z",
    "title": "A novel robust generalized eigenvalue proximal support vector machine for pattern classification",
    "abstract": "By minimizing the p-order of $$L_{2}$$ -norm distance of the objection function of the improved generalized eigenvalue proximal support vector machine (IGEPSVM), the $$L_{2,p}$$ -LIGEPSVM is proposed in this paper. Firstly, the solution of the $$L_{2,p}$$ -LIGEPSVM is demonstrated to be related to the minimum eigenvalue of the correlation matrix, and an improved inverse power method is devised to solve the $$L_{2,p}$$ -LIGEPSVM. Compared with IGEPSVM, $$L_{2,p}$$ -LIGEPSVM not only retains the advantages of linear IGEPSVM, but also overcomes the shortcomings of exaggeration of outliers based on squared Frobenius-norm distance metrics. Furthermore, the main improvements of $$L_{2,p}$$ -LIGEPSVM over IGEPSVM are the robustness and learning efficiency in solving outlier problems. Finally, in order to illustrate the effectiveness and accuracy of the proposed algorithms, five other relevant algorithms are tested on the artificial and the UCI datasets. The classification accuracy of the two algorithms of $$L_{2,p}$$ -LIGEPSVM on the Artificial, Australian, Cancer and Sonar datasets are (83%, 84.2%), (98.70%, 99.25%), (98.84%, 98.77%) and (95.65%, 95.70%), respectitvely, and they are all higher than other related 5 algorithms. Experimental results show that $$L_{2,p}$$ -LIGEPSVM has some obvious advantages, such as not sensitive to outliers, resistant to noise, high computational efficiency and effective to classification. It is worth mentioning that we introduce the application of the proposed method and elaborate on its economic value.",
    "citation_count": 47,
    "year": "2024/12",
    "authors": [
        {
            "name": "Xiong, Weizhi",
            "country": "People’s Republic of China"
        },
        {
            "name": "Yu, Guolin",
            "country": "People’s Republic of China"
        },
        {
            "name": "Ma, Jun",
            "country": "People’s Republic of China"
        },
        {
            "name": "Liu, Sheng",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}