{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01312-w",
    "title": "A novel residual fourier convolution model for brain tumor segmentation of mr images",
    "abstract": "Magnetic resonance imaging is an essential tool for the early diagnosis of brain tumors. However, it is challenging for the segmentation of the brain tumor of magnetic resonance images due to the most severe problem of blurred boundaries and variable spatial structure. Therefore, combining multiple brain datasets, a novel residual Fourier convolution model with local interpretability is presented to address mentioned above problem in this study. Firstly, an interpretable residual Fourier convolution encoder is constructed by the Fourier transform and its inverse for fast extraction of the spectral features of the brain tumor regions. Furthermore, the dilated-gated attention mechanism is designed to expand the receptive fields and extract blurred irregular boundary features that are closer to the lesion regions. Finally, the encoder-decoder spatial attention fusion mechanism is developed to further extract more fine-grained contextual spatial features from the variable spatial structure of adjacent magnetic resonance slices. Compared to other advanced models, our proposed model has achieved state-of-the-art average segmentation performance by testing on the BraTS2019, Figshare, and TCIA datasets. The average Dice coefficient, sensitivity, MIoU, and PPV respectively reach to 0.892, 87.1%, 0.843, and 91.5%. The proposed segmentation framework can provide more reliable segmentation results for the early diagnosis of brain tumors because of its robust feature extraction ability, interpretability, and generalization ability.",
    "citation_count": 80,
    "year": "2024/12",
    "authors": [
        {
            "name": "Zhu, Haipeng",
            "country": "China"
        },
        {
            "name": "He, Hong",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}