{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01429-6",
    "title": "Accumulating global channel-wise patterns via deformed-bottleneck recalibration for image classification",
    "abstract": "Embedding attention modules into deep convolutional neural networks (CNNs) is currently one of the common deliberations to enhance their learning ability of feature representation. In previous works, the global channel-wise patterns of a given tensor are computed and squeezed into CNN-based models through an attention mechanism. Squeezing different kinds of these features can lead to the less fusion of attentive information due to the independent operations of channel-wise recalibration. To deal with this issue, an efficient attention module of accumulated features ( $$\\textrm{MAF}$$ ) is proposed by accumulating these diverse squeezes for a unitary recalibrating perceptron as follows. Firstly, we take advantage of average and deviation calculations to produce correspondingly statistical patterns of a given tensor for aggregating the global channel information. An adaptative perceptron of deformed-bottleneck recalibration ( $$\\textrm{DBR}$$ ) is then presented to cohere the resultant features. Finally, the robust $$\\textrm{DBR}$$ -based lightweights will be utilized to weight the concerning tensor. Additionally, to exploit more spatial-wise information, we address $$\\textrm{MAF}$$ for an effective alternative of the channel-wise component in two critical attention units to form two corresponding modules that will be then inspected to indicate which integration is good for real applications. We adapt the MAF-based modules to MobileNets for further enhancement investigation. Experiments on benchmark datasets for image classification have proved the efficacy of our proposals. The code of the MAF module is available at https://github.com/nttbdrk25/MAFAttention .",
    "citation_count": 80,
    "year": "2025/06",
    "authors": [
        {
            "name": "Nguyen, Thanh Tuan",
            "country": "Vietnam"
        },
        {
            "name": "Nguyen, Thanh Phuong",
            "country": "France"
        },
        {
            "name": "Nguyen, Vincent",
            "country": "France"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}