{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01348-y",
    "title": "Adaptive aquila optimizer for centralized mapping and exploration",
    "abstract": "The Variable Aquila Optimization Algorithm, designed especially for Multi-Robot Search in uncharted territory, is introduced in this paper. The framework, called Coordinated Multi-robot Exploration Variable Aquila Optimizer (CME-VAO), combines a modified version of the Aquila Optimizer (AO) swarm-based approach with deterministic Coordinated Multi-agent Exploration (CME). With the introduction of stochastic parameters, this integration dynamically adapts the traditional Aquila optimization technique to increase exploration rates. Deterministic CME, which assesses nearby cells surrounding the agents to ascertain cost and utility values, is the first step in the CME-VAO architecture. Exploration efficiency is then further enhanced via Variable Aquila optimization. The effectiveness of the suggested method was confirmed using comprehensive simulations conducted in various environmental settings. Some newer algorithms, like CME-Aquila and CME-Grey Wolf Optimizer (CME-GWO), were used to compare the results. Things like exploration time, failed runs, and area coverage in different conditions were taken into account. We used many simulations with different environmental conditions to find the average coverage percentage and exploration time so that we could compare them statistically with CME-AO and CME-GWO. Results highlight the unique benefit of the suggested algorithm, exhibiting enhanced map exploration with much shorter execution times and few fail runs. All things considered, the CME-VAO architecture significantly improves map navigation in crowded areas in less time during exploration. This puts the suggested methodology in a highly advantageous position for on-board use in dynamic contexts where extended convergence periods or failures of traditional optimization methods are possible.",
    "citation_count": 64,
    "year": "2024/12",
    "authors": [
        {
            "name": "Gul, Faiza",
            "country": "Pakistan"
        },
        {
            "name": "Mir, Imran",
            "country": "Pakistan"
        },
        {
            "name": "Abualigah, Laith",
            "country": "Pakistan"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}