{
    "url": "https://link.springer.com/article/10.1007/s10044-018-0688-1",
    "title": "An implementation of optimized framework for action classification using multilayers neural network on selected fused features",
    "abstract": "In video sequences, human action recognition is a challenging problem due to motion variation, in frame person difference, and setting of video recording in the field of computer vision. Since last few years, applications of human activity recognition have increased significantly. In the literature, many techniques are implemented for human action recognition, but still they face problem in contrast of foreground region, segmentation, feature extraction, and feature selection. This article contributes a novel human action recognition method by embedding the proposed frames fusion working on the principle of pixels similarity. An improved hybrid feature extraction increases the recognition rate and allows efficient classification in the complex environment. The design consists of four phases, (a) enhancement of video frames (b) threshold-based background subtraction and construction of saliency map (c) feature extraction and selection (d) neural network (NN) for human action classification. Results have been tested using five benchmark datasets including Weizmann, KTH, UIUC, Muhavi, and WVU and obtaining recognition rate 97.2, 99.8, 99.4, 99.9, and 99.9%, respectively. Contingency table and graphical curves support our claims. Comparison with existent techniques identifies the recognition rate and trueness of our proposed method.",
    "citation_count": 71,
    "year": "2019/11",
    "authors": [
        {
            "name": "Khan, Muhammad Attique",
            "country": "Pakistan"
        },
        {
            "name": "Akram, Tallha",
            "country": "Pakistan"
        },
        {
            "name": "Sharif, Muhammad",
            "country": "Pakistan"
        },
        {
            "name": "Javed, Muhammad Younus",
            "country": "Pakistan"
        },
        {
            "name": "Muhammad, Nazeer",
            "country": "Pakistan"
        },
        {
            "name": "Yasmin, Mussarat",
            "country": "Pakistan"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}