{
    "url": "https://link.springer.com/article/10.1007/s10044-022-01072-5",
    "title": "An outstanding adaptive multi-feature fusion YOLOv3 algorithm for the small target detection in remote sensing images",
    "abstract": "Deep learning-based target detection for optical remote sensing images is a significant research direction in the field of image processing. Different from natural images, remote sensing images are characterized by complex backgrounds, similarity of characteristics between various classes and diverse target scales. In this paper, we propose an adaptive multi-feature fusion YOLOv3 remote sensing small target detection algorithm to cope with these features. In the proposed algorithm, the shallow semantic information is extracted by the accessory feature extraction network, and fused with the deep features extracted by Darknet-53 down-sampling to enrich the semantic and spatial information of the feature layers on the auxiliary network. In addition, the shallow features are filtered using the adaptive feature selection module to refine the effective feature information. A cross-layer feature fusion module is proposed to fuse different feature layers to enhance the connection between the semantic information of feature contexts to obtain more information about the characteristics of small targets. To test the effectiveness of the proposed algorithm, it is validated on the Pascal voc2007 dataset. The experimental results show that the detection accuracy of the proposed algorithm could achieve 88.3%, and evidently superior to the original YOLOv3 algorithm. Finally, the proposed algorithm is applied to detect the small target in remote sensing images. The detection results show that compared with the original YOLOv3 algorithm, the mean average precision(mAP) of the proposed algorithm is improved by 2.6%, which can effectively detect more small targets and significantly improve the detection accuracy of small targets than other classical algorithms.",
    "citation_count": 24,
    "year": "2022/11",
    "authors": [
        {
            "name": "Li, Guoqiang",
            "country": "China"
        },
        {
            "name": "Hao, Xinyu",
            "country": "China"
        },
        {
            "name": "Zha, Linlin",
            "country": "China"
        },
        {
            "name": "Chen, Anbang",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}