{
    "url": "https://link.springer.com/article/10.1007/s10044-021-01010-x",
    "title": "Clustering and classification with inertia weight and elitism-based particle swarm optimization",
    "abstract": "Clustering and classification-based pattern recognition techniques are widely used in various domains. While many approaches exist to perform these tasks, it remains a difficult process to perform clustering and classification simultaneously for particular datasets. In this paper, a method based on k-nearest neighbor (KNN) is presented to classify the dataset with PSO optimized k-medoids clustering. Initial clustering with k-medoids algorithm divides the dataset into smaller and disjoint clusters featuring similarity within clusters and dissimilarity with members of other clusters. Particle swarm optimization (PSO) is an evolutionary algorithm mainly used to optimize the issues in several research areas including data analytics. The fitness function of the PSO approach mentioned in this paper is based on inertia weights that identify the particles with the best positions and velocities for optimization. Additionally, PSO uses a novel elitism concept that allows massive searching capability between the swarm of particles to achieve a better convergence rate. Because of this property, it can be applied throughout different machine learning fields. Moreover, the KNN classifier outperforms the classification task in terms of classifying the optimized particles with high accuracy. The performance of the proposed technique is evaluated by experimenting with datasets taken from open sources. The simulation results revealed that the performance of the proposed method is better than the existing methods in terms of effective clustering as well as accurate classification.",
    "citation_count": 31,
    "year": "2021/11",
    "authors": [
        {
            "name": "Murugan, T. Mathi",
            "country": "India"
        },
        {
            "name": "Baburaj, E.",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}