{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01447-4",
    "title": "Conversion-aware forecasting of Alzheimer’s disease via featurewise attention",
    "abstract": "Alzheimer’s disease (AD) is a neurodegenerative disorder that leads to cerebral atrophy, impacting memory and cognitive abilities. A precursor to AD known as Mild Cognitive Impairment (MCI) shows subtle symptoms that do not overwhelm the patients’ daily activities. MCI patients might eventually progress to AD in later stages. Early detection of the conversion is a vital step in preventative treatment planning. However, conversion detection is challenging due to the rarity of conversion visits in public datasets and the unknown nature of the conversion. This study aims to improve conversion detection with an attention-based architecture designed to encode input biomarkers and time into a shared space where time and attribute embeddings are fused with attention. Temporal information is incorporated as a separate modality with time embeddings to capture the correlation between time and feature significance for the model’s predictions. Experiments with widely used public databases (TADPOLE and NACC) show encouraging performance in conversion detection. In TADPOLE, a conversion recall of 74.3%, significantly outperforming baseline models such as logistic regression (36.9%) and Long Short-Term Memory networks (62.3%), is reported while maintaining an area under the curve (AUC) score of 82.0%. In NACC, our model demonstrates a competitive conversion recall of 71.6% and an AUC of 82.6%. The experimental results highlight the contribution of the attention between time and attributes to MCI-AD conversion recall. The experimental analyses hold promise for assisting physicians in designing targeted preventative treatment strategies for at-risk individuals. The implementation of the proposed method is available at https://github.com/ALLab-Boun/FATE-Net .",
    "citation_count": 33,
    "year": "2025/06",
    "authors": [
        {
            "name": "Karasu, Elvan",
            "country": "Turkey"
        },
        {
            "name": "Baytaş, İnci M.",
            "country": "Turkey"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}