{
    "url": "https://link.springer.com/article/10.1007/s10044-017-0626-7",
    "title": "Dynamic protein–protein interaction networks construction using firefly algorithm",
    "abstract": "Protein–protein interaction (PPI) networks are dynamic in the real world. That is, at different times and under different conditions, the interaction among proteins may or may not be active. In different dataset, PPI networks might be gathered as static or dynamic networks. For the conversion of static PPI networks to time graphs, i.e., dynamic PPI networks, additional information like gene expression and gene co-expression profiles is used. One of the challenges in system biology is to determine appropriate thresholds for converting static PPI networks to dynamic PPI networks based on active proteins. In the available methods, fixed thresholds are used for all genes. However, the purpose of this study is to determine an adaptive unique threshold for each gene. In this study, the available additional information at different times and conditions and gold-standard protein complexes was employed to determine fitting thresholds. By so doing, the problem is converted into an optimization problem. Thereafter, the problem is solved using the firefly meta-heuristic optimization algorithm. One of the most remarkable aspects of this study is determining the attractiveness function in the firefly algorithm. In this study, attraction is defined as a combination of standard complexes and gene co-expressions. Then, active proteins are specified utilizing the created thresholds. The MCL, ClusterOne, MCODE and Coach algorithms are used for final evaluation. The experimental results about BioGRID dataset and CYC2008 gold-standard protein complexes indicated that the produced dynamic PPI networks by the proposed method have better results than the earlier methods.",
    "citation_count": 58,
    "year": "2018/11",
    "authors": [
        {
            "name": "Mohammadi Jenghara, Moslem",
            "country": "Iran"
        },
        {
            "name": "Ebrahimpour-Komleh, Hossein",
            "country": "Iran"
        },
        {
            "name": "Parvin, Hamid",
            "country": "Iran"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}