{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01341-5",
    "title": "Hidden Markov models with multivariate bounded asymmetric student’s t-mixture model emissions",
    "abstract": "Hidden Markov models (HMMs) are popular methods for continuous sequential data modeling and classification tasks. In such applications, the observation emission densities of the HMM hidden states are generally continuous, can vary from one model to the other, and are typically modeled by elliptically contoured distributions, namely Gaussians or Student’s t-distributions. In this context, this paper proposes a novel HMM with Bounded Asymmetric Student’s t-Mixture Model (BASMM) emissions. Our new BASMMHMM is introduced in the light of the added robustness guaranteed by the BASMM in comparison to other popular emission distributions such as the Gaussian Mixture Model (GMM). In fact, GMMs generally have a limited performance with outliers in the data sets (observations) that the HMM is fitted to. Also, GMMs cannot sufficiently model skewed populations, which are typical in many fields, such as financial or signal processing-related data sets. An excellent alternative to solve this problem is found in Student’s t-mixture models. They have similar behaviour and shape to GMMs, but with heavier tails. This allows to have more tolerance towards data sets that span extensive ranges and include outliers. Asymmetry and bounded support are also important features that can further extend the model’s flexibility and fit the imperfections of real-world data. This leads us to explore the effectiveness of the BASMM as an observation emission distribution in HMMs, hence the proposed BASMMHMM. We will also demonstrate the improved robustness of our model by presenting the results of three different experiments: occupancy estimation, stock price prediction, and human activity recognition.",
    "citation_count": 41,
    "year": "2024/12",
    "authors": [
        {
            "name": "Bouarada, Ons",
            "country": "Canada"
        },
        {
            "name": "Azam, Muhammad",
            "country": "Canada"
        },
        {
            "name": "Amayri, Manar",
            "country": "Canada"
        },
        {
            "name": "Bouguila, Nizar",
            "country": "Canada"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}