{
    "url": "https://link.springer.com/article/10.1007/s10044-021-01014-7",
    "title": "HSIC-based affinity measure for learning on graphs",
    "abstract": "The performance of graph-based learning techniques largely relies on the edges defined between the vertices of the graph. These edges that represent the affinity between vertices must be learned from data. In this paper, we propose statistical dependence as a measure of affinity for learning the structure of graphs from data. It is assumed that the data lies on a high-dimensional Riemannian manifold, but the neighborhood is not known. Due to unknown characteristics of the underlying manifold, Euclidean distance (ED) does not capture the affinity between the data points accurately and cannot be used to construct the adjacency matrix. A scalable Hilbert–Schmidt independence criterion (HSIC)-based affinity technique is proposed to learn the nonlinear dependence between the data points. The pairwise affinities are captured by dividing the data into small chunks, which also makes the technique scalable. Once the pairwise affinity between data points is computed using HSIC-based dependence, $$\\mu$$ nearest neighboring points are determined to construct the graph. The data points represented by the graph lie on a high-dimensional Riemannian manifold with every data point having $$\\mu$$ neighbors. Dimensionality reduction is performed, followed by classification. Experiments on both synthetic and real-world dataset give accurate low-dimensional representation with preservation of maximum local linear structures. The random walk illustration of both ED and proposed HSIC-based affinity shows that the proposed affinity measure is able to identify and link similar data points. The increase in kNN, SVM and decision tree classifiers’ accuracies on low-dimensional data achieved using graph Laplacian on HSIC-based affinity matrix proves the efficiency of the proposed affinity metric for graph-based learning.",
    "citation_count": 43,
    "year": "2021/11",
    "authors": [
        {
            "name": "Yadav, Rakesh Kumar",
            "country": "India"
        },
        {
            "name": "Abhishek",
            "country": "India"
        },
        {
            "name": "Yadav, Vijay Kumar",
            "country": "India"
        },
        {
            "name": "Verma, Shekhar",
            "country": "India"
        },
        {
            "name": "Venkatesan, S.",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}