{
    "url": "https://link.springer.com/article/10.1007/s10044-025-01430-z",
    "title": "Multi-scale adaptive detail enhancement dehazing network for autonomous driving perception images",
    "abstract": "In hazy weather conditions, a significant accumulation of haze poses a severe challenge to the quality of image capture for autonomous driving systems, thereby heightening safety risks for autonomous vehicles. To solve this problem, we propose the multi-scale adaptive detail enhancement dehazing network, an innovative architecture comprising the initial feature extraction module, the multi-scale adaptive feature module, and the terminal detail enhancement module, specifically designed to eradicate haze with precision. To enhance the extraction of multi-scale features, the multi-scale adaptive feature module employs the squeeze-excitation residual dense block (SRD). It not only learns the intricate multi-scale features of the image but also adaptively recalibrates the feature response of each feature map, ultimately bolstering the network’s performance and resilience. The terminal detail enhancement module, crafted with the dilation refinement block (DRB), serves as a compensatory measure for any detail loss or pseudo-artifacts that might arise from the multi-scale adaptive feature module’s operations. By incorporating the terminal detail enhancement module, the overall dehazing effect is further optimized. Empirical evaluations reveal that the proposed multi-scale adaptive detail enhancement dehazing network achieves impressive results, with a PSNR value of 30.82, an SSIM value of 0.967, and an LPIPS value of 0.033. These figures indicate that the network is adept at removing haze from images while preserving intricate details, ensuring the efficacy and reliability of autonomous driving systems in hazy environments. Code is available at https://github.com/murong-carl/Adaptive-multi-scale-detail-enhancement-dehazing-network .",
    "citation_count": 45,
    "year": "2025/06",
    "authors": [
        {
            "name": "Wang, Juan",
            "country": "China"
        },
        {
            "name": "Wang, Sheng",
            "country": "China"
        },
        {
            "name": "Wu, Minghu",
            "country": "China"
        },
        {
            "name": "Yang, Hao",
            "country": "China"
        },
        {
            "name": "Cao, Ye",
            "country": "China"
        },
        {
            "name": "Hu, Shuyao",
            "country": "China"
        },
        {
            "name": "Shao, Jixiang",
            "country": "China"
        },
        {
            "name": "Zeng, Chunyan",
            "country": "China"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}