{
    "url": "https://link.springer.com/article/10.1007/s10044-024-01358-w",
    "title": "Multicriteria decision making analysis based on Fermatean fuzzy distance measure and entropy measure with application in COVID-19",
    "abstract": "Multi Criteria Decision Making (MCDM) is a crucial tool for addressing uncertainty in complex problems owing to its transparent, flexible, and technological approach to evaluating alternatives based on conflicting criteria. Fermatean Fuzzy Set is an efficient method for exhibiting expert argumentation information in complex decision-making issues. In this study, we propose a novel Fermatean Fuzzy Distance Measure to quantify the inconsistency between two Fermatean Fuzzy Sets by employing the cross-evaluation factor. Based on the introduced Distance measure, we propose a novel Fermatean Fuzzy Entropy Measure. Furthermore, we demonstrated that the recently presented Distance and Entropy measure correspond to the axiomatic representation anticipated by an Fermatean Fuzzy Distance and Entropy measure, respectively. Several propositions are derived from the proposed distance measure. In addition, the proposed measures are employed to address MCDM problems on COVID-19 in an Fermatean Fuzzy environment that produces commendable outcomes. The findings of the investigation indicate that the proposed measure demonstrates better capabilities in real-world applications within an FF environment, generating more robust and reliable information compared to existing Distance and Entropy measures on IFS, PFS, and FFS. In the future, the proposed approaches could potentially be applied to pattern recognition, image processing, and other MCDM fields of study.",
    "citation_count": 53,
    "year": "2025/06",
    "authors": [
        {
            "name": "Dutta, Palash",
            "country": "India"
        },
        {
            "name": "Konwar, Alakananda",
            "country": "India"
        }
    ],
    "keywords": [
        "Pattern Recognition"
    ]
}