{
    "url": "https://link.springer.com/article/10.1007/s10617-013-9126-1",
    "title": "A self-adaptive fault-tolerant systems for a dependable Wireless Sensor Networks",
    "abstract": "As the size and complexity of Wireless Sensor Networks (WSN) continue to grow, there is a need to develop techniques capable of achieving a level of service with successful operations upon which users can depend on. The routing protocol plays an important role in a multihop WSN as it manages and controls the delivery of the data packets. The function of a WSN can be affected by radio anomalies that may degrade the performance of the network. Unreliable and irregular link qualities, due to interference, are common in WSN as the nodes use the same frequency range as the other radio devices. A self-adaptive fault-tolerant network is required that has ability to maintain the level of service even in the presence of faults. Each node needs to monitor and adapt its routing protocols according to the operating environment. Due to resources constraint in the node, it must be carried out in an energy-efficient way and must be dependable. In this paper, we propose an immune-inspired algorithm that provides a level of “self-healing” in the network, through a combined process of self-detection, self-diagnosis and self-recovery and the Immune-inspired Detection and Recovery Systems (IDRS) is presented. In order to evaluate the performance of IDRS, a trace-based simulation, using traces from the hardware, is proposed to analyse the robustness and scalability. The Systematic Protocol Evaluation Technique (SPET) is applied to measure the dependability of the routing protocol. The proposed solution immune-inspired solution using multi-modal mechanism has achieved a higher dependability than existing reactive routing approaches and can adapt to the current operating environment to achieve the level of service required. Both the hardware and simulation results have validated the accuracy and the performance of the proposed systems. The simulated results have demonstrated that the IDRS can be scaled to a larger networks.",
    "citation_count": 42,
    "year": "2014/09",
    "authors": [
        {
            "name": "Lim, Tiong Hoo",
            "country": "UK"
        },
        {
            "name": "Bate, Iain",
            "country": "Negara Brunei Darussalam"
        },
        {
            "name": "Timmis, Jon",
            "country": "UK"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}