{
    "url": "https://link.springer.com/article/10.1007/s10617-013-9115-4",
    "title": "An efficient Resource Management to optimize the placement of hardware task on FPGA in the RVC framework",
    "abstract": "Dynamic partial reconfiguration (DPR) functionality allows implementing multi-tasks applications by exchanging tasks in a design at run-time. It is a promising solution to enhance system performances. But, the effective use of DPR is often hampered by the complexity added to the system design process. In this paper, we investigate the implementation of a multi-tasks applications using the DPR in the RVC framework. We present a resource management method which includes three steps: partitioning the application in HW/SW tasks, divided the FPGA in static and dynamic regions and placement the tasks on FPGA. The proposed method is based on using linear programming strategy to find the optimal placement of hardware tasks. We take into account the heterogeneity aspect of the device. The goal is to minimize the resource utilization and fragmentation. We use RVC technology which is based on a specific language for writing dataflow models called RVC-CAL. This language describes the application as set of blocks called actors connected through a network. To test the efficiency of our approach, we exploit the decoder MPEG-4 SP described in RVC-CAL. We measure the quality of placement in terms of tasks rejection, execution time and resource wastage. Application of different data combinations and a comparison with the state-of-the art method show the high performance of the proposed approach.",
    "citation_count": 31,
    "year": "2012/11",
    "authors": [
        {
            "name": "Hentati, Manel",
            "country": "France"
        },
        {
            "name": "Elaoud, Samya",
            "country": "Tunisia"
        },
        {
            "name": "Aoudni, Yassine",
            "country": "Tunisia"
        },
        {
            "name": "Nezan, Jean-François",
            "country": "Tunisia"
        },
        {
            "name": "Abid, Mohamed",
            "country": "France"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}