{
    "url": "https://link.springer.com/article/10.1007/s10617-009-9041-7",
    "title": "An optimization based design for integrated dependable real-time embedded systems",
    "abstract": "Moving from the traditional federated design paradigm, integration of mixed-criticality software components onto common computing platforms is increasingly being adopted by automotive, avionics and the control industry. This method faces new challenges such as the integration of varied functionalities (dependability, responsiveness, power consumption, etc.) under platform resource constraints and the prevention of error propagation. Based on model driven architecture and platform based design’s principles, we present a systematic mapping process for such integration adhering a transformation based design methodology. Our aim is to convert/transform initial platform independent application specifications into post integration platform specific models. In this paper, a heuristic based resource allocation approach is depicted for the consolidated mapping of safety critical and non-safety critical applications onto a common computing platform meeting particularly dependability/fault-tolerance and real-time requirements. We develop a supporting tool suite for the proposed framework, where VIATRA (VIsual Automated model TRAnsformations) is used as a transformation tool at different design steps. We validate the process and provide experimental results to show the effectiveness, performance and robustness of the approach.",
    "citation_count": 67,
    "year": "2009/12",
    "authors": [
        {
            "name": "Islam, Shariful",
            "country": "Germany"
        },
        {
            "name": "Suri, Neeraj",
            "country": "Germany"
        },
        {
            "name": "Balogh, András",
            "country": "Hungary"
        },
        {
            "name": "Csertán, György",
            "country": "Hungary"
        },
        {
            "name": "Pataricza, András",
            "country": "Hungary"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}