{
    "url": "https://link.springer.com/article/10.1023/A:1008809626433",
    "title": "Design Methodology for a DVB Satellite Receiver ASIC",
    "abstract": "This contribution describes design methodology and implementation of a single-chip timing and carrier synchronizer and channel decoder for digital video broadcasting over satellite (DVB-S). The device consists of an A /D converter with AGC, timing and carrier synchronizer with matched filter, Viterbi decoder including node synchronization, byte and frame synchronizer, convolutional de-interleaver, Reed Solomon decoder, and a descrambler. The system was designed in accordance with the DVB specifications. It is able to perform Viterbi decoding at data rates up to 56 Mbit /s and to sample the analog input values with up to 88 MHz. The chip allows automatic acquisition of the convolutional code rate and the position of the puncturing mask. The symbol synchronization is performed fully digitally by means of interpolation and controlled decimation. Hence, no external analog clock recovery circuit is needed. For algorithm design, system performance evaluation, co-verification of the building blocks, and functional hardware verification an advanced design methodology and the corresponding tool framework are presented which guarantee both short design time and highly reliable results. The chip has been fabricated in a 0.5 µm CMOS technology with three metal layers. A die photograph is included.",
    "citation_count": 36,
    "year": "1998/12",
    "authors": [
        {
            "name": "Vaupel, Martin",
            "country": "Germany"
        },
        {
            "name": "Lambrette, Uwe",
            "country": "Germany"
        },
        {
            "name": "Dawid, Herbert",
            "country": "Germany"
        },
        {
            "name": "Joeressen, Olaf",
            "country": "Germany"
        },
        {
            "name": "Bitterlich, Stefan",
            "country": "Germany"
        },
        {
            "name": "Meyr, Heinrich",
            "country": "Germany"
        },
        {
            "name": "Frieling, Focko",
            "country": "Germany"
        },
        {
            "name": "Müller, Karsten",
            "country": "Germany"
        },
        {
            "name": "Kluge, Götz",
            "country": "Germany"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}