{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9148-3",
    "title": "Effective file data-block placement for different types of page cache on hybrid main memory architectures",
    "abstract": "Hybrid main memory architectures employing both DRAM and non-volatile memories (NVMs) are becoming increasingly attractive due to the opportunities for exploring benefits of various memory technologies, for example, high speed writes on DRAM and low stand-by power consumption on NVMs. File data-block placement (FDP) on different types of page cache is one of the important problems that directly impact the performance and cost of file operations on a hybrid main memory architecture. Page cache is widely used in modern operating systems to expedite file I/O by mapping disk-backed file data-blocks in main memory to process space in virtual memory. In a hybrid main memory, different types of memory with different read/write costs can be allocated as page cache by operating system. In this paper, we study the problem of file data-block placement on different types of page cache to minimize the total cost of file accesses in a program. We propose a dynamic programming algorithm, the FDP Algorithm, to solve the problem optimally for simple programs. We develop an ILP model for the file data-block placement problem for programs composed of multiple regions with data dependencies. An efficient heuristic, the global file data-block placement (GFDP) Algorithm, is proposed to obtain near-optimal solutions for the problem of global file data-block placement on hybrid main memory. Experiments on a set of benchmarks show the effectiveness of the GFDP algorithm compared with a greedy strategy and the ILP. Experimental results show that the GFDP algorithm reduces the total cost of file accesses by $$51.3~\\%$$ on average compared with the the greedy strategy.",
    "citation_count": 36,
    "year": "2013/09",
    "authors": [
        {
            "name": "Dai, Penglin",
            "country": "China"
        },
        {
            "name": "Zhuge, Qingfeng",
            "country": "China"
        },
        {
            "name": "Chen, Xianzhang",
            "country": "China"
        },
        {
            "name": "Jiang, Weiwen",
            "country": "China"
        },
        {
            "name": "Sha, Edwin H.-M.",
            "country": "China"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}