{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9145-6",
    "title": "Exploration of energy efficient memory organisations for dynamic multimedia applications using system scenarios",
    "abstract": "We propose a memory-aware system scenario approach that exploits variations in memory needs during the lifetime of an application in order to optimize energy usage. Different system scenarios capture the application’s different resource requirements that change dynamically at run-time. In addition to computational resources, the many possible memory platform configurations and data-to-memory assignments are important system scenario parameters. In this work we focus on clustering of different memory requirements into groups and presenting the system scenario generation in detail. The clustering is a non-trivial problem due to the many different memory requirements, which leads to a very large exploration space. An extended memory model is used as a practical enabler, in order to evaluate the methodology. The memory models include existing state-of-the-art memories, available from industry and academia, and we show how they are employed during the system design exploration phase. Both commercial SRAM and standard cell based memory models are explored in this study. The effectiveness of the proposed methodology is demonstrated and tested using a large set of multimedia benchmarks published in the Polybench, Mibench and Mediabench suites, representative for the domain of multimedia applications. Reduction in energy consumption in the memory subsystem ranges from 35 to 55&nbsp;% for the chosen set of benchmarks.",
    "citation_count": 42,
    "year": "2013/09",
    "authors": [
        {
            "name": "Filippopoulos, Iason",
            "country": "Norway"
        },
        {
            "name": "Catthoor, Francky",
            "country": "Belgium"
        },
        {
            "name": "Kjeldsberg, Per Gunnar",
            "country": "Norway"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}