{
    "url": "https://link.springer.com/article/10.1023/A:1008857509595",
    "title": "Modeling a Mobile Cellular Network Using a Discrete-Event Simulator",
    "abstract": "In this paper we introduce a discrete-event-based simulation technology suitable to model cellular mobile radio systems with respect to their dynamic behavior. The latter results in the need for simulation tools which support mutable system configurations. The problems encountered when modeling mutable system configurations using conventional discrete-event simulators are discussed. In order to show a possible solution to this problem we introduce configuration events and configuration objects into the theory of discrete-event simulations. We demonstrate how configuration objects can be implemented in a discrete-event simulator using a dynamic map-function, hereby extending a definition of higher order functions. We apply the configuration objects in a Multiple Layer Model for modeling an entire mobile cellular radio network in a discrete-event simulator as an application for the extended theory. In this model we use the configuration objects to change the network's configuration during runtime. We show that this solution—combined with an object-oriented software design and, possibly, a visual programming language—is a powerful tool for the simulation of the dynamic aspects of mobile cellular radio networks. The software technology presented will be applied by the German cellular network operator Mannesmann Mobilfunk to model dynamic features applicable to the radio resource management of mobile radio networks and to access their performance by simulation.",
    "citation_count": 26,
    "year": "1998/12",
    "authors": [
        {
            "name": "Voigt, Jens",
            "country": "Germany"
        },
        {
            "name": "Steil, Andreas",
            "country": "Germany"
        },
        {
            "name": "Fettweis, Gerhard P.",
            "country": "Germany"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}