{
    "url": "https://link.springer.com/article/10.1007/s10617-014-9149-2",
    "title": "Performance analysis and modeling of SQLite embedded databases on flash file systems",
    "abstract": "Databases are more and more used in embedded system applications and especially in consumer electronics. This comes from the need to structure user and/or system data to be more efficiently managed and accessed. The transactional database management systems widely used in embedded systems have been designed considering hard disk drives as the storage device. In embedded systems, NAND flash memory is the main storage media and its intricacies make it fundamentally different from hard drives on many points of view, in particular in terms of performance and access mode. The performance behavior of on-flash database applications remains largely unknown, and we believe a better adequacy between those applications and flash management systems would lead to strong optimizations. A first step in that process is to assess and understand the performance behavior of database applications on flash memory. For this sake, this paper presents a micro benchmarking and modeling methodology, as well as the associated results and analysis for SQLite database queries on embedded flash specific file systems. SQLite is one of the most used database application in embedded systems and especially consumer electronics. This methodology has been applied and validated on two embedded hardware platforms. Flash file systems (FFS) behavior are very specific to flash memory intricacies and the objective of this study is to highlight the interactions between flash memory, FFSs, and SQLite based applications. The model proved to be very accurate in predicting flash I/O performance for a given workload.",
    "citation_count": 40,
    "year": "2013/09",
    "authors": [
        {
            "name": "Ouarnoughi, Hamza",
            "country": "France"
        },
        {
            "name": "Boukhobza, Jalil",
            "country": "France"
        },
        {
            "name": "Olivier, Pierre",
            "country": "France"
        },
        {
            "name": "Plassart, Loic",
            "country": "France"
        },
        {
            "name": "Bellatreche, Ladjel",
            "country": "France"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}