{
    "url": "https://link.springer.com/article/10.1007/s10617-024-09289-9",
    "title": "Torque regression using machine learning techniques in automotive ECUs",
    "abstract": "With the modernization of the automotive industry, a large amount of data is generated by vehicles during operation. When interpreted analytically, it can result in advances in several areas, such as safety, durability, production efficiency, fuel consumption, and gas emissions. In this work, we focus on engine torque and its regression, to enable the understanding of its behavior and help improve the performance of engines and vehicles, mainly in product development and testing. In addition, it highlights the relationship between torque and misfire for optimizing engine components by showing their impacts, as it is a common failure in combustion engines that impairs engine performance. After a rigorous process of feature selection relevant to torque, we collect data directly from a vehicle’s ECU to train and evaluate machine learning algorithms to perform torque regression without relying on synthetic data or public datasets, using misfire detection as one of the inputs to the algorithms. In a car that reaches a torque of 144 Nm, our results reached up to an RMSE of 3.3830 (Nm) $$^2$$ , MAE of 2.1620 (Nm), and R $$^2$$ of 0.99. Furthermore, our methodology acquired and processed data in real-time at a cloud server, that detects faults and calculates torque with the vehicle in motion, using less computationally demanding algorithms. These findings not only highlight our ability to predict the engine’s torque and its relation with misfires but also our competence in analyzing additional parameters essential to vehicle performance.",
    "citation_count": 43,
    "year": "2024/12",
    "authors": [
        {
            "name": "Canal, Rafael",
            "country": "Brazil"
        },
        {
            "name": "Bonomo, João Paulo Araujo",
            "country": "Brazil"
        },
        {
            "name": "de Carvalho, Rodrigo Santos",
            "country": "Brazil"
        },
        {
            "name": "Gracioli, Giovani",
            "country": "Brazil"
        }
    ],
    "keywords": [
        "Circuits and Systems",
        "Computer-Aided Engineering (CAD, CAE) and Design",
        "Special Purpose and Application-Based Systems"
    ]
}