{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001499",
    "title": "A cascaded differential evolution optimization framework with adaptive population allocation and reduction",
    "abstract": "Differential Evolution (DE) -type algorithms perform efficiently on optimization problems, but for some problems, single DE-type algorithms still cannot achieve good results. Integrating multiple algorithms or strategies is an effective way to improve the performance of a single algorithm. This paper proposes a cascaded DE-type algorithm optimization framework with population adaptive allocation and reduction (cDE-APAR), which improves the performance of a single algorithm by cascading two DE-type algorithms and combining related strategies. The first stage of the algorithm runs a single algorithm. The second stage implements the other algorithm in parallel with a local search strategy and a global search strategy, and allocates resources reasonably among the single algorithm and related strategies through adaptive population allocation. Finally, individuals with the worst performance are eliminated through the population reduction strategy to improve the population's quality. In order to verify the performance of the algorithm, extensive simulations were performed using four test suites of CEC2005, CEC2013, CEC2014, and CEC2017. The results show that cDE-APAR significantly improves the performance of a single algorithm. Compared with nine state-of-the-art algorithms, cDE-APAR is significantly better than the comparison algorithms according to the Wilcoxon rank sum test and has significantly improved the accuracy and stability of the solution.",
    "citation_count": "4",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Yongjun Sun",
            "country": ""
        },
        {
            "name": "Kaiming Zhang",
            "country": ""
        },
        {
            "name": "Zhenzhen Li",
            "country": ""
        },
        {
            "name": "Zujun Liu",
            "country": ""
        }
    ],
    "keywords": []
}