{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002043",
    "title": "A constrained multi-objective evolutionary algorithm with clustering based weight vector adaptation",
    "abstract": "In constrained multi-objective optimization, balancing convergence, diversity, and feasibility of solutions in the population are challenging. Most existing approaches focus on convergence and feasibility but fail to enforce the diversity and uniformity of solutions in the approximated  Pareto Front  (PF). In decomposition-based approaches, the diversity and uniformity of the obtained solution set depend on the set of  weight vectors  employed, which are generally fixed and initialized uniformly. However, Constrained Multi-objective Optimization Problems (CMOPs) are characterized by discontinuous Pareto-optimal fronts due to the presence of constraints. Therefore, to maintain better diversity and uniformity in the population, the weight vector set employed in the framework should consider the characteristics of PF, which is not known in advance. However, during the evolution, the characteristics of PF can be estimated and the associated  weight vectors  can be appropriately distributed. Motivated by this issue, we propose a novel Constrained Multi-Objective Evolutionary Algorithm with a Clustering-based Weight vector Adaptation strategy called CMOEA-CWA. The proposed CMOEA-CWA uses the basic framework of CMOEA-DPMS. After exploring the  search space , CMOEA-CWA reinitializes the  weight vectors  if there exist any discontinuities in the approximated pareto front (PF). In CMOEA-CWA, the PF is approximated using the  feasible solutions  stored in an archive and novel parameter-free clustering techniques. During the clustering process, if there exist any discontinuities in the approximated PF, one population will exploit the feasible regions with a re-initialized set of weight vectors while the other population will explore the feasible regions with uniformly distributed weight vectors. Empirical results obtained on four popular and widely used benchmarks when compared with nine latest state-of-the-art algorithms (ARMOEA, CCMO, TiGE-2, ToP, MOEA/D-DAE, PPS, CTAEA, MOEA/D-2WA and CMOEA-DPMS) suggest the superiority of the proposed algorithm, especially on 47 complicated constrained multi-objective problems. The proposed algorithm performs statistically better than or comparable (in terms of HV) to ARMOEA, CCMO, TiGE-2, ToP, MOEA/D-DAE, PPS, CTAEA, MOEA/D-2WA and CMOEA-DPMS in 91.48 %, 78.72 %, 100 %, 70.21 %, 85.11 %, 78.72 %, 91.49 % and 82.97 % of test instances, respectively. The performance of the proposed algorithm is also demonstrated on a real-world Economic Environmental Dispatch (EED) problem.",
    "citation_count": "1",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Sri Srinivasa Raju M",
            "country": ""
        },
        {
            "name": "Saykat Dutta",
            "country": ""
        },
        {
            "name": "Rammohan Mallipeddi",
            "country": ""
        },
        {
            "name": "Kedar Nath Das",
            "country": ""
        },
        {
            "name": "Dong-Gyu Lee",
            "country": ""
        }
    ],
    "keywords": []
}