{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000937",
    "title": "A cooperative iterated greedy algorithm for the distributed flowshop group robust scheduling problem with uncertain processing times",
    "abstract": "This paper studies a distributed flowshop group robust scheduling problem with uncertain processing times, which has great significance in actual production activities. First, we formulate the problem and establish a robust mathematical model with an expect-risk rule. Second, we develop an effective cooperative iterated greedy (CIG) algorithm to address the studied problem. In the CIG, we propose a  heuristic method  with two modified sequence rules to obtain an initial solution. We present a dummy scenario method to reduce the complexity of the multi-scenario environment and speed up the process of convergence. We utilize different iterated greedy processes to optimize the family scheduling sub-problem and job scheduling sub-problem respectively. In each iterated greedy process, we design the corresponding operators based on the problem-specific characteristics. We also propose a cooperation mechanism to link the iterated greedy processes to emphasize the coupling relationship between the two sub-problems. Finally, we conduct comparative and comprehensive evaluation experiments by comparing the CIG with six high-performing algorithms in the literature. The results indicate that the proposed CIG significantly outperforms the other competitors from the average relative deviation index.",
    "citation_count": "23",
    "year": "2023/06/01",
    "authors": [
        {
            "name": "Zhi-Yuan Wang",
            "country": ""
        },
        {
            "name": "Quan-Ke Pan",
            "country": ""
        },
        {
            "name": "Liang Gao",
            "country": ""
        },
        {
            "name": "Xue-Lei Jing",
            "country": ""
        },
        {
            "name": "Qing Sun",
            "country": ""
        }
    ],
    "keywords": []
}