{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002390",
    "title": "A cooperative evolutionary algorithm with simulated annealing for integrated scheduling of distributed flexible job shops and distribution",
    "abstract": "Production and distribution are two essential parts in supply chains. An integration of production and distribution has received amount of attention from both academia and industry. This article investigates an integrated scheduling problem of distributed flexible job shops and distribution. First, a mixed  integer programming  model is developed to minimize maximum completion time. Second, a cooperative evolutionary algorithm with simulated annealing methods is proposed in consideration of the problem's characteristics. A three-link integer string is designed to represent three parts, i.e., factory assignment, machine assignment and operation sequence, in a solution. Three populations are constructed to search the above three parts via genetic operations and simulated annealing methods, respectively. A cooperation strategy is designed to generate a schedule. Then, a heuristic rule is devised to determine the delivery scheme for distribution. Finally, experiments are carried out via extending a set of benchmark instances. The proposed algorithm is compared to four state-of-the-art algorithms and an exact solver CPLEX. The results and discussions verify that the developed model and method have strong competitiveness for solving the considered problems.",
    "citation_count": "21",
    "year": "2024/03/01",
    "authors": [
        {
            "name": "Zhengpei Zhang",
            "country": ""
        },
        {
            "name": "Yaping Fu",
            "country": ""
        },
        {
            "name": "Kaizhou Gao",
            "country": ""
        },
        {
            "name": "Hui Zhang",
            "country": ""
        },
        {
            "name": "Lei Wang",
            "country": ""
        }
    ],
    "keywords": []
}