{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001323",
    "title": "A constrained many-objective evolutionary algorithm with learning vector quantization-based reference point adaptation",
    "abstract": "Constrained many-objective  optimization problems  (CMaOPs) are frequently encountered in real-world applications, generally having constrained  Pareto fronts  (PFs) that are often incomplete and irregular in high-dimensional  objective space . Due to the advantage of reference point-based decomposition algorithms on unconstrained many-objective optimization, they have been widely applied into dealing with CMaOPs. However, these algorithms may not be well suited for solving the constrained problems with irregular PFs, since their adopted uniformly distributed reference points may not properly fit the distribution of  feasible regions . To address this issue, we propose a constrained many-objective  evolutionary algorithm  with  reference point  adaptation. To be specific, the learning  vector quantization  network is used to collect the feasibility information during the evolutionary search process in the supervised manner. By regarding the feasible and infeasible solutions as two classes of  training samples , the network can gradually model the  topological structure  of the PF and adaptively generate the reference points in the feasible regions. In order to make full use of infeasible solutions to assist in the modeling of the PF, an adaptive  ϵ -truncation based constraint-handling technique is proposed to introduce the elite infeasible solutions during the evolutionary process. Experimental results on several public constrained many-objective optimization test suites demonstrate the competitiveness of the proposed algorithm in comparison with seven state of-the-art algorithms.",
    "citation_count": "5",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Chao Wang",
            "country": ""
        },
        {
            "name": "Huitao Huang",
            "country": ""
        },
        {
            "name": "Huimin Pan",
            "country": ""
        }
    ],
    "keywords": []
}