{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219302652",
    "title": "A collaborative optimization algorithm for energy-efficient multi-objective distributed no-idle flow-shop scheduling",
    "abstract": "Facing the energy crisis, manufacturers is paying much attention to the energy-efficient scheduling by taking both economic benefits and energy conservation into account. Meanwhile, with the economic globalization, it is significant to facilitate the  advanced manufacturing  and scheduling in the distributed way. This paper addresses the energy-efficient distributed no-idle permutation flow-shop scheduling problem (EEDNIPFSP) to minimize makespan and total energy consumption simultaneously. By analyzing the characteristics of the problem, several properties are derived. To solve the problem effectively, a collaborative optimization algorithm (COA) is proposed by using the properties and some collaborative mechanisms. First, two heuristics are collaboratively utilized for population initialization to guarantee certain quality and diversity. Second, multiple search operators collaborate in a competitive way to enhance the exploration adaptively. Third, different local intensification strategies are designed for the dominated and non-dominated individuals to enhance the exploitation. Fourth, a speed adjusting strategy for the non-critical operations is designed to improve total energy consumption. The effect of key parameters is investigated using the design-of-experiment with full factorial setting. Comparisons based on extensive numerical tests are carried out, which demonstrate the effectiveness of the proposed algorithm in solving the EEDNIPFSP.",
    "citation_count": "113",
    "year": "2019/11/01",
    "authors": [
        {
            "name": "Jing-fang Chen",
            "country": ""
        },
        {
            "name": "Ling Wang",
            "country": ""
        },
        {
            "name": "Zhi-ping Peng",
            "country": ""
        }
    ],
    "keywords": []
}