{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218309192",
    "title": "A decomposition-based coevolutionary multiobjective local search for combinatorial multiobjective optimization",
    "abstract": "Multiobjective  evolutionary algorithm  based on decomposition (MOEA/D) divides a multiobjective  optimization problem  into a number of single-objective  subproblems  and solves them in a collaborative way. MOEA/D can be naturally extended by the common, intensification oriented method of  local search  for solving combinatorial multiobjective optimization problems (CMOPs). However, the performance of MOEA/D strongly depends on the distribution of direction vectors and the  decomposition method  it adopts. In this paper, an efficient coevolutionary multiobjective local search based on decomposition (CoMOLS/D) is proposed. In CoMOLS/D, two sets of direction vectors and two populations with different decomposition methods are adopted to coevolve with each other. Among them, one population aims to achieve fast convergence while the other one puts more effort for maintaining the complementarily diverse solutions based on the convergence population. In the experimental studies, CoMOLS/D is compared with four decomposition-based local  search heuristics , i.e., MOEA/D-LS (WS,  TCH , PBI and iPBI); a dominance-based local search, i.e.,  ε -MOEA-LS; an indicator-based local search, i.e., IBEA-LS; and a state-of-the-art local search with dual populations, i.e., ND/DPP-LS; on two well-known CMOPs. The experimental results show that CoMOLS/D significantly outperforms the compared algorithms on most of the test instances.",
    "citation_count": "36",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Xinye Cai",
            "country": ""
        },
        {
            "name": "Mi Hu",
            "country": ""
        },
        {
            "name": "Dunwei Gong",
            "country": ""
        },
        {
            "name": "Yi-nan Guo",
            "country": ""
        },
        {
            "name": "Yong Zhang",
            "country": ""
        },
        {
            "name": "Zhun Fan",
            "country": ""
        },
        {
            "name": "Yuhua Huang",
            "country": ""
        }
    ],
    "keywords": []
}