{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000550",
    "title": "A discrete water source cycle algorithm design for solving production scheduling problem in flexible manufacturing systems",
    "abstract": "Aiming at solving the production scheduling problems in flexible manufacturing systems including the flexible job shop scheduling (FJSP) and distributed flexible job shop scheduling (DFJSP) with operation outsourcing, which are two kinds of typical NP-hard problems, the general mathematical model with two optimization objectives including minimizing the total costs as well as makespan are developed. Then, an innovative discrete water source cycle algorithm (IDWCA) inspired by the water cycle process is proposed to address the model. In the IDWCA, the operators including evaporation mixing, precipitation, local mixing, modification of water source composition and water source loss are designed to search for optimization solutions. Finally, 15 FJSP comparison experiments and 45 DFJSP comparison experiments with different scales are provided to verify the comprehensive performance of the IDWCA, in which the IDWCA, the original water cycle algorithm (OWCA), and the two general meta-heuristic algorithms genetic algorithm (GA) and particle swarm optimization (PSO) are involved. Compared with OWCA, GA and PSO, IDWCA performs significantly better in all FJSP experiments, while it performs better in 43 out of 45 DFJSP experiments, and its advantages are more significant in solving the medium-scale and large-scale problems. In addition, the evolutionary curves of the above algorithms indicate that the IDWCA has the better convergence speed and results than that of OWCA, GA and PSO. Therefore, the developed mathematical model and IDWCA are effective in solving the studied FJSP and DFJSP, the proposed algorithm enriches the theoretical researches on meta-heuristic algorithms and production scheduling.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Wenxiang Xu",
            "country": ""
        },
        {
            "name": "Shimin Xu",
            "country": ""
        },
        {
            "name": "Junyong Liang",
            "country": ""
        },
        {
            "name": "Tao Qin",
            "country": ""
        },
        {
            "name": "Dezheng Liu",
            "country": ""
        },
        {
            "name": "Lei Wang",
            "country": ""
        }
    ],
    "keywords": []
}