{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001992",
    "title": "A differential evolution algorithm for solving mixed-integer nonlinear programming problems",
    "abstract": "Many engineering optimization problems fall into the category of Mixed-Integer  Nonlinear Programming  (MINLP) problems, which combine nonlinear relations, constraint conditions, and different types of variables, including continuous, integer, and/or discrete variables. Solving MINLP problems can be a challenging exploration process since their landscape can be composed of many discontinuous feasible parts with different sizes. In this scheme, Evolutionary Algorithms (EAs) often fail to generate enough diversity to explore the discontinuous feasible parts. Consequently, EAs are vulnerable to being attracted to larger discontinuous feasible parts, even if they are not promising regions. In this paper, a new proposal based on two fundamental strategies is presented to improve the performance of the differential evolution algorithm when solving MINLP problems. The first strategy considers a set of “good fitness-infeasible solutions” that contribute to exploring promising regions from infeasible contours. It reduces the vulnerability of the solutions to be attracted to larger discontinuous feasible parts with unpromising objective function values. The second is a composite trial vector generation to improve the combinatorial exploration while ensuring a robust convergence capacity toward the final solution. Sixteen well-known MINLP problems are used in several experiments to evaluate the performance of the proposed algorithm, comparing it to state-of-the-art EAs. The results provided by the proposal show a better performance in terms of quality, robustness, and computational cost.",
    "citation_count": "8",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Daniel Molina-Pérez",
            "country": ""
        },
        {
            "name": "Efrén Mezura-Montes",
            "country": ""
        },
        {
            "name": "Edgar Alfredo Portilla-Flores",
            "country": ""
        },
        {
            "name": "Eduardo Vega-Alvarado",
            "country": ""
        },
        {
            "name": "Bárbara Calva-Yañez",
            "country": ""
        }
    ],
    "keywords": []
}