{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002670",
    "title": "A dimensionality reduction assisted evolutionary algorithm for high-dimensional expensive multi/many-objective optimization",
    "abstract": "Surrogate-assisted multi/many-objective evolutionary algorithms (SA-MOEAs) have shown significant progress in tackling expensive optimization problems. However, existing research primarily focuses on low-dimensional optimization problems. The main reason lies in the fact that some surrogate techniques used in SA-MOEAs, such as the Kriging model, are not applicable for exploring high-dimensional decision space. This paper introduces a surrogate-assisted multi-objective evolutionary algorithm with dimensionality reduction to address high-dimensional expensive optimization problems. The proposed algorithm includes two key insights. Firstly, we propose a dimensionality reduction framework containing three different feature extraction algorithms and a feature drift strategy to map the high-dimensional decision space into a low-dimensional decision space; this strategy helps to improve the robustness of surrogates. Secondly, we propose a sub-region search strategy to define a series of promising sub-regions in the high-dimensional decision space; this strategy helps to improve the exploration ability of the proposed SA-MOEA. Experimental results demonstrate the effectiveness of our proposed algorithm in comparison to several state-of-the-art algorithms.",
    "citation_count": "2",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Zeyuan Yan",
            "country": ""
        },
        {
            "name": "Yuren Zhou",
            "country": ""
        },
        {
            "name": "Wei Zheng",
            "country": ""
        },
        {
            "name": "Chupeng Su",
            "country": ""
        },
        {
            "name": "Weigang Wu",
            "country": ""
        }
    ],
    "keywords": []
}