{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021730500X",
    "title": "A dynamic multiobjective evolutionary algorithm based on a dynamic evolutionary environment model",
    "abstract": "Traditional dynamic  multiobjective evolutionary algorithms  usually imitate the evolution of nature, maintaining diversity of population through different strategies and making the population track the  Pareto optimal solution  set efficiently after the environmental change. However, these algorithms neglect the role of the dynamic environment in evolution, leading to the lacking of active guieded search. In this paper, a dynamic multiobjective evolutionary algorithm based on a dynamic evolutionary environment model is proposed (DEE-DMOEA). When the environment has not changed, this algorithm makes use of the evolutionary environment to record the knowledge and information generated in evolution, and in turn, the knowledge and information guide the search. When a change is detected, the algorithm helps the population adapt to the new environment through building a dynamic evolutionary environment model, which enhances the diversity of the population by the guided method, and makes the environment and population evolve simultaneously. In addition, an implementation of the algorithm about the dynamic evolutionary environment model is introduced in this paper. The environment area and the unit area are employed to express the evolutionary environment. Furthermore, the strategies of constraint, facilitation and guidance for the evolution are proposed. Compared with three other state-of-the-art strategies on a series of test problems with linear or nonlinear correlation between design variables, the algorithm has shown its effectiveness for dealing with the dynamic  multiobjective problems .",
    "citation_count": "52",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Juan Zou",
            "country": ""
        },
        {
            "name": "Qingya Li",
            "country": ""
        },
        {
            "name": "Shengxiang Yang",
            "country": ""
        },
        {
            "name": "Jinhua Zheng",
            "country": ""
        },
        {
            "name": "Zhou Peng",
            "country": ""
        },
        {
            "name": "Tingrui Pei",
            "country": ""
        }
    ],
    "keywords": []
}