{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216301328",
    "title": "A fast hypervolume driven selection mechanism for many-objective optimisation problems",
    "abstract": "Solutions to real-world problems often require the simultaneous optimisation of multiple conflicting objectives. In the presence of four or more objectives, the problem is referred to as a “many-objective optimisation problem”. A problem of this category introduces many challenges, one of which is the effective and efficient selection of optimal solutions. The hypervolume indicator (or  s -metric), i.e. the size of dominated objective space, is an effective selection criterion for many-objective optimisation. The indicator is used to measure the quality of a non-dominated set, and can be used to sort solutions for selection as part of the contributing hypervolume indicator. However, hypervolume based selection methods can have a very high, if not infeasible, computational cost. The present study proposes a novel hypervolume driven selection mechanism for many-objective problems, whilst maintaining a feasible computational cost. This approach, named the Hypervolume Adaptive Grid Algorithm (HAGA), uses two-phases (narrow and broad) to prevent population-wide calculation of the contributing hypervolume indicator. Instead, HAGA only calculates the contributing hypervolume indicator for grid populations, i.e. for a few solutions, which are close in proximity (in the objective space) to a candidate solution when in competition for survival. The result is a trade-off between complete accuracy in selecting the fittest individuals in regards to hypervolume quality, and a feasible computational time in many-objective space. The real-world efficiency of the proposed selection mechanism is demonstrated within the optimisation of a classifier for concealed weapon detection.",
    "citation_count": "99",
    "year": "2017/06/01",
    "authors": [
        {
            "name": "Shahin Rostami",
            "country": ""
        },
        {
            "name": "Ferrante Neri",
            "country": ""
        }
    ],
    "keywords": []
}