{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650212000636",
    "title": "A hybrid optimization approach for PI controller tuning based on gain and phase margin specifications",
    "abstract": "Controllers designed for industrial processes should possess high robust performance to counter variations in system parameters. Gain margin and phase margin are two frequency domain specifications that assess the degree of robustness of a system. In this paper, a two-stage hybrid optimization algorithm has been developed for the tuning of proportional integral (PI) controller based on the above frequency domain specifications. Till date an accurate analytical tuning method for achieving specified gain margin and phase margin for a general class of systems is unavailable because of complex nonlinearities involved in the gain and phase margin equations. The proposed algorithm involves the combination of a stochastic population based optimization technique and a pattern search based (Hooke–Jeeves) method. The parameter tuning process has been framed as an optimization problem by employing an objective function based on equations corresponding to gain and phase margin specification. In the proposed algorithm, a global search is first carried out over the  search space  to determine an initial set of desired  controller parameters  using  Particle Swarm Optimization  (PSO). The search is then refined in the second stage using Hooke Jeeves method (initialized using the PSO solution). The proposed method is free of any numerical approximation which consequently improves the accuracy of final solution. For a given transfer function, computer simulations reveal that the hybrid approach meets the desired specifications with greater accuracy of final solution as compared to the existing techniques and other  evolutionary algorithms .",
    "citation_count": "17",
    "year": "2013/02/01",
    "authors": [
        {
            "name": "Prateek Puri",
            "country": ""
        },
        {
            "name": "Subhojit Ghosh",
            "country": ""
        }
    ],
    "keywords": []
}