{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001840",
    "title": "A many-objective optimization evolutionary algorithm based on hyper-dominance degree",
    "abstract": "Compared with multi-objective optimization, solving many-objective optimization problems usually require more strong selection pressure. However, too strong selection pressure usually leads to the loss of diversity, while insufficient selection pressure often results in the failure of convergence. How to control the selection pressure to balance convergence and diversity remains a challenge in many-objective optimization. To tackle this challenge, a many-objective optimization  evolutionary algorithm  based on the hyper-dominance degree is proposed in this paper. In the proposed algorithm, the convergence of each solution is quantified by hyper-dominance degree so that the convergence of the population can be controlled by setting a tolerance to screen solutions. To better balance the convergence and the diversity, a tolerance adjusting strategy is designed to control selection pressure during optimization, an improved reference vectors-based diversity preservation strategy is proposed to make the solutions well-distributed in the objective space, and a population  reselection  strategy based on hyper-dominance degree is proposed to further improve the convergence. The experimental results on various benchmark problems with up to 20 objectives verify that the proposed algorithm outperforms the state-of-the-art peer many-objective optimization algorithms.",
    "citation_count": "31",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Zhe Liu",
            "country": ""
        },
        {
            "name": "Fei Han",
            "country": ""
        },
        {
            "name": "Qinghua Ling",
            "country": ""
        },
        {
            "name": "Henry Han",
            "country": ""
        },
        {
            "name": "Jing Jiang",
            "country": ""
        }
    ],
    "keywords": []
}