{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218306114",
    "title": "A metaheuristic approach to solve Dynamic Vehicle Routing Problem in continuous search space",
    "abstract": "This paper investigates a hypothesis that in case of hard  optimization problems , selection of the proper  search space  is more relevant than the choice of the solving algorithm. Dynamic  Vehicle Routing Problem  is used as a test problem and the hypothesis is verified experimentally on the well-known set of benchmark instances. The paper compares  Particle Swarm Optimization  (PSO) and Differential Evolution (DE) operating in two continuous search spaces (giving in total four distinctive approaches) and a state-of-the art discrete encoding utilizing  Genetic Algorithm  (GA). The advantage of selected continuous search space over a discrete one is verified on the basis of quality of the final solution and stability of intermediate partial solutions. During stability analysis it has been observed that practical level of uncertainty, resulting from the dynamic nature of the problem, is lower than could be expected from a popular  degree of dynamism  measure. In order to challenge that issue, benchmark problems have been solved also with a higher level of dynamism and an  empirical degree of dynamism  has been proposed as an additional measure of the amount of uncertainty of the problem. The results obtained by both continuous algorithms outperform those of state-of-the-art algorithms utilizing discrete problem representation, while the performance differences between them (PSO and DE) are minute. Apart from higher numerical efficiency in solving DVRP, the use of continuous problem encoding proved its advantage over discrete encoding also in terms of intermediate solutions stability. Requests-to-vehicles assignment sequences generated by the proposed approach were approximately 40% more accurate with respect to the final solution than their counterparts generated with a discrete encoding. Analysis of these sequences of intermediate solutions for several benchmark sets resulted in designing a penalty term taking into account a specific dynamic nature of the optimized problem. An addition of this penalty term improved the above-mentioned stability of partial solutions by another 10%.",
    "citation_count": "53",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Michał Okulewicz",
            "country": ""
        },
        {
            "name": "Jacek Mańdziuk",
            "country": ""
        }
    ],
    "keywords": []
}