{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001736",
    "title": "A multi-objective memetic algorithm with adaptive local search for airspace complexity mitigation",
    "abstract": "Airspace  complexity is a paramount safety metric to measure the difficulty and effort required to safely manage air traffic. The continuing growth in air traffic demand results in increasing airspace complexity and unprecedented safety concerns. Most existing methods treat the minimization of airspace complexity as the sole objective, ignoring the path deviation cost induced by the re-scheduled aircraft. In this paper, regarding reduction of airspace complexity and path deviation cost as two conflicting objectives, a multi-objective airspace complexity mitigation model is proposed to simultaneously ensure the safety and efficiency of air transport by optimizing  flight trajectories . To effectively solve this multi-objective and non-linear  optimization problem , a novel  Memetic Algorithm  with Adaptive Local Search (called MA-ALS) is developed. Specifically, we design a new crossover and three new local search operators under the flight trajectory representation. MA-ALS conducts exploration by crossover, and exploitation by a hill-climbing local search process. Moreover, we proposed an adaptive local search selection mechanism which facilitates the dynamic collaboration of different local search operators during evolution. A comprehensive comparison with the most recently developed algorithms on Chinese air traffic dataset is conducted. The  Pareto front  generated by the proposed algorithm dominates that of the compared baselines. Moreover, compared with a real flight schedule, the flight plan obtained by the proposed algorithm can significantly reduce the airspace complexity.",
    "citation_count": "8",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Biyue Li",
            "country": ""
        },
        {
            "name": "Tong Guo",
            "country": ""
        },
        {
            "name": "Yi Mei",
            "country": ""
        },
        {
            "name": "Yumeng Li",
            "country": ""
        },
        {
            "name": "Jun Chen",
            "country": ""
        },
        {
            "name": "Yu Zhang",
            "country": ""
        },
        {
            "name": "Ke Tang",
            "country": ""
        },
        {
            "name": "Wenbo Du",
            "country": ""
        }
    ],
    "keywords": []
}