{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000925",
    "title": "A multimodal multi-objective evolutionary algorithm with two-stage dual-indicator selection strategy",
    "abstract": "Multimodal multi-objective problems (MMOPs) arise frequently in the real world, in which multiple Pareto optimal solution sets correspond to the same point on the Pareto front. To find more equivalent Pareto sets, numerous multimodal multi-objective  evolutionary algorithms  (MMEAs) based on niching have been developed. However, traditional niching methods have parameter sensitivity issues. Moreover, most existing MMEAs always perform diversity maintenance operations in the decision space and the objective space sequentially based on preferences, without considering a diversity maintenance operation that takes into account both the decision space and the objective space simultaneously. To tackle these challenges, a multimodal multi-objective evolutionary algorithm with two-stage double indicator selection strategy (MMEA-TDI) is developed. First, a dual-indicator with adaptive niche radius is developed to estimate the crowding status of the population. Then, a diversity-based mating selection is suggested to select well-distributed parents for mating. Furthermore, the environmental selection is performed in two stages. In the first stage, a parameter-free automatic niching technique based on clustering is adopted to well balance diversity and convergence in the decision space, while a double indicator selection strategy is performed for maintaining diversity in both decision and objective spaces in the second stage. To assess the performance of the proposed algorithm, extensive experiments are conducted on the well-known benchmark functions, in comparison with eight state-of-the-art MMEAs. Experimental results demonstrate that the proposed algorithm is significantly superior to the competing algorithms.",
    "citation_count": "2",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Zhiming Lv",
            "country": ""
        },
        {
            "name": "Shuqin Li",
            "country": ""
        },
        {
            "name": "Hongguang Sun",
            "country": ""
        },
        {
            "name": "Hongming Zhang",
            "country": ""
        }
    ],
    "keywords": []
}