{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222000918",
    "title": "A multi-body dynamical evolution model for generating the point set with best uniformity",
    "abstract": "Generating the low-discrepancy point sets in high-dimensional space is an optimization problem which involves two issues: how to define the objective function of optimization, and how to optimize this optimization problem with tens of thousands of variables. Inspired by natural phenomena, we make two assumptions: the first is that the static solution to the multi-body problem is a low-discrepancy point set, and the second is that the discrepancy of bodies is the lowest when the potential energy is the smallest. Under these assumptions, the objective function is defined as the potential energy of the point set. A dynamical evolutionary model (DEM) based on the  minimum potential energy  principle is established to construct low-discrepancy point sets. The central difference algorithm is adopted to solve the DEM and the selection of coefficients to ensure the convergence is discussed in detail. Numerical examples confirm the assumption that there is a significant positive correlation between the potential energy and the discrepancy. We also combine the DEM with the restarting technique to generate a series of low-discrepancy point sets. These point sets are unbiased and perform better than other low-discrepancy point sets in terms of the discrepancy, the potential energy, integrating eight test functions and computing the statistical moments for two practical stochastic problems. Numerical examples also show that the DEM can generate uniformly distributed point sets in non-cubes. More interestingly, it is observed that the DEM point sets can greatly improve the convergence speed of the heterogeneous comprehensive learning  particle swarm optimization .",
    "citation_count": "11",
    "year": "2022/08/01",
    "authors": [
        {
            "name": "Feng Wu",
            "country": ""
        },
        {
            "name": "Yuelin Zhao",
            "country": ""
        },
        {
            "name": "Ke Zhao",
            "country": ""
        },
        {
            "name": "Wanxie Zhong",
            "country": ""
        }
    ],
    "keywords": []
}