{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001803",
    "title": "A new particle swarm optimization aided evolutionary digital filter for noise cancellation in early fault diagnosis of rotating machinery",
    "abstract": "Noise cancellation  plays a crucial role in enhancing the signal-to-noise ratio (SNR) of fault characteristics, making it an essential step in fault diagnosis, particularly during the early stages of a fault. Among various adaptive noise cancellation (ANC) methods, evolutionary digital filter (EDF) stands out as an effective approach. EDF employs an adaptive algorithm based on biological evolutionary computation to control its operations. The quality of noise cancellation performance directly relies on the global optimization ability of EDF. However, conventional EDF and its improved versions mainly rely on random search strategies involving cloning and mating, which lack an explicit search direction akin to gradient-based methods. Consequently, substantial computational resources are wasted. To address this problem, an improved algorithm called particle swarm optimization-based evolutionary digital filter (PSO-EDF) is newly proposed. The central concept of this method is to integrate the PSO algorithm into the global optimization process of EDF. By introducing PSO, explicit search directions are provided to individuals adopting the cloning strategy, thus promoting cooperation and information sharing among individuals. The PSO-aided EDF significantly enhances the global optimization capability of ANC filter parameters. Through the proposed PSO-EDF method, the ability to achieve global optimization of ANC filter parameters is substantially improved. This approach mitigates the resource wastage associated with traditional EDF techniques, offering a more efficient and effective solution for noise cancellation in fault diagnosis.",
    "citation_count": "4",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Bing Wang",
            "country": ""
        },
        {
            "name": "Liming Wang",
            "country": ""
        },
        {
            "name": "Bo Zou",
            "country": ""
        },
        {
            "name": "Huifang Xiao",
            "country": ""
        },
        {
            "name": "Xiaoxi Ding",
            "country": ""
        },
        {
            "name": "Yimin Shao",
            "country": ""
        }
    ],
    "keywords": []
}