{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021630267X",
    "title": "A new multi-objective evolutionary framework for community mining in dynamic social networks",
    "abstract": "Evolutionary clustering – clustering in the presence of dynamic shifts of data's topological structure – has recently drawn remarkable attention wherein several algorithms are developed in the study of complex real networks. Despite the growing interests, all of the algorithms are designed based on seemingly the same principle. The primary principle in these evolutionary clustering frameworks is guided by decomposing the problem into two  individual  criteria,  snapshot quality  and  temporal smoothness . Snapshot quality should properly cluster individuals of a network into interconnected communities. Temporal smoothness, on the other hand, should capture well the dynamic shift of the interconnected clusters from one time step to another. Thus, in the absence of any dynamic behavior, an evolutionary clustering model should be no more than a community detection one in a static network. Unfortunately, all of the developed algorithms are proposed based on discretion of the snapshot quality as a unified of both  intra-  and  inter- connected  community detection model while temporal cost as a community  evolution  detection model. The contribution of this paper starts by noting the limitation of the existing state-of-the-art algorithms. Despite their performance on dynamic complex networks, their formulations lack complete reflection of sufficient community detection model. Our framework, then, models the evolutionary clustering problem by hypothesizing that it should not depart too much from the community detection problem. To support this claim, an alternate decomposition perspective is proposed by projecting the problem, as a multi-objective optimization problem, in the light of  snapshot  and  temporal  of both intra- and inter-community scores. Two snapshot qualities are proposed to individually emphasize the role of intra- and inter- community scores, while temporal cost is proposed to cross-fertilize inter- community score. By applying one of the prominent multi-objective evolutionary algorithms (MOEAs) to solve the proposed multi-objective evolutionary clustering framework and testing it on several synthetic and real-world dynamic networks, we demonstrate the ability of the proposed model to address the problem more accurately than the existing state-of-the-art formulations.",
    "citation_count": "23",
    "year": "2016/12/01",
    "authors": [
        {
            "name": "Bara'a A. Attea",
            "country": ""
        },
        {
            "name": "Haidar S. Khoder",
            "country": ""
        }
    ],
    "keywords": []
}