{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022300158X",
    "title": "A particle swarm algorithm based on the dual search strategy for dynamic multi-objective optimization",
    "abstract": "Dynamic multi-objective  optimization problems  (DMOPs) have multiple objectives that need to be optimized simultaneously, while the objectives and/or constraints may change with time. Therefore, they require the solving algorithm to be able to properly converge to the  Pareto optimal front  and maintain the diversity of the population, and respond to environmental changes. Aiming at these points, a  particle swarm optimization algorithm  based on a double search strategy is proposed for dynamic multi-objective optimization in this paper. Two search strategies are designed to update the speed of each particle, which is helpful to accelerate the convergence speed and maintain the diversity of the population in a dynamic environment. In order to cope with environmental changes, an effective dynamic response mechanism is proposed, which is composed of an archive set prediction and piecewise search strategy to accelerate the convergence to the  Pareto optimal set  and maintain good distribution in the new environment. To verify the effectiveness of the proposed algorithm, it is tested on a series of benchmark problems and compared with several popular algorithms. The experimental results show the advantages of the proposed algorithm in dealing with DMOPs.",
    "citation_count": "20",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Jintong Yang",
            "country": ""
        },
        {
            "name": "Juan Zou",
            "country": ""
        },
        {
            "name": "Shengxiang Yang",
            "country": ""
        },
        {
            "name": "Yaru Hu",
            "country": ""
        },
        {
            "name": "Jinhua Zheng",
            "country": ""
        },
        {
            "name": "Yuan Liu",
            "country": ""
        }
    ],
    "keywords": []
}