{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217306004",
    "title": "A parameter-free discrete particle swarm algorithm and its application to multi-objective pavement maintenance schemes",
    "abstract": "Regular maintenance is paramount for a healthy  road network , the arteries of any economy. As the resources for maintenance are limited, optimization is necessary. A number of conflicting objectives exist with many influencing variables. Although many methods have been proposed, the related research is very active, due to difficulties in adoption to the actual practice owing to reasons such high-dimensional problems even for small road networks. Literature survey tells that  particle swarms  have not been exploited much, mainly due to unavailability of many techniques in this domain for multi-objective discrete problems like this. In this work, a novel  particle swarm algorithm  is proposed for a general, discrete, multi-objective problem. In contrast to the standard particle swarm, the bare-bones technique has a clear advantage in that it is a parameter-free technique, hence the end users need not be optimization experts. However, the existing barebones algorithm is available only for continuous domains, sans any  particle velocity  terms. For discrete domains, the proposed method introduces a parameter-free velocity term to the standard bare-bones algorithm. Based on the  peak velocities  observed by the different dimensions of a particle, its new position is calculated. A number of benchmark test functions are also solved. The results show that the proposed algorithm is highly competitive and able to obtain much better spread of solutions compared to three other existing  PSO  and  genetic algorithms . The method is benchmarked against a number of other algorithms on an actual pavement maintenance problem. When compared against another particle swarm algorithm, it not only shows better performance, but also significant reduction in run-time compared to other POS algorithm. Hence, for large road network maintenance, the proposed method shows a lot of promise in terms of analysis time, while improving on the quality of solutions.",
    "citation_count": "23",
    "year": "2018/12/01",
    "authors": [
        {
            "name": "Maher Mahmood",
            "country": ""
        },
        {
            "name": "Senthan Mathavan",
            "country": ""
        },
        {
            "name": "Mujib Rahman",
            "country": ""
        }
    ],
    "keywords": []
}