{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001408",
    "title": "A reinforcement learning-driven adaptive decomposition algorithm for multi-objective hybrid seru system scheduling considering worker transfer",
    "abstract": "The application of hybrid seru manufacturing in real-world production often necessitates the implementation of a worker transfer strategy to overcome limitations in skill levels and realize the co-optimization of production efficiency and worker workload. Therefore, this study focuses on hybrid seru system scheduling considering worker transfer (HSSWT) to minimize both the makespan and the total labor time. The presence of multiple optimization objectives and coupled  subproblems  results in a considerably large  search space , which poses challenges that existing optimization frameworks cannot effectively address. Thus, we propose a reinforcement learning-driven adaptive decomposition algorithm (RLADA) to address this issue. First, to minimize the search space, the HSSWT is decomposed into two subproblems, each utilizing distinct search strategies to explore specific areas. Elite-driven population evolution and a lower bound-guided greedy search are proposed to solve the individual subproblems. Second, a deep Q-network has been developed to adaptively select the subproblem to optimize in each generation by dynamically dividing the objective space. Finally, to narrow the search space, the lower bound is used to filter out unpromising solutions, thereby avoiding invalid searches. Additionally, the lower bound is utilized to determine the search depth according to the optimization margin, helping to conserve computing resources. Extensive comparative results demonstrate the effectiveness of the specialized designs, and the RLADA outperforms state-of-the-art algorithms in terms of  solution convergence  and diversity when addressing the HSSWT.",
    "citation_count": "4",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Yuting Wu",
            "country": ""
        },
        {
            "name": "Ling Wang",
            "country": ""
        },
        {
            "name": "Rui Li",
            "country": ""
        },
        {
            "name": "Jing-fang Chen",
            "country": ""
        }
    ],
    "keywords": []
}