{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219305504",
    "title": "A rotationally invariant semi-autonomous particle swarm optimizer with directional diversity",
    "abstract": "The semi-autonomous particle swarm optimizer (SAPSO) [ 1 ] is a relatively recent algorithm for global continuous optimization based on gradient direction and diversity controlling approach, providing autonomy for the particles and the swarm for exploiting regions in the search space, and preserving exploration during the whole search process. In the first study, although SAPSO algorithm holds the property  rotational invariance  in which it normally brings a lack of directional diversity in  PSO  context, the algorithm has shown very good performance in comparison to other PSO-like algorithms. In this paper, an improved version of SAPSO, named rotationally invariant SAPSO (RI-SAPSO), is proposed, which still holds the same property, but now it incorporates a rotation matrix generated by an exponential map to maintain directional diversity. A mathematical proof to prove that the RI-SAPSO algorithm is rotationally invariant is given. RI-SAPSO was evaluated on test functions extracted from CEC 2017 benchmark problems with six other PSO-like algorithms, along with its previous version. The comparative study was strengthened with a non-parametric Friedman's hypothesis test for 1 ×  k  comparisons and p-values were adjusted in the post-hoc procedure. Simulation results showed that the proposed RI-SAPSO, in most problems, was able to find much better solutions and statistical significances were also observed.",
    "citation_count": "14",
    "year": "2020/08/01",
    "authors": [
        {
            "name": "Reginaldo Santos",
            "country": ""
        },
        {
            "name": "Gilvan Borges",
            "country": ""
        },
        {
            "name": "Adam Santos",
            "country": ""
        },
        {
            "name": "Moisés Silva",
            "country": ""
        },
        {
            "name": "Claudomiro Sales",
            "country": ""
        },
        {
            "name": "João C.W. A. Costa",
            "country": ""
        }
    ],
    "keywords": []
}