{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002341",
    "title": "A survey of meta-heuristic algorithms in optimization of space scale expansion",
    "abstract": "Optimization problem of space scale expansion widely exists in practical applications, such as transportation, logistics, scheduling, social networks, etc. According to different expansion directions, the problem of space scale expansion can be divided into three categories: expansion of decision space, expansion of objective space and simultaneous expansion of decision space and objective space. These three types of problems correspond to large-scale global optimization problem, multi/many-objective optimization problem, and large-scale multi/many-objective optimization problem, respectively. Driven by the above problems, meta-heuristic algorithms (MHAs) with scalable characteristics have received extensive attention in this field. This paper summarizes the research progress of MHAs for space scale expansion optimization from three perspectives. Starting from the key difficulties of the optimization problem, the challenges brought by the expansion of the space scale to the existing MHAs are emphatically analyzed. From the perspective of methodology, the optimization methods of MHAs are divided into three modules: simplify problem structure, improve algorithm performance and expand application fields. Based on the review of performance evaluation benchmark problems, the simulation degree of various test suites for different practical application problems is summarized. In addition, some remaining challenges and future research directions on optimization of space scale expansion are discussed and analyzed.",
    "citation_count": "12",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Jinlu Zhang",
            "country": ""
        },
        {
            "name": "Lixin Wei",
            "country": ""
        },
        {
            "name": "Zeyin Guo",
            "country": ""
        },
        {
            "name": "Hao Sun",
            "country": ""
        },
        {
            "name": "Ziyu Hu",
            "country": ""
        }
    ],
    "keywords": []
}