{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002274",
    "title": "A two-stage cross-neighborhood search algorithm bridging different solution representation spaces for solving the hybrid flow shop scheduling problem",
    "abstract": "In this paper, we address the classical hybrid  flow shop scheduling  problem(HFSP) to minimize makespan. This problem is known to be NP-hard and widely exists in many industrial systems such as electronics, paper, textile, and  manufacturing industries . The existing work has shown that searching in multiple solution representation spaces is beneficial to improving the performance of the algorithm. However, the connection of the solutions in different solution representation spaces was ignored. To address this issue, this paper proposes a two-stage cross-neighborhood search algorithm (TSCNSA) for solving the hybrid flow shop scheduling problem. TSCNSA contains two individuals, each of which is responsible for searching in a solution representation space. The algorithm is divided into two stages: exploration and exploitation. In the exploration stage, the two individuals search in the solution representation space generated by the job-based encoding method and two decoding methods respectively to locate the potential area. In the exploitation stage, the two individuals search in the solution representation space generated by the operation-based encoding and two decoding methods respectively. The information obtained in the exploration stage will be transferred in the exploitation stage. Besides, each individual searches in its neighborhood and then generates an expert solution in the other solution representation space to guide the search for the other individual. Finally, the performance of the TSCNSA is proved by testing the well-known 586 benchmark instances. 151 new upper bounds are obtained, including 144 instances in Jose's benchmark instances, 2 instances in Liao's benchmark instances, and 5 instances in Carlier's benchmark instances.",
    "citation_count": "6",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Yuan Kuang",
            "country": ""
        },
        {
            "name": "Xiuli Wu",
            "country": ""
        },
        {
            "name": "Ziqi Chen",
            "country": ""
        },
        {
            "name": "Wence Li",
            "country": ""
        }
    ],
    "keywords": []
}