{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001482",
    "title": "Accelerating surrogate assisted evolutionary algorithms for expensive multi-objective optimization via explainable machine learning",
    "abstract": "A series of surrogate-assisted evolutionary algorithms (SAEAs) have been proposed to handle expensive multi-objective optimization problems (EMOPs). However, the surrogate of these SAEAs is underutilized to a large extent, which limits the search efficiency of these algorithms. To be specific, existing algorithms do not sufficiently exploit the estimated solution quality information from the  surrogate models  during  offspring  generation. To address this issue, this paper proposes an SAEA framework named EXO-SAEA (EXplanation Operator based Surrogate-Assisted Evolutionary Algorithm). First, it divides the current population into two populations according to the a  priori knowledge  from the surrogate model. Then, for each solution in the first population, EXO-SAEA employs the SHapley Additive exPlanations (SHAP) model to estimate the contribution of each decision variable to the fitness values. After that, the Shapley values are then normalized for the offspring generation of the first population, while the second population uses generic GA operators. Two representative surrogate-assisted evolutionary algorithms are used to instantiate the proposed framework. Experimental results on the synthetic benchmark problems and three real-world problems involving six state-of-the-art algorithms demonstrate the effectiveness of the proposed framework.",
    "citation_count": "3",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Bingdong Li",
            "country": ""
        },
        {
            "name": "Yanting Yang",
            "country": ""
        },
        {
            "name": "Dacheng Liu",
            "country": ""
        },
        {
            "name": "Yan Zhang",
            "country": ""
        },
        {
            "name": "Aimin Zhou",
            "country": ""
        },
        {
            "name": "Xin Yao",
            "country": ""
        }
    ],
    "keywords": []
}