{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650212000442",
    "title": "Adaptive variable neighborhood search for solving multi-objective facility layout problems with unequal area facilities",
    "abstract": "In this paper, we report the results of our investigation of an evolutionary approach for solving the unequal area multi-objective  facility layout  problem (FLP) using the  variable neighborhood search  (VNS) with an adaptive scheme that presents the final layouts as a set of Pareto-optimal solutions. The unequal area FLP comprises a class of extremely difficult and widely applicable  optimization problems  arising in diverse areas and meeting the requirements for real-world applications. The VNS is an explorative  local search method  whose basic idea is systematic change of neighborhood within a local search. Traditionally, local search is applied to the solutions of each generation of an  evolutionary algorithm , and has often been criticized for wasting  computation time . To address these issues, the proposed approach is composed of the VNS with a modified  1 - opt  local search, an extended adaptive local search scheme for optimizing multiple objectives, and the multi-objective genetic algorithm (GA). Unlike conventional local search, the proposed adaptive local search scheme automatically determines whether the VNS is used in a  GA  loop or not. We investigate the performance of the proposed approach in comparison to multi-objective GA-based approaches without local search and augmented with traditional local search. The computational results indicate that the proposed approach with adaptive VNS is more efficient in most of the  performance measures  and can find near-optimal layouts by optimizing multiple criteria simultaneously.",
    "citation_count": "80",
    "year": "2013/02/01",
    "authors": [
        {
            "name": "Kazi Shah Nawaz Ripon",
            "country": ""
        },
        {
            "name": "Kyrre Glette",
            "country": ""
        },
        {
            "name": "Kashif Nizam Khan",
            "country": ""
        },
        {
            "name": "Mats Hovin",
            "country": ""
        },
        {
            "name": "Jim Torresen",
            "country": ""
        }
    ],
    "keywords": []
}