{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218300208",
    "title": "Alignment-based genetic programming for real life applications",
    "abstract": "A recent discovery has attracted the attention of many researchers in the field of  genetic programming : given individuals with particular characteristics of alignment in the error space, called optimally aligned, it is possible to reconstruct a  globally optimal solution . Furthermore, recent preliminary experiments have shown that an indirect search consisting of looking for optimally aligned individuals can have benefits in terms of  generalization ability  compared to a direct search for optimal solutions. For this reason, defining genetic programming systems that look for optimally aligned individuals is becoming an ambitious and important objective. Nevertheless, the systems that have been introduced so far present important limitations that make them unusable in practice, particularly for complex real-life applications. In this paper, we overcome those limitations, and we present the first usable alignment-based genetic programming system, called nested alignment genetic programming (NAGP). The presented experimental results show that NAGP is able to outperform two of the most recognized state-of-the-art genetic programming systems on four complex real-life applications. The  predictive models  generated by NAGP are not only more effective than the ones produced by the other studied methods but also significantly smaller and thus more manageable and interpretable.",
    "citation_count": "13",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Leonardo Vanneschi",
            "country": ""
        },
        {
            "name": "Mauro Castelli",
            "country": ""
        },
        {
            "name": "Kristen Scott",
            "country": ""
        },
        {
            "name": "Leonardo Trujillo",
            "country": ""
        }
    ],
    "keywords": []
}