{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219301130",
    "title": "An adaptive multi-objective algorithm based on decomposition and large neighborhood search for a green machine scheduling problem",
    "abstract": "Green machine scheduling consists in the allocation of jobs in order to maximize production, in view of the sustainable use of energy. This work addresses the unrelated  parallel machine scheduling  problem with setup times, with the minimization of the makespan and the  total energy consumption . The latter takes into account the  power consumption  of each machine in different operation modes. We propose multi-objective extensions of the  Adaptive Large Neighborhood Search  (ALNS)  metaheuristic  with Learning  Automata  (LA) to improve the search process and to solve the large scale instances efficiently. ALNS combines ad-hoc destroy and repair (also named removal and insertion) operators and a  local search  procedure. The LA is used to adapt the selection of insertion and removal operators within the framework of ALNS. Two new algorithms are developed: the MO-ALNS and the MO-ALNS/D. The first algorithm is a direct extension of single objective ALNS by using multi-objective local search. As this method does not offer much control of the diversification of the  Pareto front   approximation , a second strategy employs the decomposition approach similar to MOEA/D algorithm. The results show that the MO-ALNS/D algorithm has better performance than MO-ALNS and MOEA/D in all indicators. These findings show that the decomposition strategy is beneficial not only for  evolutionary algorithms , but it is indeed an efficient way to extend ALNS to multi-objective problems.",
    "citation_count": "47",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Luciano P. Cota",
            "country": ""
        },
        {
            "name": "Frederico G. Guimarães",
            "country": ""
        },
        {
            "name": "Roberto G. Ribeiro",
            "country": ""
        },
        {
            "name": "Ivan R. Meneghini",
            "country": ""
        },
        {
            "name": "Fernando B. de Oliveira",
            "country": ""
        },
        {
            "name": "Marcone J.F. Souza",
            "country": ""
        },
        {
            "name": "Patrick Siarry",
            "country": ""
        }
    ],
    "keywords": []
}