{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001298",
    "title": "An archive-based two-stage evolutionary algorithm for constrained multi-objective optimization problems",
    "abstract": "An important factor in constrained multi-objective  evolutionary algorithms  (CMOEAs) is how to make optimal use of the information of feasible and infeasible solutions. To fully utilize these promising solutions, this paper proposes an archive-based two-stage  evolutionary algorithm , called AT-CMOEA, for solving constrained multi-objective  optimization problems  (CMOPs). AT-CMOEA divides the evolutionary process into two stages — exploration and exploitation. The purpose of the exploration stage is to encourage a broader exploration of the  search space  to discover some promising regions, which is achieved by two populations with different priorities of constraints and objectives. In the  exploitation stage , the goal is to obtain a set of well-distributed Pareto-optimal solutions by utilizing the useful archived information found during the exploration stage, allowing the search resources to be focused on the region of interest. Then, the two populations cooperatively converge to the constrained  Pareto front  (CPF). Comprehensive experiments on a series of benchmark test problems and three real-world CMOPs demonstrate the competitiveness of our method when compared with other representative algorithms in terms of effectiveness and reliability in finding a set of well-distributed optimal solutions.",
    "citation_count": "23",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Qian Bao",
            "country": ""
        },
        {
            "name": "Maocai Wang",
            "country": ""
        },
        {
            "name": "Guangming Dai",
            "country": ""
        },
        {
            "name": "Xiaoyu Chen",
            "country": ""
        },
        {
            "name": "Zhiming Song",
            "country": ""
        },
        {
            "name": "Shuijia Li",
            "country": ""
        }
    ],
    "keywords": []
}