{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002025",
    "title": "An Adaptive Multi-Meme Memetic Algorithm for the prize-collecting generalized minimum spanning tree problem",
    "abstract": "In this paper, we address the prize-collecting generalized minimum spanning tree problem (PC-GMSTP) which aims to find a minimum spanning tree to connect a network of clusters using exactly one vertex per cluster, minimizing the total cost of connecting the clusters while considering both the costs of edges and the prizes offered by the vertices. An Adaptive Multi-meme Memetic Algorithm (AMMA) is proposed to tackle PC-GMSTP, which combines an adaptive reproduction procedure and a collaborated local search procedure. The adaptive reproduction procedure uses either crossover or mutation to produce offspring to maintain a good balance between exploration and exploitation of the search space, and the probability to use crossover or mutation is adaptively adjusted based on the diversity of population. The collaborated local search procedure, which includes two efficient local search operators, can effectively enhance the intensification ability of AMMA due to their complementary features. Extensive computational experiments on 126 challenging instances demonstrate the superiority of AMMA, outperforming 23 best-known solutions from existing literature while achieving similar solutions for the remaining 103 instances. Wilcoxon’s signed rank test confirms that the performance of AMMA is significantly better than the state-of-the-art algorithms.",
    "citation_count": "2",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Chenwei Zhu",
            "country": ""
        },
        {
            "name": "Yu Lin",
            "country": ""
        },
        {
            "name": "Fuyuan Zheng",
            "country": ""
        },
        {
            "name": "Juan Lin",
            "country": ""
        },
        {
            "name": "Yiwen Zhong",
            "country": ""
        }
    ],
    "keywords": []
}