{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400141X",
    "title": "An enhanced sparrow search swarm optimizer via multi-strategies for high-dimensional optimization problems",
    "abstract": "With the development of  science and technology , high-dimensional global optimization problems have become increasingly prevalent for scientific research and engineering, such as gene recognition, vehicle routing, job scheduling, and network topology. These problems are typically characterized by enormous and complex search spaces and numerous local minima, making it challenging to find the global optimal solution with limited computing resources. This paper introduces an enhanced sparrow search swarm optimizer (ESSSO) based on a bio-mimetic method. The ESSSO employs an adaptive sinusoidal walk strategy based on the von Mises distribution, a learning strategy utilizing roulette wheel selection, a two-stage evolution strategy, and a selection mutation strategy to address these issues. The proposed sinusoidal walk strategy, grounded in the von Mises distribution, supports a balanced evolutionary search. This mechanism disperses the individuals in a swarm in various directions based on a circular  normal distribution . It then leads the search and adaptively adjusts their step sizes according to the size of the search domain during each generation of evolution. The learning strategy, based on roulette wheel selection, enhances the diversity of the population and improves the global search capability of the algorithm during the initial iterations. The two-stage evolution strategy involves a sine-learning mechanism based on the von Mises distribution and an adaptive mutation mechanism. The former is designed to boost the convergence speed of ESSSO, while the latter prevents ESSSO from getting trapped in a local optimum. Additionally, the selection mutation strategy further enhances convergence speed while maintaining population diversity. These strategies promote exploration in the early stages of evolution and exploitation in the later stages, enabling a well-balanced search for optimal solutions. We conducted comprehensive experiments two standard benchmark sets (i.e., CEC2010 and CEC2013),  antenna array  optimization, feature selection, and four engineering design problems. The results indicate that ESSSO outperforms ten comparison algorithms, especially in scenarios with smaller  population sizes . This confirms its effectiveness in high-dimensional global optimization tasks and demonstrates that it can achieve better results with less computational resource consumption.",
    "citation_count": "3",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Shuang Liang",
            "country": ""
        },
        {
            "name": "Minghao Yin",
            "country": ""
        },
        {
            "name": "Geng Sun",
            "country": ""
        },
        {
            "name": "Jiahui Li",
            "country": ""
        },
        {
            "name": "Hongjuan Li",
            "country": ""
        },
        {
            "name": "Qi Lang",
            "country": ""
        }
    ],
    "keywords": []
}