{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021730665X",
    "title": "An enhanced artificial bee colony algorithm with dual-population framework",
    "abstract": "Artificial bee colony (ABC) suffers from slow convergence. To enhance its convergence speed, this paper proposes a general dual-population framework (short for DPF) for ABC from the perspective of resource allocation. To be specific, DPF divides the population into two sub-populations,  i.e.,  convergence population (CP) and diversity population (DP), based on a division rule. CP contains some current promising food source positions and it is responsible for exploiting the promising areas in the search space, while DP includes historical unpromising food source positions and takes responsibility of maintaining population diversity. To validate the effectiveness of DPF, We embed DPF into ABC, GABC and CABC, yielding DPABC, DPGABC and DPCABC respectively. The experimental results on some benchmark functions and CEC2015 test problems show that DPF can improve the performance of ABC algorithms. Moreover, we compare DPCABC with some state-of-the-art  evolutionary algorithms  (EAs) and differential evolution algorithms on benchmark functions and CEC2013 real-parameter test problems. The experimental results demonstrate that DPCABC is better than these EAs on benchmark functions, but it is worse than some state-of-the-art differential evolution algorithms on CEC2013 test problems. In addition, DPGABC is also very competitive with some state-of-the-art ABC variants on CEC2015 test problems.",
    "citation_count": "51",
    "year": "2018/12/01",
    "authors": [
        {
            "name": "Laizhong Cui",
            "country": ""
        },
        {
            "name": "Genghui Li",
            "country": ""
        },
        {
            "name": "Yanli Luo",
            "country": ""
        },
        {
            "name": "Fei Chen",
            "country": ""
        },
        {
            "name": "Zhong Ming",
            "country": ""
        },
        {
            "name": "Nan Lu",
            "country": ""
        },
        {
            "name": "Jian Lu",
            "country": ""
        }
    ],
    "keywords": []
}