{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400035X",
    "title": "An enhanced Kalman filtering and historical learning mechanism driven estimation of distribution algorithm",
    "abstract": "As a representative evolutionary algorithm based on probabilistic models, the estimation of distribution algorithm (EDA) is widely applied in complex continuous optimization problems based on remarkable characteristics of modeling with macro-dominant information. However, the success of EDA depends on the quality of dominant solutions, modeling, sampling methods, and the efficiency of searching. An enhanced Kalman filtering and historical learning mechanism-driven EDA (KFHLEDA) is proposed to adjust the search direction and enlarge the search range of classical EDA in this paper. The enhanced Kalman filtering is designed in allusion to specific problems during the search through the prediction, observation, and the first and second revision stages. A historical archive is integrated into KFHLEDA to store the elite individuals with specific knowledge and diverse solutions from Kalman filtering. The elite strategy is embedded in the revision improvement matrix to revise modeling data, which is fed back to the probabilistic model through the historical learning mechanism with previous promising solutions to estimate the covariance matrix. The population adaptive adjustment strategy is introduced to reduce the number of invalid iterations. The effectiveness of the proposed KFHLEDA is proved through theoretical analysis. The evaluation results on benchmark functions of the CEC 2017 test suit validate that the KFHLEDA is efficient and competitive compared with fifteen classical metaheuristic algorithms and state-of-the-art EDA variants.",
    "citation_count": "5",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Ningning Zhu",
            "country": ""
        },
        {
            "name": "Fuqing Zhao",
            "country": ""
        },
        {
            "name": "Ling Wang",
            "country": ""
        },
        {
            "name": "Chenxin Dong",
            "country": ""
        }
    ],
    "keywords": []
}