{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000835",
    "title": "An individual adaptive evolution and regional collaboration based evolutionary algorithm for large-scale constrained multiobjective optimization problems",
    "abstract": "Large-scale constrained multiobjective optimization problems (LSCMOPs) refer to constrained multiobjective optimization problems (CMOPs) with large-scale decision variables. When using evolutionary algorithms to solve LSCMOPs, the main challenge lies in balancing feasibility, convergence, and diversity in the high-dimensional search space. However, only a few studies focus on LSCMOPs and most existing related algorithms fail to achieve satisfactory performance. This paper proposes two novel mechanisms (the individual adaptive evolution strategy and the regional collaboration mechanism) to tackle these challenges. The individual adaptive evolution mechanism introduces a dynamic approach to optimize convergence-related and diversity-related variables by allocating computational resources to individuals based on their evolution states. This method effectively balances convergence and diversity in the high-dimensional search space. The regional collaboration mechanism, on the other hand, employs an auxiliary population to explore multiple sub-regions to maintain diversity, guiding the main population towards the constrained Pareto front. By combining these two mechanisms within a two-stage algorithm framework, a new algorithm IAERCEA is proposed. IAERCEA and nine other state-of-the-art algorithms are evaluated on several benchmark suites and three dynamic economic emissions dispatch problems. The results show that IAERCEA has better or competitive performance.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Zhenyu Yang",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Kangjia Qiao",
            "country": ""
        },
        {
            "name": "Boyang Qu",
            "country": ""
        },
        {
            "name": "Ponnuthurai Nagaratnam Suganthan",
            "country": ""
        }
    ],
    "keywords": []
}