{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219302317",
    "title": "An improved particle swarm optimization algorithm for dynamic job shop scheduling problems with random job arrivals",
    "abstract": "Random job arrivals that happen frequently in manufacturing practice may create a need for dynamic scheduling. This paper considers an issue of how to reschedule the randomly arrived new jobs to pursue both performance and stability of a schedule in a job shop. Firstly, a  mixed integer programming  model is established to minimize three objectives, including the discontinuity rate of new jobs during the processing, the makespan deviation of initial schedule, and the sequence deviation on machines. Secondly, four match-up strategies from references are modified to determine the rescheduling horizon. Once new jobs arrive, the rescheduling process is immediately triggered with ongoing operations remain. The ongoing operations are treated as machine unavailable constraints (MUC) in the rescheduling horizon. Then, a  particle swarm optimization  (PSO) algorithm with improvements is proposed to solve the dynamic  job shop scheduling problem .  Improvement strategies  consist of a modified decoding scheme considering MUC, a population initialization approach by designing a new  transformation mechanism , and a novel particle movement method by introducing position changes and a random  inertia weight . Lastly, extensive experiments are conducted on several instances. The experiments results show that the modified rescheduling strategies are statistically and significantly better than the compared strategies. Moreover, comparative studies with five variants of PSO algorithm and three state-of-the-art meta-heuristics demonstrate the high performance of the  improved PSO algorithm .",
    "citation_count": "117",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Zhen Wang",
            "country": ""
        },
        {
            "name": "Jihui Zhang",
            "country": ""
        },
        {
            "name": "Shengxiang Yang",
            "country": ""
        }
    ],
    "keywords": []
}