{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000690",
    "title": "An improved NSGA-II algorithm based on reinforcement learning for aircraft moving assembly line integration optimization problem",
    "abstract": "In the aircraft moving assembly line, the focus of the assembly line balancing problem is to balance the workload in each workstation, the scheduling of aircraft assembly lines must consider the parallel relationship between assembly tasks and meet supply constraints. The aircraft moving assembly line integration optimization problem integrates the aircraft assembly line balancing problem with the aircraft assembly line scheduling problem to enhance aircraft assembly efficiency. The decision involves allocating all assembly tasks to a given number of workstations, auxiliary decisions pertain to determining the start times for assembly operations and the number of operators required. The objective is to minimize the cycle time and smoothness of the assembly line while ensuring that the number of workers on the assembly line is minimized. An integer linear programming model has been established to solve the aircraft moving assembly line integration optimization problem, and a new decoding method has been designed for this problem. A Bayesian reinforcement learning-improved NSGA-II algorithm (RLINSGA-II) has been proposed. After non-dominated sorting, the population is hierarchically divided, and a selection strategy is established among individuals of different levels. Through Bayesian reinforcement learning formulas, the selection strategy undergoes continuous adjustment throughout the population iteration process, thereby enhancing the quality of offspring individuals produced by the crossover operator. Finally, five test cases of different scales were designed based on actual cases, and the proposed RLINSGA-II was compared with five multi-objective optimization algorithms. Computational experiments and a real case study reveal the superiority of our proposed approach.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Xiaoyu Wen",
            "country": ""
        },
        {
            "name": "Xinyu Zhang",
            "country": ""
        },
        {
            "name": "Hao Li",
            "country": ""
        },
        {
            "name": "Shuo Ji",
            "country": ""
        },
        {
            "name": "Haoqi Wang",
            "country": ""
        },
        {
            "name": "Guoyong Ye",
            "country": ""
        },
        {
            "name": "Hongwen Xing",
            "country": ""
        },
        {
            "name": "Siren Liu",
            "country": ""
        }
    ],
    "keywords": []
}