{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221001541",
    "title": "An improved iterated greedy algorithm for the energy-efficient blocking hybrid flow shop scheduling problem",
    "abstract": "With the continuous development of national economies, problems of various energy consumption levels and pollution emissions in manufacturing have attracted attention from researchers. Most existing research has focused on reducing economic costs and energy consumption. However, the Hybrid Flow Shop Scheduling Problem with energy-efficient criteria has not yet been well studied, especially with blocking constraints. This paper is the first to present a mathematical model of the blocking hybrid flow shop problem with an energy-efficient criterion and a modified Iterative Greedy algorithm based on a swap strategy designed to optimize the constructed model. In the proposed algorithm, first, a heuristic is adopted to generate the initial solution. Second, a local perturbation strategy based on a swap operator is designed to ensure the convergence of the algorithm. Third, a simple global perturbation strategy based on a half-swap operator is proposed as a means to further search for the potentially best solution with the traditional simulated annealing criterion. The proposed algorithm is applied to 150 test instances at different scales and compared to state-of-the-art algorithms. The experimental results demonstrate that the proposed algorithm outperforms the compared algorithms and can obtain a better solution.",
    "citation_count": "92",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Hao-Xiang Qin",
            "country": ""
        },
        {
            "name": "Yu-Yan Han",
            "country": ""
        },
        {
            "name": "Biao Zhang",
            "country": ""
        },
        {
            "name": "Lei-Lei Meng",
            "country": ""
        },
        {
            "name": "Yi-Ping Liu",
            "country": ""
        },
        {
            "name": "Quan-Ke Pan",
            "country": ""
        },
        {
            "name": "Dun-Wei Gong",
            "country": ""
        }
    ],
    "keywords": []
}