{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001603",
    "title": "An improved problem transformation algorithm for large-scale multi-objective optimization",
    "abstract": "Solving Large-Scale Multi-Objective Optimization Problems (LSMOPs) is the major challenge in evolution computation. Due to the large number of decision variables involved, it is not easy for existing multi-objective evolutionary algorithms to search the entire decision variable space with limited computation resources. To address the above problem, a large-scale multi-objective evolutionary algorithm based on problem transformation, called LSMOEA/PT, is presented in this paper. LSMOEA/PT uses an improved problem transformation strategy to transform LSMOPs into small-scale multi-objective problems to accelerate convergence speed and reduce computational resources. Specifically, The transformation strategy selects reference solutions to initialize a weight population by applying the opposite individual method. After optimizing the weight population, a dual line strategy is implemented to combine the  weight vectors  with the decision variables from the original population, thereby generating a new population. The new population is combined with the original population for environment selection. In LSMOEA/PT, a double learning swarm optimizer is introduced to speed up the convergence of the population. A uniform distribution strategy is conducted to update transformed solutions after the problem transformation process, increasing the diversity of the population. Experimental results show that LSMOEA/PT is competitive with eleven state-of-the-art algorithms on large-scale multi-objective optimization test problems with up to 2000 decision variables.",
    "citation_count": "0",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Yu Sun",
            "country": ""
        },
        {
            "name": "Daijin Jiang",
            "country": ""
        }
    ],
    "keywords": []
}