{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650215000413",
    "title": "An improved cuckoo search based extreme learning machine for medical data classification",
    "abstract": "Machine learning techniques  are being increasingly used for detection and diagnosis of diseases for its accuracy and efficiency in pattern classification. In this paper, improved cuckoo search based  extreme learning machine  (ICSELM) is proposed to classify binary medical datasets. Extreme learning machine (ELM) is widely used as a learning algorithm for training single layer  feed forward   neural networks  (SLFN) in the field of classification. However, to make the model more stable, an  evolutionary algorithm  improved cuckoo search (ICS) is used to pre-train ELM by selecting the input weights and hidden biases. Like ELM, Moore–Penrose (MP)  generalized inverse  is used in ICSELM to analytically determines the output weights. To evaluate the effectiveness of the proposed model, four benchmark datasets, i.e. Breast Cancer, Diabetes, Bupa and Hepatitis from the UCI Repository of Machine Learning are used. A number of useful performance evaluation measures including accuracy, sensitivity, specificity,  confusion matrix , Gmean,  F -score and norm of the output weights as well as the area under the receiver operating characteristic (ROC) curve are computed. The results are analyzed and compared with both ELM based models like ELM, on-line sequential extreme learning algorithm (OSELM), CSELM and other  artificial neural networks  i.e. multi-layered  perceptron  (MLP), MLPCS, MLPICS and  radial basis function  neural network (RBFNN), RBFNNCS, RBFNNICS. The experimental results demonstrate that the ICSELM model outperforms other models.",
    "citation_count": "176",
    "year": "2015/10/01",
    "authors": [
        {
            "name": "P. Mohapatra",
            "country": ""
        },
        {
            "name": "S. Chakravarty",
            "country": ""
        },
        {
            "name": "P.K. Dash",
            "country": ""
        }
    ],
    "keywords": []
}