{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000687",
    "title": "An opposition equilibrium optimizer for context-sensitive entropy dependency based multilevel thresholding of remote sensing images",
    "abstract": "Earlier 1D histogram-based entropic methods for multilevel image thresholding suffer from the lack of contextual information. Subsequently, the idea was extended for 2D histogram-based methods, where neighbourhood pixels were considered to retain the contextual information. Nevertheless, 2D histogram-based entropic methods are computationally intensive. Moreover, these methods are based on the maximization of entropic functions using an optimizer, leading to less accuracy. To address these issues, we propose a context-sensitive entropy dependency (CSED) based multilevel thresholding method. A new optimizer called opposition equilibrium optimizer (OEO) is introduced. The opposition based learning and escaping strategy are incorporated to enhance exploration capability. Here, 31 test functions including 8 from standard testbed IEEE CEC 2014 are used for validation. The merits are – i) reduced complexity, ii) improved accuracy, iii) better stability and scalability, iv) enhanced exploration capability, v) well suited to random problems with changing dimensions, etc. The search history, trajectory, and average fitness history of the OEO are explicitly discussed. The Box plots and the convergence curves are presented to confirm its stability and faster convergence. Friedman's mean  rank test , Bonferroni-Dunn test, and Holm's test are also carried out to ensure OEO superiority over others. Encouraging thresholding results on high dimensional colour satellite images from the  Landsat  image gallery  are shown based on the suggested method (CSED-OEO). The quantitative measures (Peak  Signal to Noise Ratio , Feature  Similarity Index , and Structure Similarity Index) are used for validation. The CSED-OEO is compared with state-of-the-art methods and found better. It means, realistically, the method may be useful for segmentation-based analysis of colour images.",
    "citation_count": "22",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Manoj Kumar Naik",
            "country": ""
        },
        {
            "name": "Rutuparna Panda",
            "country": ""
        },
        {
            "name": "Ajith Abraham",
            "country": ""
        }
    ],
    "keywords": []
}