{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217305370",
    "title": "Ant Colony Optimization based model checking extended by smell-like pheromone with hop counts",
    "abstract": "This article presents an improvement of the  Ant Colony Optimization  (ACO) algorithm for specifically addressing the  software verification  problem. Model checking is a new  formal verification  technique that has been studied intensively. Given a model that abstracts the behaviors of a software system, and a specification that expresses the  desirable properties , a  verification system  called  model checker  automatically checks whether the model satisfies the specification or not. Since general model checkers work based on a deterministic algorithm, checking may require too much  execution time  and memory resource. This situation is called the state explosion problem. In order to mitigate this problem, an approach based on ACO was proposed. In this article, we have extended the ACO approach with smell-like pheromone that behaves like smell diffusing from food. In our approach, the smell-like pheromone records the number of hops from a destination state at each edge. Since our model checker searches the destination states in the direction where the number of hops decreases, it can complete the checking more efficiently. We have implemented a model checker based on our approach. The experimental results show that our approach practically decreases the execution time without sacrificing the quality of the solutions.",
    "citation_count": "7",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Tsutomu Kumazawa",
            "country": ""
        },
        {
            "name": "Keiichiro Takada",
            "country": ""
        },
        {
            "name": "Munehiro Takimoto",
            "country": ""
        },
        {
            "name": "Yasushi Kambayashi",
            "country": ""
        }
    ],
    "keywords": []
}