{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218301913",
    "title": "Ant colony system with a novel Non-DaemonActions procedure for multiprocessor task scheduling in multistage hybrid flow shop",
    "abstract": "This paper presents an ant colony system with a novel Non-DaemonActions procedure (ACSNDP) algorithm for  multiprocessor   task scheduling  in  multistage  hybrid flow shop. A DaemonActions procedure is an optional component of  ant colony optimization  (ACO), which integrates problem-specific actions that cannot be performed by single ants such as the actions performed by local search routines. In many applications to hard  combinatorial optimization problems , ACO performs best when integrated with local search routines because they move the ants' solutions to their local optimums. However, such an integration is shown as an effective approach only experimentally, and does not have any effects on the  convergence properties  of ACO theoretically, since the validity of  convergence proofs  depends only on the way solutions are constructed and not on the fact that the solutions are moved or not to their local optimums. Furthermore, it can be noticed that the traditional DaemonActions procedure does not interfere in the way solutions are constructed because local search routines have been always integrated with ACO in a daemon fashion i.e. they have been made hidden to the ants, and the ants do not how their solutions have been relocated. Consequently, the ants may perform limited exploitation (intensification) because they cannot exploit the problem-specific knowledge brought by the local search routine in such a way that enables them to construct these local optimums by themselves in the upcoming tour. In order to overcome these limitations, a novel Non-DaemonActions procedure, which can interfere positively in the way solutions are constructed, is proposed as follows. Iteratively at the end of each tour, the local search routine tries to improve the constructed solution, and then if a local optimum has been found, the ant learns the modifications made by the local search routine on its solution, and performs the corresponding modifications in the  pheromone concentrations  and  heuristic information  that will probably enable it to construct this local optimum by itself, in the upcoming tour, before the application of the local search over again. If the ant can do that, it will be able to construct more accurate local optimums in the upcoming tours by repeating the whole process over and over again, and thus enhance its exploitation capabilities. The proposed algorithm is tested on 700 well-known benchmark instances, with the proposed Non-DaemonActions procedure, and without it using the classical alternatives, and also compared with other 12 algorithms well-known in the literature. Computational results verify the improvements achieved by the proposed procedure, and show the superiority of the proposed algorithm over 7 of the compared works in terms of solution quality.",
    "citation_count": "33",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Mohamed Kurdi",
            "country": ""
        }
    ],
    "keywords": []
}