{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000948",
    "title": "Automatic preference based multi-objective evolutionary algorithm on vehicle fleet maintenance scheduling optimization",
    "abstract": "A preference based multi-objective evolutionary algorithm is proposed for generating solutions in an automatically detected knee point region. It is named Automatic Preference based DI-MOEA (AP-DI-MOEA) where DI-MOEA stands for Diversity-Indicator based Multi-Objective Evolutionary Algorithm). AP-DI-MOEA has two main characteristics: firstly, it generates the preference region automatically during the optimization; secondly, it concentrates the solution set in this preference region. Moreover, the real-world vehicle fleet maintenance scheduling optimization (VFMSO) problem is formulated, and a customized multi-objective evolutionary algorithm (MOEA) is proposed to optimize maintenance schedules of vehicle fleets based on the predicted failure distribution of the components of cars. Furthermore, the customized MOEA for VFMSO is combined with AP-DI-MOEA to find maintenance schedules in the automatically generated preference region. Experimental results on multi-objective benchmark problems and our three-objective real-world application problems show that the newly proposed algorithm can generate the preference region accurately and that it can obtain better solutions in the preference region. Especially, in many cases, under the same budget, the Pareto optimal solutions obtained by AP-DI-MOEA dominate solutions obtained by MOEAs that pursue the entire Pareto front.",
    "citation_count": "0",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Yali Wang",
            "country": ""
        },
        {
            "name": "Steffen Limmer",
            "country": ""
        },
        {
            "name": "Markus Olhofer",
            "country": ""
        },
        {
            "name": "Michael Emmerich",
            "country": ""
        },
        {
            "name": "Thomas Bäck",
            "country": ""
        }
    ],
    "keywords": []
}