{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304703",
    "title": "Automata design for honeybee search algorithm and its applications to 3D scene reconstruction and video tracking",
    "abstract": "Honeybees, as social insects, follow a modular strategy applied to dynamic environments to provide reasonable opportunities for partial solutions to evolve in the form of interacting coadapted subcomponents. The honeybee search algorithm combines concepts from the areas of evolutionary algorithms and  swarm intelligence  to solve optimization problems. This algorithm is mainly based on the  foraging behavior  of honeybees and the search power of evolution strategies, a type of evolutionary algorithm used for real-valued problems. This paper shows the integration between an automaton and the honeybee search algorithm to formalize the algorithm mathematically. The combination mentioned above is tested here with the innovative applications of three-dimensional scene reconstruction and video tracking. The experimental results for both applications show evidence that the honeybee search algorithm can be used to improve time costs in challenging  computer vision  tasks through controlled experiments and objective comparisons. Also, the validation of results demonstrates that the measured accuracy ranks top-tier among other algorithms in the ALOV++ benchmark.",
    "citation_count": "9",
    "year": "2021/03/01",
    "authors": [
        {
            "name": "Oscar E. Perez-Cham",
            "country": ""
        },
        {
            "name": "Cesar Puente",
            "country": ""
        },
        {
            "name": "Carlos Soubervielle-Montalvo",
            "country": ""
        },
        {
            "name": "Gustavo Olague",
            "country": ""
        },
        {
            "name": "Francisco-Edgar Castillo-Barrera",
            "country": ""
        },
        {
            "name": "Jose Nunez-Varela",
            "country": ""
        },
        {
            "name": "Jorge Limon-Romero",
            "country": ""
        }
    ],
    "keywords": []
}