{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000896",
    "title": "Auxiliary optimization framework based on scaling transformation matrix for large-scale multi-objective problem",
    "abstract": "Large-scale multi-objective optimization problems (LSMOPs) usually have a complex continuous search space, and it is difficult for a single optimization strategy to effectively explore the decision space. Meanwhile, the dimensionality reduction strategy is easy to lose the original data information and cannot be recovered in the optimization process. Therefore, this paper proposes an auxiliary optimization framework based on the scaling transformation matrix (AOF-STM) for solving the LSMOPs, which utilizes the optimization information from low-dimensional auxiliary problems to assist in the optimization of high-dimensional original problems. The construction of the scaling transformation matrix (STM) is based on calculating the similarity of the distribution features between the objective space and decision space, and then effective information sharing between different problems is achieved by STM. Specifically, each element STM ( i , j ) reflects the similarity between the  i -th decision variable (in low-dimensional auxiliary problem) and the  j -th decision variable (in high-dimensional original problem). Based on the proposed scaling transformation matrix STM, the information and experience of the low-dimensional auxiliary problem can be effectively used to guide the learning process of the original problem. Experimental results show that on LSMOPs with the 1000 to 50000 decision variables, AOF-STM shows better performance in terms of convergence and diversity than several state-of-the-art algorithms.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Yuanyuan Ge",
            "country": ""
        },
        {
            "name": "Zhanpeng Wang",
            "country": ""
        },
        {
            "name": "Hongyan Wang",
            "country": ""
        },
        {
            "name": "Fan Cheng",
            "country": ""
        },
        {
            "name": "Lei Zhang",
            "country": ""
        }
    ],
    "keywords": []
}