{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224003006",
    "title": "Balancing heterogeneous assembly line with multi-skilled human-robot collaboration via Adaptive cooperative co-evolutionary algorithm",
    "abstract": "In human-centred manufacturing, deploying collaborative robots (cobots) is recognized as a promising strategy to enhance the inclusiveness and resilience of production systems. Despite notable progress, current production scheduling methods for human-robot collaboration (HRC) still fail to adequately accommodate workforce heterogeneity, significantly reducing their adoption and implementation. To address this gap, we introduce a novel model for the Assembly Line Worker Integration and Balancing Problem considering Multi-skilled Human-Robot Collaboration (ALWIBP-mHRC). This model aims to optimize task scheduling between semi-skilled workers and cobots, aiming to maximize productivity and minimize costs. It features a multi-skilled human-robot collaboration (mHRC) task assignment scheme that selects the optimal assembly/collaboration mode from seven scenarios, based on specific task requirements and resource-skill availability, thus maximizing resource-skill complementarity. To tackle the complexities of this problem, we propose an adaptive multi-objective cooperative co-evolutionary algorithm (a-MOCC) that incorporates a sub-problem decomposition and decoding framework tailored for ALWIBP-mHRC, enhanced by an adaptive evolutionary strategy based on Q-learning (Q-Coevolution). Experimental tests demonstrate the superior performance of the proposed method compared to other established metaheuristic algorithms across various instance sizes, underscoring its effectiveness in enhancing the productivity of production systems for semi-skilled workers. The findings are significant for investment decision-making and resource planning, as they highlight the strategic value of integrating cobots in large-scale heterogeneous workforce production. This work underscores the potential of cobots to mitigate skill gaps in assembly systems, laying the groundwork for future research and industrial strategies focused on enhancing productivity, inclusivity, and adaptability in a dynamically changing labour market.",
    "citation_count": "0",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Bo Tian",
            "country": ""
        },
        {
            "name": "Himanshu Kaul",
            "country": ""
        },
        {
            "name": "Mukund Janardhanan",
            "country": ""
        }
    ],
    "keywords": []
}