{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002384",
    "title": "Batch subproblem coevolution with gaussian process-driven linear models for expensive multi-objective optimization",
    "abstract": "The efficacy of surrogate-assisted multi-objective evolutionary algorithms (SAMOEAs) in addressing expensive multi-objective optimization problems (MOPs) is contingent upon the modeling techniques and model-based infill sampling strategies. In addressing this pivotal aspect, this paper introduces a pioneering methodology known as batch subproblem coevolution with Gaussian process-driven linear models (BSCo-GPLM). Specifically, from a modeling perspective, BSCo-GPLM decomposes the MOP into single-objective subproblems. Following this decomposition, for each subproblem, a Gaussian process-driven linear model (GPLM) is collaboratively trained to prevent overfitting and improve prediction accuracy. Regarding infill sampling, collaborative optimization of all GPLMs yields optimal candidate solutions for each subproblem, organized into coherent clusters. Within each cluster, only the solution with the highest utility is evaluated. Relying on the heightened prediction accuracy of the GPLM model and an efficient batch sampling strategy, BSCo-GPLM exhibits clear superiority over state-of-the-art SAMOEAs in effectively addressing expensive MOPs. The source code of BSCo-GPLM is available at  https://github.com/CIAM-Group/EvolutionaryAlgorithm_Codes/tree/main/BSCo-GPLM .",
    "citation_count": "3",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Zhenkun Wang",
            "country": ""
        },
        {
            "name": "Yuanyao Chen",
            "country": ""
        },
        {
            "name": "Genghui Li",
            "country": ""
        },
        {
            "name": "Lindong Xie",
            "country": ""
        },
        {
            "name": "Yu Zhang",
            "country": ""
        }
    ],
    "keywords": []
}