{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218304826",
    "title": "Behaviour of Multi-Level Selection Genetic Algorithm (MLSGA) using different individual-level selection mechanisms",
    "abstract": "The Multi-Level Selection  Genetic Algorithm  (MLSGA) is shown to increase the performance of a  simple Genetic Algorithm . It is unique among  evolutionary algorithms  as its sub-populations use separate selection and reproduction mechanisms to generate  offspring  sub-populations, called collectives in this approach, to increase the selection pressure, and uses a split in the fitness function to maintain the diversity of the search. Currently how these novel mechanisms interact with different reproduction mechanisms, except for the one originally tested at the individual level is not known. This paper therefore creates three different variants of MLSGA and explores their behaviour, to see if the diversity and selection pressure benefits are retained with more complex individual selection mechanisms. These hybrid methods are tested using the CEC ′ 09 competition, as it is the widest current benchmark of bi-objective problems, which is updated to reflect the current state-of-the-art. Guidance is given on the new mechanisms that are required to link MLSGA with the different individual level mechanisms and the hyperparameter tuning which results in  optimal performance . The results show that the hybrid approach increases the performance of the proposed algorithms across all the problems except for MOEA/D on unconstrained problems. This shows the generality of the mechanisms across a range of Genetic Algorithms, which leads to a performance increase from the MLSGA collective level mechanism and split in the fitness function. It is shown that the collective level mechanism changes the behaviour from the methods selected at the individual level, promoting diversity first instead of convergence, and focuses the search on different regions, making it a particularly strong choice for problems with discontinuous  Pareto fronts . This results in the best general solver for the updated bi-objective CEC ′ 09 problem sets.",
    "citation_count": "8",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Przemyslaw A. Grudniewski",
            "country": ""
        },
        {
            "name": "Adam J. Sobey",
            "country": ""
        }
    ],
    "keywords": []
}