{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216300037",
    "title": "Bio-inspired search algorithms for unstructured P2P overlay networks",
    "abstract": "Efficient location and manipulation of complex and often incomplete data is a difficult, challenging task in nowadays extremely complex IT systems and on the Internet, overwhelmed with a huge amount of information. The problem itself is present in numerous different practical use-cases (e.g., in P2P streaming applications that rapidly gain more attention) and refers to the selection of the proper, efficient search algorithm. Research and commercial efforts resulted in a prolific offer of different algorithms that try to address this problem in the best possible way. Due to the huge complexity, intelligent algorithms are the most promising ones. However, everyday changing conditions impose finding even more advantageous approaches that will better cope with the problem, or at least address some “corner cases” better, than previously realized ones. In this paper, we propose a self-organizing approach inspired by bio-intelligence of slime molds that possesses distributive and autonomous properties with the goal to achieve a good query capability. A slime mold mechanism is adapted for search in an unstructured  P2P system , and compared with Antnet and Gnutella search mechanisms. The benchmarks cover parameter sensitivity analysis, and comparative analysis. To validate the obtained results, a statistical analysis is performed. The obtained results show good scalability of slime mold algorithm and point to the selected “corner” cases where the slime mold algorithm has a total  good performance  (measured by different metrics).",
    "citation_count": "14",
    "year": "2016/08/01",
    "authors": [
        {
            "name": "Vesna Šešum-Čavić",
            "country": ""
        },
        {
            "name": "Eva Kühn",
            "country": ""
        },
        {
            "name": "Daniel Kanev",
            "country": ""
        }
    ],
    "keywords": []
}