{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400138X",
    "title": "Bottleneck alleviation and scheduling optimization of flexible manufacturing system based on information-energy flow model",
    "abstract": "The identification and alleviation of bottleneck machines in  manufacturing systems  are of paramount importance for optimizing production decision-making in  enterprises . Extensive research has been conducted by numerous scholars on the identification of bottleneck machines; however, there is a relative scarcity of research, particularly in the context of  flexible manufacturing systems , regarding how to effectively alleviate the identified bottlenecks. In this paper, a novel hyper-heuristic evolutionary scheduling algorithm with a bottleneck alleviation strategy based on the information-energy flow model (HESA-BA-IEF) is proposed for training dispatching rules and optimizing decision-making in flexible job shops with bottleneck machines. HESA-BA-IEF constructs an information-energy flow model for flexible job shops based on complex networks. Through this model, dynamic changes in machine processing status and energy consumption during the scheduling process can be effectively simulated, facilitating the accurate identification of bottleneck machines. Moreover, the algorithm adopts the genetic programming hyper-heuristics and introduces a scheduling mechanism considering the alleviation of bottleneck machines to optimize the makespan and total energy consumption, while simultaneously alleviating bottlenecks. Experiments show that HESA-BA-IEF generates dispatching rules that optimize scheduling and alleviate bottlenecks simultaneously. Furthermore, statistical analysis reveals a 7.71% reduction in bottleneck metrics of production line due to 30.40% scheduling rounds with bottleneck alleviation mechanism in effect.",
    "citation_count": "0",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Zeliang Ju",
            "country": ""
        },
        {
            "name": "Yan Wang",
            "country": ""
        },
        {
            "name": "Zhen Quan",
            "country": ""
        },
        {
            "name": "Xiang Liu",
            "country": ""
        },
        {
            "name": "Zhicheng Ji",
            "country": ""
        }
    ],
    "keywords": []
}