{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001390",
    "title": "Can the global optimum of a combinatorial optimization problem be reliably estimated through extreme value theory?",
    "abstract": "The accurate estimation of the  global optimum  of a non-polynomial optimization problem would provide certainty and reliability to the solutions obtained by metaheuristics. Different statistical approaches have been proposed to perform this type of estimation, being the  Extreme Value Theory  currently one of the most widespread. The contribution of this paper is to provide empirical evidence on how unreliable the estimates of global optima of  combinatorial optimization problems  can be when using Extreme Value Theory. This study uses a structural engineering optimization problem as a case study. Four metaheuristics with different performances are used to solve the problem: two  genetic algorithms  and two evolution strategies with different search parameters. The study shows that the use of Extreme Value Theory can lead to wrong conclusions because its global optimum estimates depend on the search algorithm's performance. The results also show that samples generated by poorly performing search algorithms produce estimates of the global optimum with high variability. Additionally, it was observed that high-performing algorithms generated samples with low variability, which paradoxically made the statistical estimation of the global optimum inviable. The conclusions derived from the study are of great relevance for anyone interested in using the Extreme Value Theory to estimate the global optimum of a combinatorial optimization problem.",
    "citation_count": "7",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Luis Velasco",
            "country": ""
        },
        {
            "name": "Hector Guerrero",
            "country": ""
        },
        {
            "name": "Antonio Hospitaler",
            "country": ""
        }
    ],
    "keywords": []
}