{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022500032X",
    "title": "Convolutional neural network combined with reinforcement learning-based dual-mode grey wolf optimizer to identify crop diseases and pests",
    "abstract": "Agriculture is crucial for national food security, but crop pests and diseases pose significant threats. Traditional manual methods for detection are subjective, costly, and less accurate. Deep learning, especially convolutional neural network, is revolutionizing crop pest and disease identification, manual hyperparameter tuning can lead to suboptimal results. In contrast, grey wolf optimizer has demonstrated effective global search capabilities in hyperparameter optimization, improving model performance. Therefore, a reinforcement learning-based dual-mode grey wolf optimizer is introduced to enhance the performance of the original algorithm in hyperparameter optimization and identify the optimal hyperparameters, which combines a dynamic elite learning strategy and a dual-mode adaptive strategy well balanced with the exploration and exploitation of populations, while the integration of the reinforcement learning technique strengthens the information feedback. To validate the effectiveness of the proposed algorithm, additional ablation experiments were conducted, and experiments using CPU time as the termination criterion were included to increase rigor and ensure fairness. The main hyperparameters of convolutional neural network optimized by the proposed algorithm is utilized for the recognition of the pentatomidae stinkbug pests and corn diseases, with experimental results compared against six other intelligent optimization algorithms. Results from two sets of experiments indicate that the proposed algorithm improves the recognition accuracy of the original convolutional neural networks model, achieving the highest accuracy on the pest dataset at 95.83 % and on the corn disease dataset at 96.51 %.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Yangchen Lu",
            "country": ""
        },
        {
            "name": "Xiaobing Yu",
            "country": ""
        },
        {
            "name": "Zhengpeng Hu",
            "country": ""
        },
        {
            "name": "Xuming Wang",
            "country": ""
        }
    ],
    "keywords": []
}