{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218304334",
    "title": "Cooperative bacterial foraging optimization method for multi-objective multi-echelon supply chain optimization problem",
    "abstract": "Making integrated decisions has a positive effect on component companies' competitiveness and success in the multi-echelon  supply chain  network. This paper developed a more realistic integrated supply chain model, considering multi-objective, multi-product, multi-period, lead time et al. Minimum total cost and maximum customer satisfactory level are considered as optimization objectives simultaneously. As integrated supply chain  optimization problems  are typically NP-hard, a heuristic  optimization algorithm , referred as Cooperative Multi-objective Bacterial Foraging Optimization, is proposed to solve supply chain optimization problems. In this research, the proposed cooperative evolutionary method is developed to accelerate the search process and enhance search accuracy. The feasibility control mechanism of solutions is implemented to ensure solutions are in the feasible domain. Moreover, an  external storage  mechanism is adopted to deal with multi-objective features and keep a historical record of the non-dominated individuals found by the algorithm, whereas the algorithm structure redesign method is used to reduce the complexity of the algorithm. The numerical experiments illustrate that the proposed algorithm can successfully optimize the supply chain and find better non-nominated solutions.",
    "citation_count": "26",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Ben Niu",
            "country": ""
        },
        {
            "name": "Lijing Tan",
            "country": ""
        },
        {
            "name": "Jing Liu",
            "country": ""
        },
        {
            "name": "Jia Liu",
            "country": ""
        },
        {
            "name": "Wenjie Yi",
            "country": ""
        },
        {
            "name": "Hong Wang",
            "country": ""
        }
    ],
    "keywords": []
}