{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000380",
    "title": "Data Stream driven evolutionary algorithm for cost sensitive robust optimization over time",
    "abstract": "Many dynamic optimization problems in real-world domains like engineering and management science require considerations of robustness, where a balance between tracking optimal solutions in changing environments and managing costs of switching solutions is needed. However, in some cases, the objective functions are not analytically available and must be approximated based on data collected from numerical simulations or experiments. These dynamic problems are formulated as data stream driven robust optimization over time (DDROOT G ) problems, which cannot be satisfactorily addressed by existing dynamic optimization algorithms. Therefore, we propose a data stream driven multi-form evolutionary algorithm (DDMFEA), employing two separate Kriging models to approximate the unavailable objective function and the computationally expensive robustness estimation, respectively. In the proposed algorithm, DDROOT G  problems are addressed with two distinct formulations with single- and multi-objectives. These formulations are utilized as a multi-form optimization process to mitigate the impact of approximation errors from both Kriging models. In addition, a novel solution selection mechanism is designed to consider both robustness and predicted objective values, facilitating the deployment of the optimal robust solution. Throughout the experiment, four robust comparison algorithms are employed to assess the performance of the proposed DDMFEA across various problems in different decision dimensions. The experimental results validate the significance of each proposed contribution and demonstrate the exceptional performance of DDMFEA.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Zhening Liu",
            "country": ""
        },
        {
            "name": "Handing Wang",
            "country": ""
        },
        {
            "name": "Jinliang Ding",
            "country": ""
        },
        {
            "name": "Cuie Yang",
            "country": ""
        },
        {
            "name": "Yaochu Jin",
            "country": ""
        }
    ],
    "keywords": []
}