{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001445",
    "title": "Deep reinforcement learning assisted automated guiding vector selection for large-scale sparse multi-objective optimization",
    "abstract": "Sparse multi-objective  optimization problems  (SMOPs) are prevalent in a wide range of applications, spanning from the fields of science to engineering. Existing sparse  evolutionary algorithms  utilize single or multiple guiding vectors to direct the generation of  offspring  solutions in a constant manner according to human experience, which are difficult to determine the best guiding vector for various population states and prone to falling into premature convergence. To address the dilemma in guiding vector adaptation, this paper proposes a novel guiding vector selection method based on  reinforcement learning . In the proposed method, the features extracted from the current population are regarded as states, the overall degrees of improvement in population convergence and diversity are regarded as rewards, and the candidate guiding vectors are regarded as actions. By using  deep neural networks  to establish the mapping model between population states and the expected cumulative rewards of guiding vectors, the proposed method can determine the best guiding vector for the current population at each generation. The selected guiding vector inspires the development of novel  genetic  operators, which can approximate sparse  Pareto optimal solutions  in high-dimensional decision spaces. Experimental results on both benchmark and real-world SMOPs demonstrate that the proposed algorithm has significant advantages when compared with the state-of-the-art.",
    "citation_count": "7",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Shuai Shao",
            "country": ""
        },
        {
            "name": "Ye Tian",
            "country": ""
        },
        {
            "name": "Xingyi Zhang",
            "country": ""
        }
    ],
    "keywords": []
}