{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000109",
    "title": "Differential evolution using improved crowding distance for multimodal multiobjective optimization",
    "abstract": "In  multiobjective optimization , the relationship between decision space and  objective space  is generally assumed to be a one-to-one mapping, but it is not always the case. In some problems, different variables have the same or similar objective value, which means a many-to-one mapping. In this situation, there is more than one  Pareto Set  (PS) mapping to the same  Pareto Front  (PF) and these problems are called multimodal  multiobjective problems . This paper proposes a multimodal multiobjective  differential evolution algorithm  to solve these problems. In the proposed method, the difference vector is generated taking the diversity in both decision and objective space into account. The way to calculate  crowding distance  is quite different from the others. In the crowding distance calculation process, all the selected individuals are taken into account instead of considering each Pareto rank separately. The crowding distance in decision space is replaced with the weighted sum of  Euclidean distances  to its neighbors. In the environmental selection process, not all the individuals in top ranks are selected, because some of them may be very crowded. Instead, the potential solutions in the bottom rank are given a chance to evolve. With these operations, the proposed algorithm can maintain multiple PSs of multimodal multiobjective  optimization problems  and improve the diversity in both decision and objective space. Experimental results show that the proposed method can achieve high comprehensive performance.",
    "citation_count": "141",
    "year": "2021/04/01",
    "authors": [
        {
            "name": "Caitong Yue",
            "country": ""
        },
        {
            "name": "P.N. Suganthan",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Boyang Qu",
            "country": ""
        },
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Yongsheng Zhu",
            "country": ""
        },
        {
            "name": "Li Yan",
            "country": ""
        }
    ],
    "keywords": []
}