{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217308994",
    "title": "Effective invasive weed optimization algorithms for distributed assembly permutation flowshop problem with total flowtime criterion",
    "abstract": "Distributed assembly permutation  flowshop scheduling  problem (DAPFSP) has important applications in modern assembly systems. In this paper, we present three variants of the discrete invasive weed optimization (DIWO) for the DAPFSP with total flowtime criterion. For solving such a problem, we present a two-level representation that consists of a product permutation and a number of job sequences. We introduce neighbourhood operators for both the product permutation and job sequences. We design effective local search procedures respectively for product-permutation-based neighbourhood and job-sequence-based neighbourhood. By combining the problem-specific knowledge and the idea of invasive weed optimization, we present three DIWO-based algorithms: a two-level discrete invasive weed optimization (TDIWO), a discrete invasive weed optimization with hybrid search operators (HDIWO), and a HDIWO with selection probability. The algorithms explore the two neighbourhoods in quite a different way. We calibrate the presented  DIWO algorithms  by means of the design of  experimental method , and carry out a comprehensive computational campaign based on the 810 benchmark instances in the literature. The numerical experiments show that the presented DIWO algorithms perform significantly better than the other competing algorithms in the literature. Among the proposed algorithms, HDIWO is the best one.",
    "citation_count": "131",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Hong-Yan Sang",
            "country": ""
        },
        {
            "name": "Quan-Ke Pan",
            "country": ""
        },
        {
            "name": "Jun-Qing Li",
            "country": ""
        },
        {
            "name": "Ping Wang",
            "country": ""
        },
        {
            "name": "Yu-Yan Han",
            "country": ""
        },
        {
            "name": "Kai-Zhou Gao",
            "country": ""
        },
        {
            "name": "Peng Duan",
            "country": ""
        }
    ],
    "keywords": []
}