{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001220",
    "title": "Efficient search of decision makers’ region of interest by using preference directions in multi-objective coevolutionary algorithm",
    "abstract": "Most multi-objective  evolutionary algorithms  (MOEAs) provide  decision makers  (DMs) with an overall trade-off  Pareto front . However, in practice, DMs are generally interested in a specific subset of the Pareto front that satisfies their preferences; this subset is known as the region of interest (ROI). Existing preference-based MOEAs may fail to provide satisfactory ROIs to DMs owing to inaccurate analysis of the DM’s preference information or weak diversity maintenance. This study proposes a multi-objective coevolutionary algorithm (MOCA) based on the DM’s preference direction (MOCA-PD), inspired by the mechanism of the social division of labor. To achieve the social goal of obtaining the ROI, a search center is generated by a preference model based on the DM’s preference direction. The preference model uses the search center as the criterion for the social selection of talents, with some solutions that meet the DM’s preferences selected as social leaders. To accelerate the realization of the social goal, the preference model assigns team members according to the leader’s ability; this is similar to how more capable leaders lead more team members in a society. Two teamwork operations are defined for team members to communicate (crossover and mutation) and generate  offspring  that are better aligned with the DM’s preferences. In addition, the diversity of social leaders is ensured by introducing an elite archive and  ϵ -dominance mechanism. Experimental results on the ZDT, DTLZ, and MaF problems show that the proposed algorithm can effectively guide the population to the ROI, enabling DMs to make better and more reliable decisions.",
    "citation_count": "4",
    "year": "2023/08/01",
    "authors": [
        {
            "name": "Dan Zhou",
            "country": ""
        },
        {
            "name": "Jiqing Du",
            "country": ""
        },
        {
            "name": "Sachiyo Arai",
            "country": ""
        }
    ],
    "keywords": []
}