{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022200164X",
    "title": "Ensemble of selection operators for decomposition-based multi-objective evolutionary optimization",
    "abstract": "Decomposition-based multi-objective  evolutionary algorithms  (MOEA/D) have demonstrated competitive performance in solving complicated multi-objective  optimization problems . The two mainstream selection operators of MOEA/D for updating populations, i.e., neighborhood-based and best-fitness-based selection operators, perform differently in balancing diversity and convergence. This paper explores the properties of the two mainstream selection operators and designs an ensemble approach, striving to integrate their merits and complement each other’s weaknesses. In this ensemble approach, each selection operator manipulates a population, and the  offspring  solutions reproduced by any population update two populations concurrently. In this way, high-quality offspring solutions reproduced by one population have opportunities to improve the convergence or diversity of another population. Moreover, this ensemble approach includes a novel adaptive strategy to pick up mating solutions from each population according to their contributions during previous generations. Thus, the population with a higher contribution will receive more evolution opportunities to reproduce solutions with better convergence and diversity. Finally, we compare the proposal with twelve baseline algorithms on 43 test cases from four frequently-used test suites and the real-world application of cloud service compositions. The comparison results demonstrate the superiority of the proposal in balancing diversity and convergence.",
    "citation_count": "3",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Rui Hong",
            "country": ""
        },
        {
            "name": "Lining Xing",
            "country": ""
        },
        {
            "name": "Guoting Zhang",
            "country": ""
        }
    ],
    "keywords": []
}