{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218302530",
    "title": "Flexible time-of-use tariff with dynamic demand using artificial bee colony with transferred memory scheme",
    "abstract": "Balancing the contradiction between electricity demand and supply is the fundamental issue in demand side management (DSM). To address it, time-of-use (TOU) tariff has been studied extensively. In the TOU tariff, different prices are assigned to different periods of electricity consumption. The customers are implicitly encouraged to shift the consumption from peak to non-peak periods, resulting in the decrease of electricity supply cost and the increase of customer benefits. In this paper, the TOU tariff for a real-world thermal electricity company under dynamic electricity demand is studied. Specifically, a flexible TOU (FTOU) tariff model is proposed to optimize the electricity prices and their allocations to different time periods simultaneously, constrained by the dynamic demand of customers. A mixed artificial bee colony (mABC) approach is proposed to deal with the continuous prices and discrete allocations simultaneously, embedded with a transferred memory scheme (TMS) to achieve the flexible and smooth tariff design with dynamic demand. The experimental studies via the real-world scenarios are conducted to assess the performance of the proposal in comparison with various state-of-the-art approaches, including the standard and advanced variants. The effectiveness and applicability of TMS are also demonstrated by integrating into other advanced optimizers, such as L-SHADE and HCLPSO.",
    "citation_count": "18",
    "year": "2019/05/01",
    "authors": [
        {
            "name": "Xianneng Li",
            "country": ""
        },
        {
            "name": "Huiyan Yang",
            "country": ""
        },
        {
            "name": "Meihua Yang",
            "country": ""
        },
        {
            "name": "Guangfei Yang",
            "country": ""
        }
    ],
    "keywords": []
}