{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022030403X",
    "title": "Framework of model selection criteria approximated genetic programming for optimization function for renewable energy systems",
    "abstract": "For the realization of complex  renewable energy systems  (such as nano-fluids based direct absorption solar collector), an evolutionary  system identification  method such as genetic programming (GP) can be applied to develop mathematical models/functional relationships between the process parameters. The system complexity is attributed to interaction among the design variables influencing the outputs. There are also uncertainties in the system due to random and unknown variations in the design and response variables. GP suffers from the higher complexity structure of its solutions and non-optimal convergence, which leads to poor fitness values. Therefore, to address these uncertainties and problems, the framework based on the model selection criteria approximated genetic programming (MSC-GP) is proposed for the formulation of geometry design based  thermal efficiency  and  entropy generation  optimization function for direct absorption solar collector (DASC) system. In this proposed method, the four mathematical model selection criteria are used as an approximation for objective functions in GP framework for the evaluation of fitting degree and structure of the model. The results based on statistical measures (best fitness, mean fitness, standard deviation of fitness, number of nodes) show that models obtained from the mathematical selection criteria, Predicted Residual error sum of squares (PRESS), have performed the best. Based on  Pareto front  analysis of PRESS function, it is found that the best objective values and the number of nodes of models (complexity) follows more or less gradually slow increasing trend which is a good symbolic desirable sign of minimal increase of complexity of model with a decrease in objective values as the values of generation increases. The results of the sensitivity analysis show that the main factor affecting the efficiency of DASC is its geometry of the structure. 3-D interaction analysis shows that increasing the thickness, length and reducing the width of the collector can make the system maintain its higher  thermal efficiency  and a smaller entropy generation, which is useful for the optimized operation of DASC. Non-dominated sorting genetic algorithm-II (NSGA-II) is applied in the acquisition of the optimal geometric settings of DASC system based on the selected models. The optimal settings achieved is 5 cm in length, 5 cm in width, and 2 cm in thickness. Systems when operated using these settings results in a satisfactory performance with 77.8117% in thermal efficiency and 6.0004E+3 in entropy generation).",
    "citation_count": "6",
    "year": "2020/12/01",
    "authors": [
        {
            "name": "Akhil Garg",
            "country": ""
        },
        {
            "name": "Shaosen Su",
            "country": ""
        },
        {
            "name": "Fan Li",
            "country": ""
        },
        {
            "name": "Liang Gao",
            "country": ""
        }
    ],
    "keywords": []
}