{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000561",
    "title": "Function value ranking aware differential evolution for global numerical optimization",
    "abstract": "Differential evolution (DE) has been experimentally demonstrated to be effective in solving optimization problems. However, the effectiveness of DE encounters rapid deterioration in the face of complicated optimization problems with many grotesque local basins, which are emerging increasingly frequently nowadays. To alleviate this predicament, this paper devises a simple yet effective mutation scheme named “DE/current-to-rwrand/1” to further promote the optimization ability of DE in solving complicated optimization problems. Specifically, this strategy assigns a non-linear selection probability for each individual, which is computed based on its function value ranking. As a result, all individuals can be potentially selected to direct the mutation of the population, but better individuals preserve exponentially larger selection probabilities. In this way, the resultant DE, which is named function value ranking aware differential evolution (FVRADE), is expectedly capable of balancing high diversity and fast convergence of the population well to find satisfactory solutions to optimization problems. In particular, two classical and popular mutation strategies, namely “DE/current-to-rand/1” and “DE/current-to-best/1”, are two special cases of the proposed mutation strategy. Abundant experiments have been extensively executed on the well-known CEC’2017 and the latest CEC’2021 benchmark problem sets. Experimental results have verified that FVRADE performs highly competitively with or even significantly better than several representative and state-of-the-art peer methods. In particular, it is experimentally demonstrated that FVRADE is particularly good at solving complicated optimization problems, and preserves a good scalability to deal with optimization problems. Besides, experiments have also been conducted on the popularly adopted CEC’2011 real-world optimization problem suite and the experimental results have substantiated that FVRADE is very promising to solve real-world optimization problems.",
    "citation_count": "36",
    "year": "2023/04/01",
    "authors": [
        {
            "name": "Dong Liu",
            "country": ""
        },
        {
            "name": "Hao He",
            "country": ""
        },
        {
            "name": "Qiang Yang",
            "country": ""
        },
        {
            "name": "Yiqiao Wang",
            "country": ""
        },
        {
            "name": "Sang-Woon Jeon",
            "country": ""
        },
        {
            "name": "Jun Zhang",
            "country": ""
        }
    ],
    "keywords": []
}