{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000043",
    "title": "Grid search based multi-population particle swarm optimization algorithm for multimodal multi-objective optimization",
    "abstract": "In the multimodal multi-objective optimization problems (MMOPs), there may exist two or multiple equivalent  Pareto optimal sets  (PS) with the same  Pareto Front  (PF). The difficulty of solving MMOPs lies in how to locate more equivalent PS in decision space and maintain a promising balance between the diversity of  Pareto optimal solutions  in decision space and the convergence of Pareto optimal solutions in objective space at the same time. To address these issues, a grid search based multi-population  particle swarm optimization  algorithm (GSMPSO-MM) is proposed in this paper to handle MMOPs. Multi-populations based on the k-means clustering method is adopted to locate more equivalent PS in decision space, and a grid is applied to explore high-quality solutions in decision space in GSMPSO-MM. The environmental selection operator, including the removing inefficient solutions operator and the updating non-dominated solutions archive, aims to approach the true non-dominated solutions, where the updating non-dominated solution archive is responsible for developing the diverse solutions in both the decision and objective space, simultaneously. Besides, the purpose of removing inefficient solutions with inferior convergence in objective space is to maintain promising  convergence solutions  in objective space. GSMPSO-MM is compared with seven state-of-the-art algorithms on a well-known MMOPs benchmark function. Experimental results demonstrate the superior performance of our proposed algorithm in solving MMOPs.",
    "citation_count": "99",
    "year": "2021/04/01",
    "authors": [
        {
            "name": "Guoqing Li",
            "country": ""
        },
        {
            "name": "Wanliang Wang",
            "country": ""
        },
        {
            "name": "Weiwei Zhang",
            "country": ""
        },
        {
            "name": "Zheng Wang",
            "country": ""
        },
        {
            "name": "Hangyao Tu",
            "country": ""
        },
        {
            "name": "Wenbo You",
            "country": ""
        }
    ],
    "keywords": []
}