{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000671",
    "title": "Handling dynamic capacitated vehicle routing problems based on adaptive genetic algorithm with elastic strategy",
    "abstract": "With the development of e-commerce platforms, the  logistics industry  is also booming. The transportation process is at the core of the logistics industry, which influences the timeliness and rationality of logistics distribution. In the real world, there are many dynamic demands in logistics distribution, so logistics distribution should deal with dynamic demands quickly to realize more effective route planning. This paper proposes an  adaptive genetic algorithm  (AGA) with elastic strategy (AGA-ES) to solve the dynamic capacitated  vehicle routing problems  (DCVRPs). Firstly,  AGA designs  an adaptive local search operator, which can adaptively adjust the quantity of nodes that need local search, according to the fitness value of different individuals. At the same time, AGA develops adaptive crossover and  mutation operators , which can automatically adjust the crossover and  mutation probability  based on the different fitness values. The experimental results verify the better performance of AGA on the traditional capacitated vehicle routing problems (CVRPs). After that, AGA combines elastic strategy (AGA-ES) to solve DCVRPs. This paper mainly concerns three types of actual demand information in DCVRPs: distribution nodes increase, distribution nodes decrease, and distribution road conditions change, according to the actual background. AGA-ES could interact with demand information and judge the types of different demands, and then adaptively plan new and reasonable routes after receiving one or more of the above demand information. The verification of benchmark data sets shows that AGA-ES can effectively deal with DCVRPs. Furthermore, this paper collects the longitude and latitude coordinates of 100  SF  express stations in Xi’an, constructs the distribution information of these express stations, and verifies that AGA-ES can solve the DCVRPs under the actual background.",
    "citation_count": "9",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Jianxia Li",
            "country": ""
        },
        {
            "name": "Ruochen Liu",
            "country": ""
        },
        {
            "name": "Ruinan Wang",
            "country": ""
        }
    ],
    "keywords": []
}