{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000846",
    "title": "Hierarchical structure-based joint operations algorithm for global optimization",
    "abstract": "Joint  operations algorithm (JOA) is a  metaheuristic algorithm  based on joint operations strategy in military theory, which incorporates three core operations – offensive, defensive and regroup – and has excellent performance in global  optimization problems . To enhance the  optimization performance  of the original JOA, we re-examine the positioning of the three core operations in balancing global exploration and local exploitation, and propose a hierarchical structure-based JOA variant (abbreviated as HSJOA) by adjusting their execution mechanism. In addition, we redesign the three core operations to give full play to their  synergy effect . In the new offensive operations, we simplify its specific execution strategy, but introduce an adjustment parameter to retain valuable  position information . In the modified defensive operations, we integrate the influence of officer and elite comrades on soldiers to design a Gaussian distribution-based conservative defensive strategy and one Cauchy distribution-based aggressive defensive strategy. In the novel regroup operations, we replace the original random division strategy with a sorting-based division scheme. To evaluate the optimization performance of HSJOA, we conduct comparison experiments using nine excellent algorithms to deal with four real-life optimization problems and thirty test functions from IEEE CEC 2014  testbed . The comparison results show that the overall optimization performance of HSJOA is significantly better than the original JOA, the outstanding variants (TAPSO and GODE) of two well-known algorithms and four recently proposed algorithms (EO,  SOA , MPA and WOA), while inferior to two winners of IEEE CEC competition (L-SHADE and EBOwithCMAR), but HSJOA clearly outperforms L-SHADE and EBOwithCMAR in terms of the runtime consumption.",
    "citation_count": "24",
    "year": "2023/06/01",
    "authors": [
        {
            "name": "Gaoji Sun",
            "country": ""
        },
        {
            "name": "Rongqing Han",
            "country": ""
        },
        {
            "name": "Libao Deng",
            "country": ""
        },
        {
            "name": "Chunlei Li",
            "country": ""
        },
        {
            "name": "Guoqing Yang",
            "country": ""
        }
    ],
    "keywords": []
}