{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650215000292",
    "title": "Hybridizing genetic algorithm with differential evolution for solving the unit commitment scheduling problem",
    "abstract": "This paper proposes a hybrid of  genetic algorithm  (GA) and differential evolution (DE), termed hGADE, to solve one of the most important  power system   optimization problems  known as the  unit commitment  (UC) scheduling. The UC problem is a nonlinear mixed-integer combinatorial high-dimensional and highly  constrained optimization  problem consisting of both binary UC variables and continuous power dispatch variables. Although GA is more capable of efficiently handling binary variables, the performance of DE is more remarkable in real parameter optimization. Thus, in the proposed algorithm hGADE, the binary UC variables are evolved using GA while the continuous power dispatch variables are evolved using DE. Two different variants of hGADE are presented by hybridizing GA with two classical variants of  DE algorithm . Additionally, in this paper a problem specific heuristic initial population generation method and a replacement strategy based on preservation of infeasible solutions in the population are incorporated to enhance the search capability of the hybridized variants on the UC problem. The scalability of the proposed algorithm hGADE is demonstrated by testing on systems with generating units in the range of 10 up to 100 in one-day  scheduling period  and the simulation results demonstrate that hGADE algorithm can provide a system operator with remarkable cost savings as compared to the best approaches in the literature. Finally, an ensemble optimizer based on combination of hGADE variants is implemented to further amplify the performance of the presented algorithm.",
    "citation_count": "107",
    "year": "2015/08/01",
    "authors": [
        {
            "name": "Anupam Trivedi",
            "country": ""
        },
        {
            "name": "Dipti Srinivasan",
            "country": ""
        },
        {
            "name": "Subhodip Biswas",
            "country": ""
        },
        {
            "name": "Thomas Reindl",
            "country": ""
        }
    ],
    "keywords": []
}