{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000961",
    "title": "Hyper-Heuristics to customise metaheuristics for continuous optimisation",
    "abstract": "Literature is prolific with metaheuristics for solving continuous optimisation problems. But, in practice, it is difficult to choose one appropriately for several reasons. First and foremost, ‘new’ metaheuristics are being proposed at an alarmingly fast rate, rendering impossible to know them all. Moreover, it is necessary to determine a good enough set of parameters for the selected approach. Hence, this work proposes a strategy based on a hyper-heuristic  model powered  by Simulated Annealing for customising population-based metaheuristics. Our approach considers search operators from 10 well-known techniques as building blocks for new ones. We test this strategy on 107 continuous benchmark functions and in up to 50 dimensions. Besides, we analyse the performance of our approach under different experimental conditions. The resulting data reveal that it is possible to obtain good-performing metaheuristics with diverse configurations for each case of study and in an automatic fashion. In this way, we validate the potential of the proposed framework for devising metaheuristics that solve continuous optimisation problems with different characteristics, similar to those from practical engineering scenarios.",
    "citation_count": "51",
    "year": "2021/10/01",
    "authors": [
        {
            "name": "Jorge M. Cruz-Duarte",
            "country": ""
        },
        {
            "name": "Ivan Amaya",
            "country": ""
        },
        {
            "name": "José C. Ortiz-Bayliss",
            "country": ""
        },
        {
            "name": "Santiago E. Conant-Pablos",
            "country": ""
        },
        {
            "name": "Hugo Terashima-Marín",
            "country": ""
        },
        {
            "name": "Yong Shi",
            "country": ""
        }
    ],
    "keywords": []
}