{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219300410",
    "title": "Improved Self-adaptive Search Equation-based Artificial Bee Colony Algorithm with competitive local search strategy",
    "abstract": "The search equations and the  local search  procedures used in  Artificial Bee Colony  (ABC) algorithm are two key components that affect the performance of the algorithm. However, there is no search equation or local search that provides good results for all problem types. In this article, an ABC algorithm called “Self-adaptive Search Equation-based Artificial Bee Colony” (SSEABC) is proposed which can determine the appropriate local search procedure and the search equation internally during execution. SSEABC integrates three strategies into the canonical ABC algorithm. The first strategy is a self-adaptive strategy that determines the appropriate search equations for a particular problem by eliminating improper ones from a pool consisting of randomly generated search equations. The second strategy is a competitive local search selection. It decides the most effective local search procedure by comparing the performances of SSEABC, Mtsls1 and IPOP-CMA-ES. The third strategy is an incremental  population size  strategy, which is based on adding new food sources located around the best-so-far food source position after a predefined number of iterations. This helps to increase convergence speed. The SSEABC algorithm is tested on  benchmark functions  proposed in the CEC'14 abd CEC'17 competition on single objective bound constrained real-parameter  numerical optimization . SSEABC is compared with several ABC variants, competitor algorithms of CEC'14 and CEC'17, and several state-of-the-art algorithms. Finally, we applied SSEABC to the  infinite impulse response  (IIR)  system identification problem  as an  engineering application . The results showed the superiority of the SSEABC algorithm.",
    "citation_count": "23",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Gürcan Yavuz",
            "country": ""
        },
        {
            "name": "Doğan Aydın",
            "country": ""
        }
    ],
    "keywords": []
}