{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021630181X",
    "title": "Integrated frequency and power control of an isolated hybrid power system considering scaling factor based fuzzy classical controller",
    "abstract": "This paper describes an application of quasi-oppositional harmony search (QOHS) algorithm to design the scaling factor (SF) based fuzzy-classical controller (such as PI/PD/PID) for frequency and power control of an isolated hybrid  power system  (IHPS). The considered IHPS model is comprised of a wind  turbine generator , a  diesel engine  generator and an energy  storage device  (such as superconducting  magnetic energy storage  (SMES), in this case). Traditionally, SF, membership functions and control rules are obtained in  fuzzy logic controllers  (FLCs) by trial and error method or are obtained based on the experiences of the designers or are optimized by some traditional optimization techniques with some extra computational cost. To overcome all these problems of FLCs, classical controllers have been integrated in this paper with the FLC. QOHS algorithm is applied to simultaneously tune the SFs (the only tunable parameter of FLC), the gains of the classical controllers and the tunable parameters of the SMES device to minimize frequency and power deviations of the studied IHPS system against various load demand and wind change. Different considered controller configurations of the IHPS are SF based FLC (termed as Fuzzy-only), SF based FLC with proportional-integral (PI) (named as Fuzzy-PI) controller, SF based FLC with proportional-derivative (PD) (abbreviated as Fuzzy-PD) controller and SF based FLC with proportional-integral-derivative (PID) (designated as Fuzzy-PID) controller. Simulation results, explicitly, show that the performance of the Fuzzy-PID controller based IHPS is superior to Fuzzy-only, Fuzzy-PI and Fuzzy-PD controller based IHPS configuration in terms of overshoot, settling time and the proposed Fuzzy-PID controller is robust against various wide range of load changes.",
    "citation_count": "37",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Somnath Ganguly",
            "country": ""
        },
        {
            "name": "Tarkeshwar Mahto",
            "country": ""
        },
        {
            "name": "V. Mukherjee",
            "country": ""
        }
    ],
    "keywords": []
}