{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000288",
    "title": "Interval many-objective evolutionary algorithm guided by dynamic dual-sequence mechanism",
    "abstract": "Interval many-objective evolutionary algorithms (IMaOEAs) have received significant achievements in recent years. However, it is difficult for the algorithm to quickly select good interval individuals since the uncertainty affects the definition of interval dominance relations. To further reduce the computational burden of uncertainty on the interval optimization process, this paper proposes a dual-sequence mechanism-guided interval many-objective evolutionary algorithm. First, the interval binary R2 evaluation indicator IR2 was designed, which can effectively evaluate the convergence and diversity of interval individuals. Second, an uncertainty dominance relation for interval individuals is proposed and uncertainty is quantified using the weighted LP norm (WLP). Finally, the dynamic dual-sequence (DDS) mechanism was ultimately employed to retain the most exceptional individuals within the population, while simultaneously eliminating those with subpar performance in terms of convergence, diversity, and uncertainty. To extensively evaluate the performance of the proposed approach, 16 benchmark problems were used as the test suite. The experimental results demonstrate that the approach outperforms five advanced interval many-objective evolutionary algorithms, showcasing its superior performance and competitiveness.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Xingjuan Cai",
            "country": ""
        },
        {
            "name": "Jinli Li",
            "country": ""
        },
        {
            "name": "Jinlong Ma",
            "country": ""
        },
        {
            "name": "Zhixia Zhang",
            "country": ""
        },
        {
            "name": "Qingyuan Xu",
            "country": ""
        },
        {
            "name": "Wensheng Zhang",
            "country": ""
        },
        {
            "name": "Jinjun Chen",
            "country": ""
        }
    ],
    "keywords": []
}