{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650215000735",
    "title": "Investigations of a GPU-based levy-firefly algorithm for constrained optimization of radiation therapy treatment planning",
    "abstract": "Intensity modulated  radiation therapy  (IMRT) affords the potential to decrease  radiation therapy  associated toxicity by creating highly conformal  dose distribution  to tumor. Inverse optimization of IMRT treatment plans is often a time intensive task due to the large scale  solution space , and the indubitably complexity of the task. Furthermore, the incorporation of conflicting dose constraints in the treatment plan, usually introduces an additional degree of intricacy.  Metaheuristic algorithms  have been proposed in the past for global optimization in IMRT treatment planning. However one disadvantage of the aforementioned methods is their extensive computational cost. One way to ameliorate their performance deficiency is to parallelize the application. In the current study we propose a GPU-based levy-firefly algorithm (LFA) for  constrained optimization  of IMRT treatment planning. The evaluation of our method was realized for two treatment cases: a prostate and a head and neck (H&N) cancer IMRT plans. The studies indicated an ascendable increase of the speedup factor as a function of the number of pencil beams with a maximum of ~11, whereas the performance of the algorithm was decreasing as a function of the population of the  swarm particles . In addition, from our simulation results we concluded that 200 fireflies were sufficient for the algorithm to converge in less than 80 iterations. Finally, we demonstrated the effect of penalizing factors on constraining the  maximum dose  at the organs at risk (OAR) by impeding the dose coverage of the tumor target. The impetus behind our study was to elucidate the performance and generic attributes of the proposed algorithm, as well as the potential of its applicability for IMRT  optimization problems .",
    "citation_count": "30",
    "year": "2016/02/01",
    "authors": [
        {
            "name": "Georgios Kalantzis",
            "country": ""
        },
        {
            "name": "Charles Shang",
            "country": ""
        },
        {
            "name": "Yu Lei",
            "country": ""
        },
        {
            "name": "Theodora Leventouri",
            "country": ""
        }
    ],
    "keywords": []
}