{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001913",
    "title": "IOT device type identification using magnetized Hopfield neural network with tuna swarm optimization algorithm",
    "abstract": "Internet of Things (IoT) networks consist of physical devices connected to the Internet, embedded with actuators, sensors, and communication components that exchange data. To enhance IoT security, accurately identifying and assessing the safety of connected devices is essential. To improve IoT security, this research proposes the IoT Device Type Identification utilizing Memristor-based Magnetized Hopfield Neural Network with Tuna Swarm Optimization Algorithm (IOT-DTI-MHNN-TSOA). It includes data collection, feature extraction, IoT device type identification. In data collection, an actual network traffic dataset amassed through 10 various IoT device categories is used. In the feature extraction phase, optimal features such as TCP packets' time-to-live by server, packets' inter-arrival time by client, packets' inter-arrival time by server, TCP packets' time-to-live by client, packets' inter-arrival time, packet size, number of bytes sent and received, packet size by client, and total number of packets are extracted using a 2-Dimensional Flexible Analytic Wavelet Transform (2D-FAWT). These extracting features are provided to the IoT device type identification phase. In this phase, a Memristor-based Magnetized Hopfield Neural Network (MHNN) method is employed to perceive the categories of IoT device as known/seen or unknown/unseen categories. The Tuna Swarm Optimization Algorithm (TSOA) enhances the weight parameters of MHNN. The efficacy of the IOT-DTI-MHNN-TSOA classification framework is assessed using performance metrics, like precision, accuracy, F1-score, sensitivity, specificity, error rate, computational time, ROC, Computational Complexity. The IOT-DTI-MHNN-TSOA method provides higher accuracy of 99.97 %, higher sensitivity of 99.95 %, and higher precision of 99.92 % compared to the existing models.",
    "citation_count": "1",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Muthukrishnan A",
            "country": ""
        },
        {
            "name": "Kamalesh S",
            "country": ""
        }
    ],
    "keywords": []
}