{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000884",
    "title": "Learning-infused optimization for evolutionary computation",
    "abstract": "Evolutionary computation is a class of meta-heuristic algorithm that mimics the process of biological evolution, utilizing information exchange among individuals in the population to iteratively search for optimal solutions. During the evolutionary process, a substantial amount of data is generated, from which valuable evolutionary information can be extracted to assist the algorithm to evolve in a more effective direction. Additionally, neural networks excel at extracting knowledge from data. Motivated by this, we propose a learning-infused optimization (LIO) framework that employs neural networks to learn the evolutionary processes of the algorithms and extract synthesis patterns from the valuable evolutionary information. These synthesis patterns possess excellent generalizability and effectiveness, guiding the algorithm towards better solutions on the original problems and enabling transfer evolution ability, which can improve the performance of the algorithm on new problems. The LIO framework is applied to various algorithms. Experimental results demonstrate that the synthesis patterns extracted from the CEC14 problems not only guide the evolution of the algorithms towards better solutions on the original problems, but also significantly improve the performance of the algorithms on the CEC17 problems.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Kun Bian",
            "country": ""
        },
        {
            "name": "Juntao Zhang",
            "country": ""
        },
        {
            "name": "Hong Han",
            "country": ""
        },
        {
            "name": "Jun Zhou",
            "country": ""
        },
        {
            "name": "Yifei Sun",
            "country": ""
        },
        {
            "name": "Shi Cheng",
            "country": ""
        }
    ],
    "keywords": []
}