{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224003018",
    "title": "Learning-guided cross-sampling for large-scale evolutionary multi-objective optimization",
    "abstract": "When tackling large-scale multi-objective problems (LSMOPs), the computational budget could be wasted by traditional offspring generators that explore the search space in a nearly directionless manner, impairing the efficiency of many existing algorithms. To address this issue, this paper proposes a novel two-level large-scale multi-objective evolutionary algorithm called LMOEA-LGCS that incorporates neural network (NN) learning-guided cross-sampling for offspring generation in the first level and a layered competitive swarm optimizer in the second level. Specifically, in the first level, two NNs are trained online to learn promising vertical and horizontal search directions, respectively, against the Pareto Set, and then a batch of candidate solutions are sampled on the learned directions. The merit of learning two explicit search directions is to devote the employed NNs to concentrating on separate or even conflicting targets, i.e., the convergence and diversity of the population, thus achieving a good trade-off between them. In this way, the algorithm can thus explore adaptively towards more promising search directions that have the potential to facilitate the convergence of the population while maintaining a good diversity. In the second level, the layered competitive swarm optimizer is employed to perform a deeper optimization of the solutions generated in the first level across the entire search space to increase their diversity further. Comparisons with six state-of-the-art algorithms on three LSMOP benchmarks, i.e., the LSMOP, UF, and IMF, with 2-12 objectives and 500-8000 decision variables, and the real-world problem TREE demonstrate the advantages of the proposed algorithm.",
    "citation_count": "0",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Haofan Wang",
            "country": ""
        },
        {
            "name": "Li Chen",
            "country": ""
        },
        {
            "name": "Xingxing Hao",
            "country": ""
        },
        {
            "name": "Rong Qu",
            "country": ""
        },
        {
            "name": "Wei Zhou",
            "country": ""
        },
        {
            "name": "Dekui Wang",
            "country": ""
        },
        {
            "name": "Wei Liu",
            "country": ""
        }
    ],
    "keywords": []
}