{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001705",
    "title": "Memetic algorithm based on learning and decomposition for multiobjective flexible job shop scheduling considering human factors",
    "abstract": "Human factors , including worker flexibility and learning–forgetting effects, are crucial factors in modern  manufacturing systems  to reduce costs and improve efficiency. However, traditional flexible  job shop scheduling problem  (FJSP) only considers machine flexibility and ignores human factors. Therefore, this paper originally investigates a multi-objective FJSP considering human factors (MO-FJSPHF) to simultaneously minimize makespan, maximum machine workload, and total machine workload. Firstly, a multi-objective mixed-integer  nonlinear programming  (MINLP) model is established based on the characteristics of the MO-FJSPHF. Then, a multi-objective  memetic algorithm  based on learning and decomposition (MOMA-LD) is proposed to solve the model by incorporating the learning-based adaptive  local search  into the multi-objective  evolutionary algorithm  based on decomposition (MOEA/D). In MOMA-LD, the  machine learning technique  determines which solutions deserve to perform the local search. Meanwhile, the  computational resources  are allocated dynamically based on the degree of population  convergency  during the evolutionary process. Experimental results show that our proposed algorithm outperforms four state-of-the-art algorithms on forty-three test instances and three real-world cases from a casting workshop. The validity of the proposed MINLP model is examined by the exact solver Gurobi.",
    "citation_count": "27",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Hangyu Lou",
            "country": ""
        },
        {
            "name": "Xianpeng Wang",
            "country": ""
        },
        {
            "name": "Zhiming Dong",
            "country": ""
        },
        {
            "name": "Yang Yang",
            "country": ""
        }
    ],
    "keywords": []
}