{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218308460",
    "title": "Model and metaheuristics for robotic two-sided assembly line balancing problems with setup times",
    "abstract": "Two-sided  robotic assembly  lines are employed to assemble large-sized high-volume products, where robots are allocated to the workstations to perform the tasks and human workers are replaced for achieving lower cost and greater flexibility in production. In the two-sided robotic assembly lines, setup times are unavoidable and it has been ignored in most of the reported works. There has been limited attention on this till date. This paper focusses on the robotic two-sided assembly line with consideration of sequence-dependent setup times and robot setup times. A new  mixed integer linear programming model  is developed with the objective of optimizing the cycle time. Due to the NP-hard nature of the considered problem, this paper proposes a set of metaheuristics to solve this considered problem, where two main scenarios with low and high setup time’s variability are considered. Computational results verify that this new model is capable to achieve the optimal solutions for small-size instances whereas the simple adoption of the published mathematical model might produce wrong solutions for the considered problem. A comprehensive study with 13 algorithms demonstrates that the two variants of artificial bee colony algorithm and migrating bird optimization algorithm are capable to achieve the  optimality  for small-size instances and to obtain promising results for large-size instances.",
    "citation_count": "41",
    "year": "2019/11/01",
    "authors": [
        {
            "name": "Zixiang Li",
            "country": ""
        },
        {
            "name": "Mukund Nilakantan Janardhanan",
            "country": ""
        },
        {
            "name": "Qiuhua Tang",
            "country": ""
        },
        {
            "name": "S.G. Ponnambalam",
            "country": ""
        }
    ],
    "keywords": []
}