{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000331",
    "title": "Multi-objective genetic programming based on decomposition for feature learning in image classification",
    "abstract": "Image classification presents a challenge due to its high dimensionality and extensive variations. Feature learning is a powerful method in addressing this challenge, constituting a multi-objective problem aimed at maximizing classification accuracy and minimizing the number of learned features. A few multi-objective genetic programming (MOGP) methods have been proposed to optimize these two objectives, simultaneously. However, existing MOGP methods ignore the characteristics of feature learning tasks. Therefore, this work proposes a decomposition-based MOGP approach with a global replacement strategy for feature learning in data-efficient image classification. To handle the different value ranges of the two objectives, a transformation function is designed to uniform the range of the number of learned features. In addition, a preference-based decomposition strategy is proposed to address the preference for the objective of classification accuracy. The proposed approach is compared with existing MOGP methods for feature learning on five different image classification datasets with different numbers of training images. The experimental results demonstrate the effectiveness of the proposed approach by achieving better HVs than or comparable to the existing MOGP methods in at least 13 out of 20 cases and classification accuracy significantly better than a popular neural architecture search method in all cases.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Tuo Zhang",
            "country": ""
        },
        {
            "name": "Ying Bi",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Bing Xue",
            "country": ""
        },
        {
            "name": "Mengjie Zhang",
            "country": ""
        }
    ],
    "keywords": []
}