{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001524",
    "title": "Multiobjective band selection approach via an adaptive particle swarm optimizer for remote sensing hyperspectral images",
    "abstract": "Band selection (BS) is an important technique in  remote sensing  hyperspectral image (HSI) classification that captures informative bands and removes redundant bands, thereby reducing the computational overhead of the model and improving classification performance. Recently, evolutionary algorithm (EA) with good search capability has been successfully extended as an efficient BS method for processing HSIs. However, most of the existing EA-based BS methods still face following challenges: 1) Most of them are designed based on a single search strategy, which may not be sufficient to find the promising subset of bands and tend to fall into the local optimum; 2) Most of them ignore the problem of potential duplicate bands existing in the solution vectors, which leads to some performance degradation. To address these issues, this paper proposes an effective unsupervised multiobjective BS approach through an adaptive particle swarm optimizer (PSO), called APSO-BS. First, a new robust unsupervised multiobjective BS model is designed, which applies information entropy to measure the amount of information contained in bands and uses the structural similarity measure to evaluate the correlation among bands. Second, to effectively solve the multiobjective BS model constructed above, an adaptive particle swarm optimizer is proposed, which first applies a pre-scoring mechanism to estimate the evolutionary states (i.e., diversity and convergence degree) of particles, and then adaptively selects different PSO search strategies for different particles according to their corresponding evolutionary states. In addition, a self-repair mechanism is designed to correct the violating individuals with duplicate bands. Therefore, our proposed method can reasonably address the two major challenges mentioned above. Finally, to evaluate the performance of APSO-BS, four common  HSI  datasets are adopted in our experiments, and extensive results under three different classifiers show that our proposed APSO-BS outperforms several state-of-the-art BS methods.",
    "citation_count": "4",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Yuze Zhang",
            "country": ""
        },
        {
            "name": "Qiuzhen Lin",
            "country": ""
        },
        {
            "name": "Lingjie Li",
            "country": ""
        },
        {
            "name": "Zhijiao Xiao",
            "country": ""
        },
        {
            "name": "Zhong Ming",
            "country": ""
        },
        {
            "name": "Victor C.M. Leung",
            "country": ""
        }
    ],
    "keywords": []
}