{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002360",
    "title": "Multi-population genetic algorithm with crowding-based local search for fuzzy multi-objective supply chain configuration",
    "abstract": "Supply chain configuration is often fuzzy and involves multiple objectives in real-world scenarios, but existing researches lack the exploration in the fuzzy aspect. Therefore, this paper establishes a fuzzy multi-objective supply chain configuration problem model to minimize the lead time and product cost oriented towards real supply chain environments. To solve the fuzzy problem, the theories of membership and closeness degree in fuzzy mathematics are adopted, and a multi-population genetic algorithm (MPGA) with crowding-based local search method is proposed. The MPGA algorithm uses two populations for optimizing the two objectives separately and effectively, and is characterized by three main innovative aspects. Firstly, a radical-and-radial selection operator is designed to balance the convergence speed and diversity of population. In the early stage of the algorithm, two populations are both optimized towards the ideal knee point, and then are separately optimized towards the two ends of the Pareto front (PF). Secondly, an elitist crossover operator is devised to promote information exchange within two populations. Thirdly, a crowding-based local search is proposed to speed up convergence by improving the crowded solutions, and to enhance diversity by obtaining new solutions around the uncrowded ones. Comprehensive experiments are tested on a fuzzy dataset with different sizes, and the integral of the hypervolume of PF is used for the evaluation of the fuzzy PF. The results show that MPGA achieves the best performance over other comparative algorithms, especially on maximum spread metric, outperforming all others by an average of 39 % across all test instances.",
    "citation_count": "2",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Xin Zhang",
            "country": ""
        },
        {
            "name": "Shaopeng Sun",
            "country": ""
        },
        {
            "name": "Jian Yao",
            "country": ""
        },
        {
            "name": "Wei Fang",
            "country": ""
        },
        {
            "name": "Pengjiang Qian",
            "country": ""
        }
    ],
    "keywords": []
}