{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021100068X",
    "title": "Multi-objective planning of electrical distribution systems incorporating sectionalizing switches and tie-lines using particle swarm optimization",
    "abstract": "A multi-objective planning approach for electrical distribution systems using  particle swarm optimization  is presented in this paper. In this planning, the number of feeders and their routes, number and locations of sectionalizing switches, and number and locations of tie-lines of a distribution system are optimized. The multiple objectives to determine optimal values for these planning variables are: (i) minimization of total installation and operational cost and (ii) maximization of network reliability. The planning optimization is performed in two steps. In the first step, the  distribution network  structure, i.e., number of feeders, their routes, and number and locations of sectionalizing switches are determined. In the second step, the optimum number and locations of tie-lines are determined. Both the objectives are minimized simultaneously to obtain a set of non-dominated solutions in the first step of optimization. The solution strategy used for the first step optimization is the  Strength  Pareto Evolutionary Algorithm-2 (SPEA2) based multi-objective particle swarm optimization (SPEA2–MOPSO). In the second step, the solutions/networks obtained from the previous step are further optimized by placement of tie-lines. SPEA2-based binary MOPSO (SPEA2–BMOPSO) is used in the second step of optimization. The proposed planning algorithm is tested and evaluated on different practical distribution systems.",
    "citation_count": "93",
    "year": "2012/04/01",
    "authors": [
        {
            "name": "N.C. Sahoo",
            "country": ""
        },
        {
            "name": "S. Ganguly",
            "country": ""
        },
        {
            "name": "D. Das",
            "country": ""
        }
    ],
    "keywords": []
}