{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002298",
    "title": "Multi-operator opposition-based learning with the neighborhood structure for numerical optimization problems and its applications",
    "abstract": "Opposition-based learning (OBL) is an effective strategy that adjusts the population to accelerate the convergence of the algorithm. However, OBL involves two phases (generation and calculation) that are seldom mentioned simultaneously. Besides, individual information in OBL is not fully used to guide evolution. First, a novel neighborhood generation strategy is proposed to fully use individual information. There are numerous variants of the neighborhood structure. Three prominent neighborhood structures are designed to demonstrate their benefits in various dimensions. Second, a multi-operator calculation method with two distributions is introduced to reach the equilibrium between diversification and intensification. Consequently, this paper proposes three multi-operator neighborhood-based OBL variants (MNOBLs). Compared with the traditional OBL variants, MNOBLs generate the opposite population by using a neighborhood of the individuals. A well-balanced calculation method can lead to good convergence  behavior . Subsequently, the proposed MNOBLs are embedded into the basic differential evolution (DE) algorithm to obtain the proposed algorithms. The extensive and rigorous numerical experiments are designed at three levels: strategies, algorithms, and functions. Specifically, the effectiveness and efficiency of the proposed algorithms are verified by comparing them with 13 state-of-the-art DE variants and four metaheuristics on the CEC 2017, and CEC 2022 test suites, and two real-world optimization problems. The comprehensive results show that the proposed OBL variants provide promising results for most problems.",
    "citation_count": "12",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Jiahang Li",
            "country": ""
        },
        {
            "name": "Liang Gao",
            "country": ""
        },
        {
            "name": "Xinyu Li",
            "country": ""
        }
    ],
    "keywords": []
}