{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002037",
    "title": "Multi-objective evolutionary multi-tasking band selection algorithm for hyperspectral image classification",
    "abstract": "Hyperspectral images (HSI) contain a great number of bands, which enable better characterization of features. However, the huge dimension and information volume brought by the abundant bands may give rise to a negative influence on the efficiency of subsequent processing on hyperspectral images. Band selection (BS) is a commonly adopted to reduce the dimension of HSIs. Different from the previous work, in this paper, hyperspectral band selection problem is formulated as a multi-objective optimization problem, where the band distribution uniformity among the selected bands and inter-class separation distance from a few labeled samples are optimized simultaneously. To fully exploit the relation between the band subsets with different sizes, we construct a multi-objective evolutionary multi-tasking algorithm for hyperspectral band selection (namely MEMT-HBS) to achieve the selected band subsets for all the selected band sizes in one run. To implement MEMT-HBS, the intra-task pairwise learning based solution generation strategy is suggested to evolve the population for each task to achieve high-quality offspring whose selected band size is restricted to a fixed scope. The inter-task band coverage based knowledge transferring strategy is utilized to choose useful individuals from adjacent tasks to further enhance the performance of current task. Compared with the state-of-the-art semi-supervised and unsupervised BS algorithms, empirical results on different standard hyperspectral datasets show that our proposed MEMT-HBS can determine the superior band subset which has a higher image classification accuracy over the comparison algorithms.",
    "citation_count": "2",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Qijun Wang",
            "country": ""
        },
        {
            "name": "Yong Liu",
            "country": ""
        },
        {
            "name": "Ke Xu",
            "country": ""
        },
        {
            "name": "Yanni Dong",
            "country": ""
        },
        {
            "name": "Fan Cheng",
            "country": ""
        },
        {
            "name": "Ye Tian",
            "country": ""
        },
        {
            "name": "Bo Du",
            "country": ""
        },
        {
            "name": "Xingyi Zhang",
            "country": ""
        }
    ],
    "keywords": []
}