{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000178",
    "title": "Multi-objective migrating birds optimization for solving stochastic home health care routing and scheduling problems considering caregiver working time constraints",
    "abstract": "Currently, many countries are suffering from a heavy burden caused by  population aging  since the elderly occupy a large number of medical resources.  Home health care  (HHC) is a prospective approach to relieve and cope with this issue. This study addresses a multi-objective HHC routing and scheduling problem (HHCRSP) considering uncertainties and caregivers’ working time balance. First, a stochastic programming method is employed to formulate the uncertain service time and travel time, and then a chance-constrained programming model is developed to minimize the total operation cost and penalty cost of violating allowable time windows. Second, a multi-objective migrating birds optimization incorporating a  stochastic simulation  method is proposed. An ensemble of population iteration and external archive search is designed to obtain high-quality solutions. A stochastic simulation strategy is devised to evaluate the feasibility of obtained solutions and calculate their objective values. At last, numerical experiments are implemented for solving an extending benchmark set. The comparisons and discussions verify the better performance of the proposed algorithm compared with its peers.",
    "citation_count": "5",
    "year": "2024/03/01",
    "authors": [
        {
            "name": "Yaping Fu",
            "country": ""
        },
        {
            "name": "Xiaomeng Ma",
            "country": ""
        },
        {
            "name": "Kaizhou Gao",
            "country": ""
        },
        {
            "name": "Hongfeng Wang",
            "country": ""
        },
        {
            "name": "Ali Sadollah",
            "country": ""
        },
        {
            "name": "L.Y. Chen",
            "country": ""
        }
    ],
    "keywords": []
}