{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222000499",
    "title": "Multi-objective evolutionary algorithm based on decomposition with an external archive and local-neighborhood based adaptation of weights",
    "abstract": "Multi-objective evolutionary algorithms (MOEAs) present an interesting approach to solve multi-objective problems (MOPs). Moreover, studies on MOEAs with decomposition approaches have been rapidly growing and many have demonstrated that the distribution of  weight vectors  plays a key role in obtaining a uniform set of solutions. However, a uniform distribution of weight vectors at the beginning of the evolution may not always result in a uniform set of solutions in the objective space, as the results are highly dependent on the Pareto front shape. Pareto fronts with irregular shape (disconnected, inverted, etc.), are usually not present in all parts of the initial set of weight vectors and one approach to overcome this issue is to adapt the weight vectors to the shape of the Pareto front. To remedy this problem and contribute with the field of study, it is proposed an algorithm based on decomposition that adapts progressively its weight vectors during the evolution process. The algorithm is called Multi-objective Evolutionary Algorithm based on Decomposition with Local-Neighborhood Adaptation (MOEA/D-LNA). To better evaluate the adaptation of weight vectors, a set of benchmark functions with irregular characteristics is proposed through the Generalized Position-Distance (GPD) benchmark generator. Thereafter, the proposed algorithm is compared against other algorithms in the literature on three additional sets of benchmark functions and with two different procedures for the initialization of weight vectors. The experiments have shown promising results on irregular Pareto fronts, specially for disconnected and inverted ones.",
    "citation_count": "14",
    "year": "2022/06/01",
    "authors": [
        {
            "name": "Paulo Pinheiro Junqueira",
            "country": ""
        },
        {
            "name": "Ivan Reinaldo Meneghini",
            "country": ""
        },
        {
            "name": "Frederico Gadelha Guimarães",
            "country": ""
        }
    ],
    "keywords": []
}