{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000081",
    "title": "Multi-objective planning of electric vehicles charging in distribution system considering priority-based vehicle-to-grid scheduling",
    "abstract": "In this paper, a priority-based Vehicle to Grid (V2G) optimization scheduling, considering their interaction with the distribution systems, has been proposed to minimise the load-variance of the load profile. In addition, two new indices, active power loss reduction index ( PLR ) and reactive power loss reduction index ( QLR ), have also been mathematically formulated. The developed indices, based on system's active and reactive power, guarantees the best quality of electrical supply to the load terminals. The Most Valuable Player (MVP) algorithm along with various Electrical Vehicle (EV) constraints, has been considered in this work to obtain the minimum values of load variance,  PLR  and  QLR . Further, the results, as achieved through the proposed method, are compared with the other existing approaches to reveal its effectiveness and accuracy. The statistical analysis also supports the superiority of the MVP algorithm. Furthermore, parametric case studies are also done to declare the optimal results. It is shown that the proposed method with the developed indices provide the best quality of electrical supply to the load terminals. Finally, an optimisation model combining ‘load-variance’, ‘ PLR ’, and ‘ QLR ’ as a multi-objective planning problem has been presented. This developed model can obtain the non-dominated solutions to reach the final EVs planning schedule, thus achieving a more realistic and better solution than the existing approaches. The results are validated on a standard IEEE 69-bus radial distribution system.",
    "citation_count": "27",
    "year": "2023/03/01",
    "authors": [
        {
            "name": "Praveen Prakash Singh",
            "country": ""
        },
        {
            "name": "Soumyabrata Das",
            "country": ""
        },
        {
            "name": "Fushuan Wen",
            "country": ""
        },
        {
            "name": "Ivo Palu",
            "country": ""
        },
        {
            "name": "Asheesh K. Singh",
            "country": ""
        },
        {
            "name": "Padmanabh Thakur",
            "country": ""
        }
    ],
    "keywords": []
}