{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001110",
    "title": "Multi-objective interval portfolio optimization modeling and solving for margin trading",
    "abstract": "Margin trading is an important part of stock market. Compared with traditional channel business, it brings excess profits to both  financial institutions  and investors. As an important  optimization problem  in the field of  finance , portfolio optimization with the purpose of spreading risks and improving returns is the essence of margin trading. In this paper, aiming at achieving the portfolio optimization for multi-period margin trading, we propose a multi-objective interval portfolio optimization method, including model construction and optimization. Based on real business rules, the process of model construction consists of three steps. First, an interval estimation method of securities’ returns and risks is designed according to market feedback to keep portfolios remaining robust under the market fluctuation. Second, a multi-objective problem of maximizing return and minimizing risk is constructed to seek portfolios with balanced risks and returns. Third, a rolling investment mechanism is formed based on the portfolio’s actual return of each period to maintain effective continuous investment. For the model optimization, a multi-objective interval optimization  evolutionary algorithm  with knee based decision-making is developed. It obtains knee solutions for different risk segments to meet the investment needs of investors with different  risk preferences , so that their investment decisions do not need to rely on quantitative expression of their preferences. Furthermore, adapting to the interval model, an interval optimization method is developed to enhance the robustness of knee points. Experimental results on several benchmark problems and the real portfolio optimization problem demonstrate the superiority of the proposed model and algorithm.",
    "citation_count": "10",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Quying He",
            "country": ""
        },
        {
            "name": "Zhenan He",
            "country": ""
        },
        {
            "name": "Suling Duan",
            "country": ""
        },
        {
            "name": "Yuyanzhen Zhong",
            "country": ""
        }
    ],
    "keywords": []
}