{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001846",
    "title": "Multi-objective optimization algorithm for multi-workflow computation offloading in resource-limited IIoT",
    "abstract": "Industrial  internet of things  (IIoT) connects traditional industrial devices with the network to provide intelligent services, which is regarded as the key technology for achieving  Industry 4.0  and enabling the transformation of the  manufacturing sector . Multi-access edge computing (MEC) has brought significant opportunities to expedite the development of IIoT. However, the unique task characteristics and dense deployment of  IIoT devices , coupled with the resource starvation problem (RSP) arising from the limited resources of edge servers, pose challenges to the direct applicability of existing MEC algorithms in MEC-assisted IIoT scenarios. To this end, a multi-objective evolutionary algorithm is proposed to simultaneously optimize delay and energy consumption for multi-workflow execution in resource-limited IIoT. First, the initialization of execution location based on delay and the initialization of execution order satisfying the priority constraint can generate high-quality initial solutions. Then, the improved crossover and mutation operations guide the population evolution, which can span the large infeasible solution region. Finally, dynamic  task scheduling  (DTS) dynamically changes the execution location of tasks affected by RSP according to the execution efficiency, so as to avoid the tasks blindly waiting for server resources. The comprehensive simulation results demonstrate the effectiveness of the proposed method in achieving a balance between the execution delay and energy consumption of IIoT devices.",
    "citation_count": "2",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Bao-Shan Sun",
            "country": ""
        },
        {
            "name": "Hao Huang",
            "country": ""
        },
        {
            "name": "Zheng-Yi Chai",
            "country": ""
        },
        {
            "name": "Ying-Jie Zhao",
            "country": ""
        },
        {
            "name": "Hong-Shen Kang",
            "country": ""
        }
    ],
    "keywords": []
}