{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217302900",
    "title": "Multi objective evolutionary algorithm for designing energy efficient distribution transformers",
    "abstract": "This paper has solved the transformer design optimization problem using Multi-Objective Evolutionary Algorithms based on Decomposition with Dynamical  Resource Allocation  (MOEA/D-DRA). For lesser computation burden, the existing design techniques merely employ few Standard Design Variables (SDV), satisfying only a few performance constraints, resulting in an approximated design, without any focus on an energy efficient transformer. The proposed methodology minimizes four sets of conflicting design bi-objectives, subjected to 27 constraints, incorporating three crucial design variables with SDV to ensure energy efficient transformer design with lesser losses, total life time cost (TLTC),  green house gas emission , and failure rate. Different cases are analysed on a sample 1500kVA transformer, which is designed by existing technique and the proposed  multi objective optimization problem  formulation approach and the performances of the competing transformers are compared. To prove the effectiveness of Iterative Chaotic map with infinite collapses assisted MOEA/D-DRA (ICMDRA), NSGA-II has also been successfully applied to solve the problem. When tested in all three different rating transformers, the simulation results have proved that the proposed methodology saves energy, cost, and material, with ICMDRA rather than NSGA-II. This paper identifies ICMDRA as a superior algorithm for transformer design, in terms of diversity and convergence. Also, the core loss calculation of the transformer designed using the proposed methodology is validated by 3D-FEM assessment and experimental prototype setup for a 200kVA transformer.",
    "citation_count": "22",
    "year": "2018/10/01",
    "authors": [
        {
            "name": "S. Tamilselvi",
            "country": ""
        },
        {
            "name": "S. Baskar",
            "country": ""
        },
        {
            "name": "L. Anandapadmanaban",
            "country": ""
        },
        {
            "name": "V. Karthikeyan",
            "country": ""
        },
        {
            "name": "S. Rajasekar",
            "country": ""
        }
    ],
    "keywords": []
}