{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222000451",
    "title": "Multioperator search strategy for evolutionary multiobjective optimization",
    "abstract": "Recombination operator is one of the important components of multiobjective evolutionary algorithm. Its purpose is to select parent individuals for the reproductive operation to produce promising  offspring  individuals. However, most of the existing multiobjective evolutionary algorithms use a single recombination operator, which makes it difficult to  trade off  exploitation and exploration in solving different  multiobjective optimization problems  or in different search stages. In this paper, we propose an multioperator search strategy for the multiobjective evolutionary algorithm, which adaptively learns the manifold structure of  Pareto optimal solution  set and  Pareto optimal front  by using the distribution information in the decision space and objective space. Firstly, a mating pool composed of highly similar solutions is constructed to guide the local search direction of the current population. Then, the promising solutions in the objective space are collected and their difference vectors are used to guide the global search direction of the current population. Finally, in order to select the candidate solution which is more suitable for the search stage of the algorithm, the offspring restriction probability is designed to adaptively direct the search towards promising regions of the  search space . Experimental results verify the advantages of multioperator search strategy in improving search efficiency.",
    "citation_count": "10",
    "year": "2022/06/01",
    "authors": [
        {
            "name": "Xiangzhou Gao",
            "country": ""
        },
        {
            "name": "Tingrui Liu",
            "country": ""
        },
        {
            "name": "Liguo Tan",
            "country": ""
        },
        {
            "name": "Shenmin Song",
            "country": ""
        }
    ],
    "keywords": []
}