{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022300130X",
    "title": "Online model tuning in surrogate-assisted optimization — An effective approach considering the cost–benefit tradeoff",
    "abstract": "Model construction, which determines the employed surrogate and its hyperparameters, is a major component of surrogate-assisted evolutionary algorithms (SAEAs). Many existing SAEAs use a (partially) fixed setting for the surrogate type and its hyperparameters, possibly due to a shortage of solid evidence that clarifies whether the gain from online tuning outweighs its cost and effort. This study performs a systematic cost–benefit analysis to determine the most suitable approach to tune three popular surrogate types: radial basis functions (RBFs), Gaussian processes (GPs), and support vector regression (SVR). For each, a multilevel tuning scheme is designed where a higher tuning level optimizes more hyperparameters, presumably resulting in a more accurate model if the allocated time for tuning is sufficient. Our numerical results reveal that this is true only up to a specific point. After that, a higher tuning level deteriorates or at least does not improve the quality of the tuned model. The recommended tuning level for each surrogate type is then determined following an investigation of the tradeoff between the tuning cost and gain. The effect of problem dimensionality and data size on the gain from online tuning and the potential merits of using an ensemble of surrogates are explored. Our comprehensive simulations disclose the best tuning strategies for these three surrogates and their ensemble; nevertheless, the methodology can be applied to other surrogates. The findings in this study are expected to reinforce future SAEAs with superior model construction strategies, ultimately improving their efficiency.",
    "citation_count": "0",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Ali Ahrari",
            "country": ""
        },
        {
            "name": "Dries Verstraete",
            "country": ""
        }
    ],
    "keywords": []
}