{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021730946X",
    "title": "Optimising discrete dynamic berth allocations in seaports using a Levy Flight based meta-heuristic",
    "abstract": "Seaports play a vital role in our  everyday life : they handle 90% of our world trade goods. Improving seaports' efficiency means improving the efficiency of sending and receiving our goods. In seaports, one of the most important and most expensive operations is how to allocate vessels to berths. In this paper, we solve this problem by proposing a new meta-heuristic, which combines the nature-inspired  Levy Flight   random walk  with  local search , while taking into account tidal windows. With our algorithm, we meet the following goals: (i) to minimise the cost of all vessels while staying in the port, and (ii) to schedule available berths for the arriving vessels taking into account a multi-tidal planning horizon. In comparison with the state-of-the-art exact method using commercial solver and a competitive heuristic, the computational results prove our approach guarantees feasibility of solutions for all the problem instances and is able to find good solutions in a short amount of time, especially for large-scale instances. We also compare our results to an existing state-of-the-art  Particle Swarm Optimisation  and our work produces significantly better performances on all the test instances.",
    "citation_count": "15",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Ran Wang",
            "country": ""
        },
        {
            "name": "Trung Thanh Nguyen",
            "country": ""
        },
        {
            "name": "Changhe Li",
            "country": ""
        },
        {
            "name": "Ian Jenkinson",
            "country": ""
        },
        {
            "name": "Zaili Yang",
            "country": ""
        },
        {
            "name": "Shayan Kavakeb",
            "country": ""
        }
    ],
    "keywords": []
}