{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217306570",
    "title": "Optimal parameter regions and the time-dependence of control parameter values for the particle swarm optimization algorithm",
    "abstract": "The  particle swarm optimization  (PSO) algorithm is a stochastic search technique based on the social dynamics of a flock of birds. It has been established that the performance of the  PSO  algorithm is sensitive to the values assigned to its  control parameters . Many studies have examined the long-term behaviours of various PSO  parameter configurations , but have failed to provide a  quantitative analysis  across a variety of benchmark problems. Furthermore, two important questions have remained unanswered. Specifically, the effects of the balance between the values of the acceleration coefficients on the optimal parameter regions, and whether the optimal parameters to employ are time-dependent, warrant further investigation. This study addresses both questions by examining the performance of a global-best PSO using 3036 different parameter configurations on a set of 22 benchmark problems. Results indicate that the balance between the acceleration coefficients does impact the regions of parameter space that lead to  optimal performance . Additionally, this study provides concrete evidence that, for the examined problem dimensions, larger acceleration coefficients are preferred as the search progresses, thereby indicating that the optimal parameters are, in fact, time-dependent. Finally, this study provides a general recommendation for the selection of PSO control parameter values.",
    "citation_count": "52",
    "year": "2018/08/01",
    "authors": [
        {
            "name": "Kyle Robert Harrison",
            "country": ""
        },
        {
            "name": "Andries P. Engelbrecht",
            "country": ""
        },
        {
            "name": "Beatrice M. Ombuki-Berman",
            "country": ""
        }
    ],
    "keywords": []
}