{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000415",
    "title": "Parallel multi-objective optimization for expensive and inexpensive objectives and constraints",
    "abstract": "Expensive objectives and constraints are key characteristics of real-world multi-objective optimization problems. In practice, they often occur jointly with inexpensive objectives and constraints. This paper presents the  Inexpensive Objectives and Constraints Self-Adapting Multi-Objective Constraint Optimization algorithm that uses Radial Basis function Approximations  (IOC-SAMO-COBRA) for such problems. This is motivated by the recently proposed Inexpensive Constraint Surrogate-Assisted Non-dominated Sorting Genetic Algorithm II (IC-SA-NSGA-II). These algorithms and their counterparts that do not explicitly differentiate between expensive and inexpensive objectives and constraints are compared on 22 widely used test functions. The IOC-SAMO-COBRA algorithm finds significantly better (identical/worse) Pareto fronts in at least 78% (6%/16%) of all test problems compared to IC-SA-NSGA-II measured with both the hypervolume and Inverted Generational Distance+ performance metric. The empirical cumulative distribution functions confirm this advantage for both algorithm variants that exploit the inexpensive constraints. In addition, the proposed method is compared against state-of-the-art practices on a real-world cargo vessel design problem. On this 17-dimensional two-objective practical problem, the proposed IOC-SAMO-COBRA outperforms SA-NSGA-II as well. From an algorithmic perspective, the comparison identifies specific strengths of both approaches and indicates how they should be hybridized to combine their best components.",
    "citation_count": "0",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Roy de Winter",
            "country": ""
        },
        {
            "name": "Bas Milatz",
            "country": ""
        },
        {
            "name": "Julian Blank",
            "country": ""
        },
        {
            "name": "Niki van Stein",
            "country": ""
        },
        {
            "name": "Thomas Bäck",
            "country": ""
        },
        {
            "name": "Kalyanmoy Deb",
            "country": ""
        }
    ],
    "keywords": []
}