{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002220",
    "title": "PSO-based lightweight neural architecture search for object detection",
    "abstract": "In recent years, Neural Architecture Search (NAS) has received widespread attention for its remarkable ability to design neural networks. However, existing NAS works have mainly focused on network search, with limited emphasis on downstream applications after discovering efficient neural networks. In this paper, we propose a lightweight search strategy based on the particle swarm optimization algorithm and apply the searched network as backbone for object detection tasks. Specifically, we design a lightweight search space based on Ghostconv modules and improved Mobileblocks, achieving comprehensive exploration within the search space using variable-length encoding strategy. During the search process, to balance network performance and resource consumption, we propose a multi-objective fitness function and incorporated the classification accuracy, parameter size, and FLOPs of candidate individuals into optimization. For particle performance evaluation, we propose a new strategy based on weight sharing and dynamic early stopping, significantly accelerating the search process. Finally, we fine-tune the globally optimal particle decoded as the backbone, adding Ghost PAN feature fusion modules and detection heads to build an object detection model, and we achieve a 17.01% mAP on the VisDrone2019 dataset. Experimental results demonstrate the competitiveness of our algorithm in terms of search time and the balance between accuracy and efficiency, and also confirm the effectiveness of object detection models designed through NAS methods.",
    "citation_count": "3",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Tao Gong",
            "country": ""
        },
        {
            "name": "Yongjie Ma",
            "country": ""
        }
    ],
    "keywords": []
}