{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218300233",
    "title": "Push and pull search for solving constrained multi-objective optimization problems",
    "abstract": "This paper proposes a push and pull search (PPS) framework for solving constrained multi-objective optimization problems (CMOPs). To be more specific, the proposed PPS divides the search process into two different stages: push and pull search stages. In the push stage, a multi-objective  evolutionary algorithm  (MOEA) is used to explore the  search space  without considering any constraints, which can help to get across infeasible regions very quickly and to approach the unconstrained  Pareto front . Furthermore, the landscape of CMOPs with constraints can be probed and estimated in the push stage, which can be utilized to conduct the parameter setting for the constraint-handling approaches to be applied in the pull stage. Then, a modified form of a constrained multi-objective evolutionary algorithm (CMOEA), with improved epsilon constraint-handling, is applied to pull the infeasible individuals achieved in the push stage to the feasible and non-dominated regions. To evaluate the performance regarding convergence and diversity, a set of benchmark CMOPs and a real-world optimization problem are used to test the proposed PPS (PPS-MOEA/D) and state-of-the-art CMOEAs, including MOEA/D-IEpsilon, MOEA/D-Epsilon, MOEA/D-CDP, MOEA/D-SR, C-MOEA/D and NSGA-II-CDP. The comprehensive experimental results show that the proposed PPS-MOEA/D achieves significantly better performance than the other six CMOEAs on most of the tested problems, which indicates the superiority of the proposed PPS method for solving CMOPs.",
    "citation_count": "379",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Zhun Fan",
            "country": ""
        },
        {
            "name": "Wenji Li",
            "country": ""
        },
        {
            "name": "Xinye Cai",
            "country": ""
        },
        {
            "name": "Hui Li",
            "country": ""
        },
        {
            "name": "Caimin Wei",
            "country": ""
        },
        {
            "name": "Qingfu Zhang",
            "country": ""
        },
        {
            "name": "Kalyanmoy Deb",
            "country": ""
        },
        {
            "name": "Erik Goodman",
            "country": ""
        }
    ],
    "keywords": []
}