{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304727",
    "title": "Random convergence analysis of particle swarm optimization algorithm with time‐varying attractor",
    "abstract": "The PSO convergence analysis is mainly based on the constant attractor, however, the attractor of PSO algorithm in the evolutionary process is time-varying point. So, the objective of this study is to mainly discuss the random convergence analysis of the standard and improved particle swarm optimization with the time-varying attractor. Its mathematical PSO model with the time-varying attractor is provided to calculate the convergence condition and the corresponding convergence speed. Specifically speaking,  spectral radii  of the random transfer matrix and the product of two adjacency random transfer matrices are calculated to determine the convergence or the divergence, together with the corresponding convergence speed. Additionally, it also calculates the mean and variance of the first and second order particle swarm optimization system with time-varying attractor. Numerical results highlight that the spectral analysis on some benchmark optimization functions is described to show the effectiveness of the obtained results, while the corresponding analysis is closely related to the objective fitness, the convergence speed, the time-varying attractor, the spectral radius of  M ( t )  and  M ( t + 1 ) M ( t ) ,  and swarm convergence behavior in the evolutionary process.",
    "citation_count": "13",
    "year": "2021/03/01",
    "authors": [
        {
            "name": "Jun Liu",
            "country": ""
        },
        {
            "name": "Xiaoning Ma",
            "country": ""
        },
        {
            "name": "Xin Li",
            "country": ""
        },
        {
            "name": "Min Liu",
            "country": ""
        },
        {
            "name": "Tianyun Shi",
            "country": ""
        },
        {
            "name": "Ping Li",
            "country": ""
        }
    ],
    "keywords": []
}