{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218310769",
    "title": "Selective-candidate framework with similarity selection rule for evolutionary optimization",
    "abstract": "Achieving better exploitation and exploration capabilities (EEC) have always been an important yet challenging issue in the design of  evolutionary optimization  algorithm (EOA). The difficulties lie in obtaining a good balance in EEC, which is determined cooperatively by operations and parameters in an EOA. When deficiencies in exploitation or exploration are observed, most existing works consider a piecemeal approach, either by designing new operations or by altering the parameters. Unfortunately, when different situations are encountered, these proposals may fail to be the winner. To address these problems, this paper proposes an explicit EEC  control method  named selective-candidate framework with similarity selection rule (SCSS). M (M ​> ​1) candidates are first generated from each current solution with independent operations and parameters to enrich the search. Then, a similarity selection rule is designed to determine the final candidate by considering the fitness ranking of the current solution and its  Euclidian distance  to each of these M candidates. Superior current solutions will prefer the closest candidates for efficient local exploitation while inferior ones will favor the farthest for exploration purpose. In this way, the rule could synthesize exploitation and exploration, making the evolution more effective. When applied to three classic, four state-of-the-art and four up-to-date EOAs from branches of differential evolution, evolution strategy and  particle swarm optimization , significant enhancement in performance is achieved.",
    "citation_count": "17",
    "year": "2020/08/01",
    "authors": [
        {
            "name": "Sheng Xin Zhang",
            "country": ""
        },
        {
            "name": "Wing Shing Chan",
            "country": ""
        },
        {
            "name": "Zi Kang Peng",
            "country": ""
        },
        {
            "name": "Shao Yong Zheng",
            "country": ""
        },
        {
            "name": "Kit Sang Tang",
            "country": ""
        }
    ],
    "keywords": []
}