{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650215000826",
    "title": "Self-adaptive control parameters׳ randomization frequency and propagations in differential evolution",
    "abstract": "This paper presents insight into an adaptation and self-adaptation mechanism within differential evolution, covering not only how but moreover – when this mechanism generates new values for control parameters, focusing on the iteration-temporal randomness of the self-adaptive control parameters. In particular, this randomness is controlled by a randomness level parameter, which influences the control parameters values׳  dynamics  and their propagation through suitable individuals׳ improvement contributions during ellitistic selection. Thereby, the randomness level parameter defines the chaotic behavior of self-adaptive control parameter values׳ instances. A Differential Evolution (DE) algorithm for Real Parameter Single  Objective Optimization  is utilized as an application of this mechanism, to analyze the impact of the randomness level parameter as used inside the  evolutionary algorithm  parameter adaptation and control mechanism, yielding statistically significant different algorithm performances and ranks on different randomness level parameter values. Moreover, the impacts of different randomness configurations on the number of improvements, improvement scales, and adaptation frequencies, are shown, in order to present a deeper insight into the influences and causes using different randomness level parameter configurations, to present the influence of  randomization  frequency on propagation stability. Since DE variant algorithms with the mechanism of control parameters self-adaptation are widely applied, this study might help in increasing the performances of these different variants and their applications.",
    "citation_count": "107",
    "year": "2015/12/01",
    "authors": [
        {
            "name": "Aleš Zamuda",
            "country": ""
        },
        {
            "name": "Janez Brest",
            "country": ""
        }
    ],
    "keywords": []
}