{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221001176",
    "title": "Simple-Encoded evolving convolutional neural network and its application to skin disease image classification",
    "abstract": "Automatically searched architectures by  neural architecture search  (NAS) methods have shown promising performance in various visual recognition tasks. Among NAS methods, evolutionary neural architecture methods are popular because of their potential to find the global optimal  convolutional neural networks  (CNNs). These methods usually use an individual to represent a CNN, while often facing two challenges: 1) since a CNN has numerous encoded parameters and weights, the length of each individual is long, which causes a large  search space , and 2) due to the unknown optimal depth of a CNN, it is necessary to deal with a variable-length  optimization problem , which leads to the search in a messy way since search spaces with different dimensions may have different optimal solutions. In this paper, we propose a  genetic  algorithm with a simple encoding scheme (SEECNN) for evolving CNNs to address  image classification  problems. In our encoding scheme, the parameters and weights of each layer are encoded into an individual and the whole population represents an entire CNN. Over the course of evolution, three  offspring  subpopulations are separately produced by genetic operators on three subpopulations. In each subpopulation, the lengths of individuals are short and equal. Afterward, we design a stable search strategy to update the population based on the  performance improvement , where we only insert, replace, and remove one individual to generate candidate populations. SEECNN is compared with 24 well-known algorithms on nine benchmark datasets and five state-of-the-art methods on a real-world skin disease  image classification  case. The results demonstrate its effectiveness.",
    "citation_count": "29",
    "year": "2021/12/01",
    "authors": [
        {
            "name": "Xiaoyu He",
            "country": ""
        },
        {
            "name": "Yong Wang",
            "country": ""
        },
        {
            "name": "Xiaojing Wang",
            "country": ""
        },
        {
            "name": "Weihong Huang",
            "country": ""
        },
        {
            "name": "Shuang Zhao",
            "country": ""
        },
        {
            "name": "Xiang Chen",
            "country": ""
        }
    ],
    "keywords": []
}