{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000392",
    "title": "Solving sparse multi-objective optimization problems via dynamic adaptive grouping and reward-penalty sparse strategies",
    "abstract": "Sparse Multi-Objective Optimization Problems (SMOPs) are commonly encountered in various fields such as machine learning, signal processing, and data mining. While evolutionary algorithms have shown good performance in tackling complex problems, many algorithms tend to exhibit performance degradation when dealing with SMOPs. The primary reasons for this performance decline are the curse of dimensionality and the inability to effectively leverage the sparsity of Pareto-optimal solutions. To address this issue, this paper proposes a model method to solve sparse multi-objective optimization problems through dynamic adaptive grouping and reward-penalty sparse strategies. Specifically, to obtain more effective prior information, a sparse initialization strategy is proposed in the initialization phase. This strategy aims to incorporate more prior knowledge and information about the sparsity of Pareto-optimal solutions. In the evolutionary phase, a decision variable dynamic adaptive grouping strategy is introduced. This strategy, combined with crossover and mutation operators, guides the population towards effective sparse directions. Furthermore, to further identify zero-value decision variables in Pareto-optimal solutions, a reward-penalty mechanism is designed to update the scores of decision variables. By combining this mechanism with the adaptive grouping strategy, this method can effectively flip low-scoring decision variables to zero with a higher probability. To validate the advantages of the proposed algorithm, experiments were conducted on eight benchmark problems, with comparative experiments conducted for different initialization methods. The results indicate that our algorithm exhibits significant advantages in solving SMOPs.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Zhenxing Yu",
            "country": ""
        },
        {
            "name": "Qinwei Fan",
            "country": ""
        },
        {
            "name": "Jacek M. Zurada",
            "country": ""
        },
        {
            "name": "Jigen Peng",
            "country": ""
        },
        {
            "name": "Haiyang Li",
            "country": ""
        },
        {
            "name": "Jian Wang",
            "country": ""
        }
    ],
    "keywords": []
}