{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021600002X",
    "title": "Solving multi-objective portfolio optimization problem using invasive weed optimization",
    "abstract": "Portfolio optimization is one of the important issues for effective and economic investment. There is plenty of research in the literature addressing this issue. Most of these pieces of research attempt to make the Markowitz’s primary portfolio selection model more realistic or seek to solve the model for obtaining fairly optimum portfolios. In this paper,  P / E  criterion and Experts’ Recommendations on Market Sectors have been added to the primary Markowitz mean-variance model as two objectives. The  P / E  ratio is one of the important criteria for investment in the stock market, which captures the current expectations of the market activists about different companies. Experts’ Recommendations for different Market Sectors, on the other hand, captures the experts’ predictions about the future of the stock market. There are many solving methods for the portfolio  optimization problem , but almost none of them investigates Invasive Weed  Optimization algorithm  (IWO). In this research, the proposed multi-objective portfolio selection model has been transformed into a single-objective programming model using fuzzy normalization and uniform design method. Some guidelines are given for parameter setting in the proposed IWO algorithm. The model is then applied to monthly data of top 50 companies of Tehran Stock Exchange Market in 2013. The proposed model is then solved by three methods: (1) the proposed IWO algorithm, (2) the  Particle Swarm Optimization algorithm  (PSO), and (3) the  Reduced Gradient  Method (RGM). The non-dominated solutions of these algorithms are compared with each other using  Data Envelopment Analysis  (DEA). According to the comparisons, it can be concluded that IWO and PSO algorithms have the same performance in most important criteria, but IWO algorithm has better solving time than PSO algorithm and better performance in dominating inefficient solutions, and PSO algorithm has better results in total violation of constraints.",
    "citation_count": "82",
    "year": "2016/06/01",
    "authors": [
        {
            "name": "Amir Rezaei Pouya",
            "country": ""
        },
        {
            "name": "Maghsud Solimanpur",
            "country": ""
        },
        {
            "name": "Mustafa Jahangoshai Rezaee",
            "country": ""
        }
    ],
    "keywords": []
}