{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222000013",
    "title": "Surrogate-assisted population based ACO for resource constrained job scheduling with uncertainty",
    "abstract": "In mining supply chains, transporting ore from mines to ports, is a problem of significant interest. Resources required in transporting ore are limited, and hence using resource efficiently goes a long way towards solving this problem. A key issue is that the  resource availability  is subject to uncertainties. Previous studies have considered similar (deterministic) problems, commonly tackled as resource constrained job scheduling. However, the uncertainty associated with resources needed to transport ore has not been considered. This study extends previous ones, by investigating resource constrained job scheduling with uncertainty (considering resource availabilities). The focus is on  robust optimisation , where the aim is to find high-quality solutions irrespective of the  input data . To solve this problem a population-based  ant colony optimisation  approach is devised, with the aim of identifying high-quality solutions across several uncertain scenarios. Moreover, computing the objective is inefficient due to uncertainty, and hence  surrogate models  are used. Experiments are conducted on a wide range of problem instances with varying uncertainty levels considering resources, and find that population-based  ant colony optimisation  is superior to ant colony optimisation on its own. The key advantage of this method is that it is able to maintain a population of excellent solutions, which can be used to efficiently approximate the objective values of new solutions, and hence update the pheromones globally of the ant colony  optimisation algorithm . Using this information the surrogate model considers only high quality solutions, and by carrying out increased learning in short time-frames, achieves excellent results.",
    "citation_count": "15",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Dhananjay Thiruvady",
            "country": ""
        },
        {
            "name": "Su Nguyen",
            "country": ""
        },
        {
            "name": "Fatemeh Shiri",
            "country": ""
        },
        {
            "name": "Nayyar Zaidi",
            "country": ""
        },
        {
            "name": "Xiaodong Li",
            "country": ""
        }
    ],
    "keywords": []
}