{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001365",
    "title": "Surrogate-assisted hierarchical learning water cycle algorithm for high-dimensional expensive optimization",
    "abstract": "Excessive  function evaluations  are the main obstacle preventing the application of metaheuristic algorithms to expensive real-world problems. Although many surrogate-assisted metaheuristic algorithms have been proposed to tackle this challenge, most of them still suffer from low prediction accuracy on high-dimensional problems. This article presents a surrogate-assisted  hierarchical learning  water cycle algorithm (SA-HLWCA) for high-dimensional expensive optimization problems. SA-HLWCA utilizes two searching modes, namely, global search and  local search , to cooperatively search for the optimal solution. A global search is conducted by a surrogate using a global diverse subset and aims to locate promising optimal areas. A local search is conducted by a surrogate built in the neighboring region of the current best and aims to refine the optimal solution. To validate the performance, comprehensive studies of the impacts of major components of SA-HLWCA are conducted. The proposed algorithm is then compared with three state-of-the-art algorithms on a series of tests on problems that range from 20 dimensions to 100 dimensions, and the results show that SA-HLWCA performs better in terms of both effectiveness and robustness. In addition, SA-HLWCA is applied to the shape optimization of a blended-wing-body underwater glider (BWBUG), and the lift-drag ratio of the optimized shape is improved by 7.66% compared with that of the initial shape.",
    "citation_count": "13",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Caihua Chen",
            "country": ""
        },
        {
            "name": "Xinjing Wang",
            "country": ""
        },
        {
            "name": "Huachao Dong",
            "country": ""
        },
        {
            "name": "Peng Wang",
            "country": ""
        }
    ],
    "keywords": []
}