{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650215000632",
    "title": "Unconventional modelling of complex system via cellular automata and differential evolution",
    "abstract": "The article deals with principles and utilization possibilities of  cellular automata  and differential evolution within task resolution and simulation of an epidemic process. The modelling of the spread of epidemics is one of the most widespread and commonly used areas of a modelling of complex systems. The origins of such complexity can be investigated through  mathematical models  termed ‘cellular automata’. Cellular automata consist of many identical components, each simple, but together capable of complex behaviour. They are analysed both as  discrete dynamical systems , and as information-processing systems. Cellular Automata (CA) are well known computational substrates for studying emergent collective behaviour, complexity, randomness and interaction between order and chaotic systems. For the purpose of the article,  cellular automata  and differential evolution are recognized as an intuitive  modelling paradigm  for complex systems. The proposed cellular automata supports to find rules of the transition function that represents the model of a studied epidemic. Search for models a studied epidemic belongs to  inverse problems  whose solution lies in a finding of local rules guaranteeing a desired global behaviour. The epidemic models have the  control parameters  and their setting significantly influences the behaviour of the models. One way how to get proper values of the  control parameters  is use  evolutionary algorithms , especially differential evolution (DE). Simulations of illness lasting from one to ten days were performed using both described approaches. The aim of the paper is to show a course of simulations for different rules of the transition function and how to find a suitable model of a studied epidemic in the case of  inverse problems  using a sufficient amount of local rules of a transition function.",
    "citation_count": "22",
    "year": "2015/12/01",
    "authors": [
        {
            "name": "Martin Kotyrba",
            "country": ""
        },
        {
            "name": "Eva Volna",
            "country": ""
        },
        {
            "name": "Petr Bujok",
            "country": ""
        }
    ],
    "keywords": []
}