{
    "url": "https://link.springer.com/article/10.1007/s10596-010-9190-6",
    "title": "A particle tracking transport method for the simulation of resident and flux-averaged concentration of solute plumes in groundwater models",
    "abstract": "A new numerical technique called the convolution-based particle tracking (CBPT) method is developed to simulate resident or flux-averaged solute concentrations in groundwater models. The method is valid for steady-state flow and linear transport processes such as sorption with a linear sorption isotherm and first-order decay. The CBPT method uses particle tracking to take advantage of the ability of particle-based approaches to maintain sharp fronts for advection-dominated transport problems common in groundwater modeling and because of the flexibility of the random walk method to simulate a wide range of possible forms of the dispersion tensor. Furthermore, the algorithm for carrying out the convolution and superposition calculation from particle tracking results is very efficient. We show that from a single particle tracking run, source term variability, sorption, and decay can all be simulated rapidly without rerunning the underlying transport model unless the flow field or dispersion parameters are changed. A series of verification simulations are presented to demonstrate the accuracy and efficiency of the CBPT method compared to more conventional particle tracking approaches.",
    "citation_count": 31,
    "year": "2010/09",
    "authors": [
        {
            "name": "Robinson, Bruce A.",
            "country": "USA"
        },
        {
            "name": "Dash, Zora V.",
            "country": "USA"
        },
        {
            "name": "Srinivasan, Gowri",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}