{
    "url": "https://link.springer.com/article/10.1023/A:1011521413158",
    "title": "A parallel, implicit, cell‐centered method for two‐phase flow with a preconditioned Newton–Krylov solver",
    "abstract": "A new parallel solution technique is developed for the fully implicit three‐dimensional two‐phase flow model. An expandedcell‐centered finite difference scheme which allows for a full permeability tensor is employed for the spatial discretization, and backwardEuler is used for the time discretization. The discrete systems are solved using a novel inexact Newton method that reuses the Krylov information generated by the GMRES linear iterative solver. Fast nonlinear convergence can be achieved by composing inexact Newton steps with quasi‐Newton steps restricted to the underlying Krylov subspace. Furthermore, robustness and efficiency are achieved with a line‐search backtracking globalization strategy for the nonlinear systems and a preconditioner for each coupled linear system to be solved. This inexact Newton method also makes use of forcing terms suggested by Eisenstat and Walker which prevent oversolving of the Jacobian systems. The preconditioner is a new two‐stage method which involves a decoupling strategy plus the separate solutions of both nonwetting‐phase pressure and saturation equations. Numerical results show that these nonlinear and linear solvers are very effective.",
    "citation_count": 40,
    "year": "1997/09",
    "authors": [
        {
            "name": "Dawson, Clint N.",
            "country": "USA"
        },
        {
            "name": "Klíe, Héctor",
            "country": "USA"
        },
        {
            "name": "Wheeler, Mary F.",
            "country": "USA"
        },
        {
            "name": "Woodward, Carol S.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}