{
    "url": "https://link.springer.com/article/10.1007/s10596-025-10359-5",
    "title": "A post-processing solution to restore numerical consistency for classical flow routing algorithms",
    "abstract": "Water flow routing algorithms are a cornerstone of landscape evolution models (LEMs), enabling efficient simulations of complex water flow networks across varying spatial and temporal scales. Among these, multiple flow direction (MFD) and single flow direction (SFD) algorithms are widely used to compute local drainage areas, yet they suffer from mesh dependency issues that compromise their consistency. This long-standing problem has motivated various empirical corrections. Despite these efforts, the lack of a robust mathematical framework has hindered a complete resolution of these deficiencies. Building on recent findings based on general Gauckler-Manning-Strickler (GMS) water mass conservation models, this paper unifies existing MFD/SFD methodologies, including node-to-node variants. We demonstrate that all such algorithms can be corrected through a simple post-processing step, effectively eliminating anomalous grid dependency while preserving the diversity of approaches in the literature. The proposed framework bridges the gap between traditional MFD algorithms and more modern definition of the specific catchment area. It also enables a classification of classical MFD/SFD algorithms based on their flow-sharing formulas. Numerical examples illustrate the versatility and effectiveness of this correction.",
    "citation_count": 59,
    "year": "2025/04",
    "authors": [
        {
            "name": "Coatléven, Julien",
            "country": "France"
        },
        {
            "name": "Chauveau, Benoit",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}