{
    "url": "https://link.springer.com/article/10.1007/s10596-024-10326-6",
    "title": "A sensitivity analysis of the impact of shut-in water cut of reactive control on net present value of waterflooding under reservoir uncertainty",
    "abstract": "Reactive Control (RC) is a well-known strategy for oil production optimization for waterflooding. This strategy is simple and direct: to set the producers and injectors to the maximum allowable flow rates, and to shut producers that become uneconomic due to exceeding a Shut-in Water Cut (SWCT) threshold; the RC with this SWCT will be called Classical RC (Cla-RC). This approach is also applied in waterflooding under uncertainty, which is represented by multiple realizations of the reservoir, and the same control must be applied on all realizations. Despite its great importance and its popularity, RC has received scant attention in the literature and its SWCT is always a constant value for all producers given by the Cla-RC. Thus, we present a sensitivity analysis of the impact of SWCT of RC on Net Present Value (NPV) of waterflooding under reservoir uncertainty. The research comprises two main parts. First, a sensitivity analysis is performed to evaluate the NPV across various SWCTs with constant values for all wells. Second, based on the insights from the sensitivity analysis, three Progressive Reactive Control (PRC) techniques were developed to further increase the NPV. These techniques shut the producers at increasing SWCTs, from a minimum SWCT (to be set up) to the maximum SWCT, which is the one used by the Cla-RC; each PRC has its own distribution for defining the intermediate SWCTs. The results demonstrate that the optimal SWCT for RC and PRC can be determined efficiently with a few simulation runs, as the NPV curve exhibits a concave curve in relationship with SWCT and minimum SWCT, respectively. Although the Cla-RC strategy achieved the highest total oil production, it did not yield the maximum NPV. In fact, its NPV fell within the range of the lowest NPV values observed among the evaluated approaches. This study was validated by simulation of two of the major waterflooding challenges under reservoir uncertainty, Olympus and Egg Models. The best PRC technique achieved an NPV improvement of 0.5% compared to the optimal RC strategy. While the improvements observed for Egg and Olympus were 3.0% and 4.2%, respectively, relative to the Cla-RC.",
    "citation_count": 52,
    "year": "2024/12",
    "authors": [
        {
            "name": "Freitas, Vinícius Rafael de",
            "country": "Brasil"
        },
        {
            "name": "Neto, Emanuel Pereira Barroso",
            "country": "Brasil"
        },
        {
            "name": "Sánchez, William Humberto Cuéllar",
            "country": "Brasil"
        },
        {
            "name": "Fortaleza, Eugênio Libório Feitosa",
            "country": "Brasil"
        },
        {
            "name": "Schveitzer, Ari",
            "country": "Brazil"
        },
        {
            "name": "Gonzalez, Marcelo",
            "country": "Brasil"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}