{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9640-5",
    "title": "Analysis of a more realistic well representation during secondary recovery in 3-D continuum models",
    "abstract": "The effectiveness of secondary recovery methods in reservoir development studies depends on the knowledge about how fluid-carrying regions (i.e. good-quality rock types) are connected between injection and production wells. To estimate reservoir performance uncertainty, comprehensive simulations on many reservoir model realisations are necessary, which is very CPU consuming and time demanding. Alternatively, we can use much simpler and physically based methods such as percolation approach. Classic percolation assumes connectivity between opposite 2-D faces of a 3-D system; whereas, hydrocarbon production is achieved through active wells that are one-dimensional lines (e.g. vertical, horizontal or deviated wells). The main contribution of this study is to analyse the percolation properties of 3-D continuum percolation models with more realistic well representations during secondary recovery. In particular, the connection of randomly distributed sands (i.e. good-quality rock types) between two lines (representing two wells) located at two corners of the system are modelled by Monte Carlo simulations. Subsequently, the connectivity and conductivity of such a line-to-line well representation is compared with that of face-to-face well representations in the previously published results. The critical percolation properties of those systems as well as the universality concept are also investigated. As there are many rooms for connections in 3-D models, we found that the principal percolation properties will not be altered significantly when the problem with a face-to-face connection is transformed to a line-to-line connection model.",
    "citation_count": 68,
    "year": "2017/12",
    "authors": [
        {
            "name": "Sadeghnejad, S.",
            "country": "Iran"
        },
        {
            "name": "Masihi, M.",
            "country": "Iran"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}