{
    "url": "https://link.springer.com/article/10.1007/s10596-018-9773-1",
    "title": "Conditions for upscalability of bioclogging in pore network models",
    "abstract": "In this work, we model the biofilm growth at the microscale using a rectangular pore network model in 2D and a cubic network in 3D. For the 2D network, we study the effects of bioclogging on porosity and permeability when we change parameters like the number of nodes in the network, the network size, and the concentration of nutrients at the inlet. We use a 3D cubic network to study the influence of the number of nodes in the z direction on the biofilm growth and on upscalability. We show that the biofilm can grow uniformly or heterogeneously through the network. Using these results, we determine the conditions for upscalability of bioclogging for rectangular and cubic networks. If there is uniform biofilm growth, there is a unique relation between permeability and porosity, K ∼ ϕ2, this relation does not depend on the volume of the network, therefore the system is upscalable. However, if there is preferential biofilm growth, the porosity-permeability relation is not uniquely defined, hence upscalability is not possible. The Damköhler number is used to determine when upscalability is possible. If the Damköhler number is less than 101, the biofilm grows uniformly and therefore the system is upscalable. However, if the Damköhler number is greater than 103, the biofilm growth exhibits a deviation from uniform biofilm growth and heterogeneous growth is observed, therefore upscalability is not possible. There is a transition from uniform growth to preferential growth if the Damköhler number is between 101 and 103.",
    "citation_count": 32,
    "year": "2018/12",
    "authors": [
        {
            "name": "Lopez-Peña, Luis A.",
            "country": "The Netherlands"
        },
        {
            "name": "Meulenbroek, Bernard",
            "country": "The Netherlands"
        },
        {
            "name": "Vermolen, Fred",
            "country": "The Netherlands"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}