{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10244-z",
    "title": "Deep learning discovery of macroscopic governing equations for viscous gravity currents from microscopic simulation data",
    "abstract": "Although deep learning has been successfully applied in a variety of science and engineering problems owing to its strong high-dimensional nonlinear mapping capability, it is of limited use in scientific knowledge discovery. In this work, we propose a deep learning based framework to discover the macroscopic governing equation of an important geophysical process, i.e., viscous gravity current, based on high-resolution microscopic simulation data without the need for prior knowledge of underlying terms. For two typical scenarios with different viscosity ratios, the deep learning based equations exactly capture the same dominant terms as the theoretically derived equations for describing long-term asymptotic behaviors, which validates the proposed framework. Unknown macroscopic equations are then obtained for describing short-term behaviors, and additional deep-learned compensation terms are eventually discovered. Comparison of posterior tests shows that the deep learning based PDEs actually perform better than the theoretically derived PDEs in predicting evolving viscous gravity currents for both long-term and short-term regimes. Moreover, the proposed framework is proven to be very robust against non-biased data noise for training, which is up to 20%. Consequently, the presented deep learning framework shows considerable potential for discovering unrevealed intrinsic laws in scientific semantic space from raw experimental or simulation results in data space.",
    "citation_count": 41,
    "year": "2023/12",
    "authors": [
        {
            "name": "Zeng, Junsheng",
            "country": "People’s Republic of China"
        },
        {
            "name": "Xu, Hao",
            "country": "People’s Republic of China"
        },
        {
            "name": "Chen, Yuntian",
            "country": "People’s Republic of China"
        },
        {
            "name": "Zhang, Dongxiao",
            "country": "People’s Republic of China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}