{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9657-9",
    "title": "Distributed Gauss-Newton optimization method for history matching problems with multiple best matches",
    "abstract": "Minimizing a sum of squared data mismatches is a key ingredient in many assisted history matching (AHM) workflows. A novel approach is developed to efficiently find multiple local minima of a data mismatch objective function, by performing Gauss-Newton (GN) minimizations concurrently while sharing information between dispersed regions in the reduced parameter space dynamically. To start, a large number of different initial parameter values (i.e., model realizations) are randomly generated and are used as initial search points and base-cases for each subsequent optimization. Predicted data for all realizations are obtained by simulating these search points concurrently, and relevant simulation results for all successful simulation jobs are recorded in a training data set. A local quadratic model around each base-case is constructed using the GN formulation, where the required sensitivity matrix is approximated by linear regression of nondegenerated points, collected in the training data set, that are closest to the given base-case. A new search point for each base-case is generated by minimizing the local quadratic approximate model within a trust region, and the training data set is updated accordingly once the simulation job corresponding to each search point is successfully completed. The base-cases are updated iteratively if their corresponding search points improve the data mismatch. Finally, each base-case will converge to a local minimum in the region of attraction of the initial base-case. The proposed approach is applied to different test problems with uncertain parameters being limited to hundreds or fewer. Most local minima of these test problems are found with both satisfactory accuracy and efficiency.",
    "citation_count": 69,
    "year": "2017/12",
    "authors": [
        {
            "name": "Gao, Guohua",
            "country": "USA"
        },
        {
            "name": "Vink, Jeroen C.",
            "country": "the Netherlands"
        },
        {
            "name": "Chen, Chaohui",
            "country": "USA"
        },
        {
            "name": "El Khamra, Yaakoub",
            "country": "USA"
        },
        {
            "name": "Tarrahi, Mohammadali",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}