{
    "url": "https://link.springer.com/article/10.1023/B:COMG.0000005243.73381.e3",
    "title": "Generalized Coarse Graining Procedures for Flow in Porous Media",
    "abstract": "This paper focuses on heterogeneous soil conductivities and on the impact their resolution has on a solution of the piezometric head equation: owing to spatial variations of the conductivity, the flow properties at larger scales differ from those found for experiments performed at smaller scales. The method of coarse graining is proposed in order to upscale the piezometric head equation on arbitrary intermediate scales. At intermediate scales large scale fluctuations of the conductivities are resolved, whereas small scale fluctuations are smoothed by a partialy spatial filtering procedure. The filtering procedure is performed in Fourier space with the aid of a low-frequency cut-off function. We derive the partially upscaled head equations. In these equations, the impact of the small scale variability is modeled by scale dependent effective conductivities which are determined by additional differential equations. Explicit results for the scale dependent conductivity values are presented in lowest order perturbation theory. The perturbation theory contributions are summed up with using a renormalisation group analysis yielding explicit results for the effective conductivity in isotropic media. Therefore, the results are also valid for highly heterogeneous media. The results are compared with numerical simulations performed by Dykaar and Kitanidis (1992). The method of coarse graining combined by a renormalisation group analysis offers a tool to derive exact and explicit expressions for resolution dependent conductivity values. It is, e.g., relevant for the interpretation of measurement data on different scales and for reduction of grid-block resolution in numerical modeling.",
    "citation_count": 34,
    "year": "2003/12",
    "authors": [
        {
            "name": "Attinger, Sabine",
            "country": "Switzerland"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}