{
    "url": "https://link.springer.com/article/10.1007/s10596-018-9766-0",
    "title": "Gradient-based Pareto optimal history matching for noisy data of multiple types",
    "abstract": "The advantages of the simultaneous integration of production and time-lapse seismic data for history matching have been demonstrated in a number of previous studies. Production data provide accurate observations at particular spatial locations (wells), while seismic data enable global, though filtered/noisy, estimates of state variables. In this work, we present an efficient computational tool for bi-objective history matching, in which data misfits for both production and seismic measurements are minimized using an adjoint-gradient approach. This enables us to obtain a set of Pareto optimal solutions defining the optimal trade-off between production and seismic data misfits (which are, to some extent, conflicting). The impact of noise structure and noise level on Pareto optimal solutions is investigated in detail. We discuss the existence of the “best” trade-off solution, or least-conflicting posterior model, which corresponds to the history-matched model that is expected to provide the least-conflicting forecast of future reservoir performance. The overall framework is successfully applied in 2D and 3D compositional simulation problems to provide a single least-conflicting posterior model and, for the 2D case, multiple samples from the posterior distribution using the randomized maximum likelihood method.",
    "citation_count": 30,
    "year": "2018/12",
    "authors": [
        {
            "name": "Volkov, Oleg",
            "country": "USA"
        },
        {
            "name": "Bukshtynov, Vladislav",
            "country": "USA"
        },
        {
            "name": "Durlofsky, Louis J.",
            "country": "USA"
        },
        {
            "name": "Aziz, Khalid",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}