{
    "url": "https://link.springer.com/article/10.1007/s10596-016-9587-y",
    "title": "Multi-fidelity meta-modeling for reservoir engineering - application to history matching",
    "abstract": "Defining representative reservoir models usually calls for a huge number of fluid flow simulations, which may be very time-consuming. Meta-models are built to lessen this issue. They approximate a scalar function from the values simulated for a set of uncertain parameters. For time-dependent outputs, a reduced-basis approach can be considered. If the resulting meta-models are accurate, they can be called instead of the flow simulator. We propose here to investigate a specific approach named multi-fidelity meta-modeling to reduce further the simulation time. We assume that the outputs of interest are known at various levels of resolution: a fine reference level, and coarser levels for which computations are faster but less accurate. Multi-fidelity meta-models refer to co-kriging to approximate the outputs at the fine level using the values simulated at all levels. Such an approach can save simulation time by limiting the number of fine level simulations. The objective of this paper is to investigate the potential of multi-fidelity for reservoir engineering. The reduced-basis approach for time-dependent outputs is extended to the multi-fidelity context. Then, comparisons with the more usual kriging approach are proposed on a synthetic case, both in terms of computation time and predictivity. Meta-models are computed to evaluate the production responses at wells and the mismatch between the data and the simulated responses (history matching error), considering two levels of resolution. The results show that the multi-fidelity approach can outperform kriging if the target simulation time is small. Last, its potential is evidenced when used for history matching.",
    "citation_count": 44,
    "year": "2016/12",
    "authors": [
        {
            "name": "Thenon, Arthur",
            "country": "France"
        },
        {
            "name": "Gervais, Véronique",
            "country": "France"
        },
        {
            "name": "Ravalec, Mickaële Le",
            "country": "France"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}