{
    "url": "https://link.springer.com/article/10.1007/s10596-012-9306-2",
    "title": "Numerical modeling of two-phase binary fluid mixing using mixed finite elements",
    "abstract": "Diffusion coefficients of dense gases in liquids can be measured by considering two-phase binary nonequilibrium fluid mixing in a closed cell with a fixed volume. This process is based on convection and diffusion in each phase. Numerical simulation of the mixing often requires accurate algorithms. In this paper, we design two efficient numerical methods for simulating the mixing of two-phase binary fluids in one-dimensional, highly permeable media. Mathematical model for isothermal compositional two-phase flow in porous media is established based on Darcy’s law, material balance, local thermodynamic equilibrium for the phases, and diffusion across the phases. The time-lag and operator-splitting techniques are used to decompose each convection–diffusion equation into two steps: diffusion step and convection step. The Mixed finite element (MFE) method is used for diffusion equation because it can achieve a high-order and stable approximation of both the scalar variable and the diffusive fluxes across grid–cell interfaces. We employ the characteristic finite element method with moving mesh to track the liquid–gas interface. Based on the above schemes, we propose two methods: single-domain and two-domain methods. The main difference between two methods is that the two-domain method utilizes the assumption of sharp interface between two fluid phases, while the single-domain method allows fractional saturation level. Two-domain method treats the gas domain and the liquid domain separately. Because liquid–gas interface moves with time, the two-domain method needs work with a moving mesh. On the other hand, the single-domain method allows the use of a fixed mesh. We derive the formulas to compute the diffusive flux for MFE in both methods. The single-domain method is extended to multiple dimensions. Numerical results indicate that both methods can accurately describe the evolution of the pressure and liquid level.",
    "citation_count": 38,
    "year": "2012/09",
    "authors": [
        {
            "name": "Sun, Shuyu",
            "country": "Kingdom of Saudi Arabia"
        },
        {
            "name": "Firoozabadi, Abbas",
            "country": "USA"
        },
        {
            "name": "Kou, Jisheng",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}