{
    "url": "https://link.springer.com/article/10.1007/s10596-015-9532-5",
    "title": "Phase-field modeling of a fluid-driven fracture in a poroelastic medium",
    "abstract": "In this paper, we present a phase field model for a fluid-driven fracture in a poroelastic medium. In our previous work, the pressure was assumed given. Here, we consider a fully coupled system where the pressure field is determined simultaneously with the displacement and the phase field. To the best of our knowledge, such a model is new in the literature. The mathematical model consists of a linear elasticity system with fading elastic moduli as the crack grows, which is coupled with an elliptic variational inequality for the phase field variable and with the pressure equation containing the phase field variable in its coefficients. The convex constraint of the variational inequality assures the irreversibility and entropy compatibility of the crack formation. The phase field variational inequality contains quadratic pressure and strain terms, with coefficients depending on the phase field unknown. We establish existence of a solution to the incremental problem through convergence of a finite dimensional approximation. Furthermore, we construct the corresponding Lyapunov functional that is linked to the free energy. Computational results are provided that demonstrate the effectiveness of this approach in treating fluid-driven fracture propagation.",
    "citation_count": 24,
    "year": "2015/12",
    "authors": [
        {
            "name": "Mikelić, A.",
            "country": "France"
        },
        {
            "name": "Wheeler, M. F.",
            "country": "USA"
        },
        {
            "name": "Wick, T.",
            "country": "Austria"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}