{
    "url": "https://link.springer.com/article/10.1007/s10596-006-9029-3",
    "title": "Segmentation of complex geophysical structures with well data",
    "abstract": "In many problems of geophysical interest, when trying to segment images (i.e., to locate interfaces between different regions on the images), one has to deal with data that exhibit very complex structures. This occurs, for instance, when describing complex geophysical images (with layers, faults,...); in that case, segmentation is very difficult. Moreover, the segmentation process requires to take into account well data to interpolate, which implies integrating interpolation condition in the mathematical model. More precisely, let $I:\\Omega\\rightarrow\\Re$ be a given bounded image function, where Ω is an open and bounded domain that belongs to $\\Re^{n}$ . Let $S=\\left\\{ x_{i}\\right\\} _{i}\\in\\Omega$ be a finite set of given points (well data). The aim is to find a contour Γ⊂Ω such that Γ is an object boundary interpolating the points from S. To do that, we combine the ideas of the geodesic active contour (Caselles et al., Int. J. Comput. Vision 22-1:61-87, 1997) and of interpolation of points (Zhao et al., Comput. Vis. Image Understand. 80:295-314, 1986) in a Level Set approach developed by Osher and Sethian (J. Comput. Phys. 79:12-49, 1988). We present modelling of the proposed method. Both theoretical results (viscosity solution) and numerical results (on a velocity model for a real seismic line) are given.",
    "citation_count": 40,
    "year": "2006/12",
    "authors": [
        {
            "name": "Gout, Christian",
            "country": "France"
        },
        {
            "name": "Guyader, Carole Le",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}