{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10249-8",
    "title": "Stochastic reconstruction of shale combining multi-scale generators and discriminators with attention mechanisms",
    "abstract": "The development of shale gas can optimize the energy structure and alleviate the sharp contradiction between energy supplies and demands. Stochastic simulation of shale reservoirs is a common and practical method for predicting and evaluating shale gas distribution and extent. Shale has complex pore structure, strong heterogeneity and low permeability with multi-scale natural fractures, which makes it difficult to characterize or simulate using common numerical simulation methods. Generative adversarial network (GAN), as the mainstream generative model of recently flourishing deep learning methods, can theoretically learn any feature distribution of training images and generate fake images that are similar to real ones, which has been successfully used in geological stochastic simulation. The original GAN is unstable due to the defect of the loss function and its structure, possibly leading to significant differences between the reconstructed results and the real samples. Moreover, the ability of extracting features from the original GAN is restricted by the demand of a large number of training datasets, which makes a difficult prerequisite for shale reconstruction. The multi-scale structure can capture the characteristics of shale at different scales, suitable for multi-scale internal structure of shale. Attention mechanisms can focus on important information and suppress unwanted information. Therefore, a multi-scale GAN combining with attention mechanisms for 3D shale reconstruction is proposed based on only one shale image. The original GAN’s loss function is replaced by the hinge-GAN loss function. By comparing with other methods using various measurement metrics, it is proved that our method is effective in shale reconstruction and has good consistency in physical properties with the real data.",
    "citation_count": 39,
    "year": "2023/12",
    "authors": [
        {
            "name": "Zhang, Ting",
            "country": "China"
        },
        {
            "name": "Dong, Yue",
            "country": "China"
        },
        {
            "name": "Bai, Hualin",
            "country": "China"
        },
        {
            "name": "Peng, Yuan",
            "country": "China"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}