{
    "url": "https://link.springer.com/article/10.1007/s10596-017-9627-2",
    "title": "Successful application of multiscale methods in a real reservoir simulator environment",
    "abstract": "For the past 10 years or so, a number of so-called multiscale methods have been developed as an alternative approach to upscaling and to accelerate reservoir simulation. The key idea of all these methods is to construct a set of prolongation operators that map between unknowns associated with cells in a fine grid holding the petrophysical properties of the geological reservoir model and unknowns on a coarser grid used for dynamic simulation. The prolongation operators are computed numerically by solving localized flow problems, much in the same way as for flow-based upscaling methods, and can be used to construct a reduced coarse-scale system of flow equations that describe the macro-scale displacement driven by global forces. Unlike effective parameters, the multiscale basis functions have subscale resolution, which ensures that fine-scale heterogeneity is correctly accounted for in a systematic manner. Among all multiscale formulations discussed in the literature, the multiscale restriction-smoothed basis (MsRSB) method has proved to be particularly promising. This method has been implemented in a commercially available simulator and has three main advantages. First, the input grid and its coarse partition can have general polyhedral geometry and unstructured topology. Secondly, MsRSB is accurate and robust when used as an approximate solver and converges relatively fast when used as an iterative fine-scale solver. Finally, the method is formulated on top of a cell-centered, conservative, finite-volume method and is applicable to any flow model for which one can isolate a pressure equation. We discuss numerical challenges posed by contemporary geomodels and report a number of validation cases showing that the MsRSB method is an efficient, robust, and versatile method for simulating complex models of real reservoirs.",
    "citation_count": 113,
    "year": "2017/12",
    "authors": [
        {
            "name": "Lie, K.-A.",
            "country": "Norway"
        },
        {
            "name": "Møyner, O.",
            "country": "Norway"
        },
        {
            "name": "Natvig, J. R.",
            "country": "Norway"
        },
        {
            "name": "Kozlova, A.",
            "country": "USA"
        },
        {
            "name": "Bratvedt, K.",
            "country": "USA"
        },
        {
            "name": "Watanabe, S.",
            "country": "USA"
        },
        {
            "name": "Li, Z.",
            "country": "USA"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}