{
    "url": "https://link.springer.com/article/10.1007/s10596-023-10223-4",
    "title": "Surrogate-assisted distributed swarm optimisation for computationally expensive geoscientific models",
    "abstract": "Evolutionary algorithms provide gradient-free optimisation which is beneficial for models that have difficulty in obtaining gradients; for instance, geoscientific landscape evolution models. However, such models are at times computationally expensive and even distributed swarm-based optimisation with parallel computing struggle. We can incorporate efficient strategies such as surrogate-assisted optimisation to address the challenges; however, implementing inter-process communication for surrogate-based model training is difficult. In this paper, we implement surrogate-based estimation of fitness evaluation in distributed swarm optimisation over a parallel computing architecture. We first test the framework on a set of benchmark optimisation problems and then apply to a geoscientifc model that features landscape evolution model. Our results demonstrate very promising results for benchmark functions and the Badlands landscape evolution model. We obtain a reduction in computationally time while retaining optimisation solution accuracy through the use of surrogates in a parallel computing environment. The major contribution of the paper is in the application of surrogate-based optimisation for geoscientific models which can in the future help in better understanding of paleoclimate and geomorphology.",
    "citation_count": 60,
    "year": "2023/12",
    "authors": [
        {
            "name": "Chandra, Rohitash",
            "country": "Australia"
        },
        {
            "name": "Sharma, Yash Vardhan",
            "country": "India"
        }
    ],
    "keywords": [
        "Earth Sciences, general",
        "Geotechnical Engineering & Applied Earth Sciences",
        "Hydrogeology",
        "Mathematical Modeling and Industrial Mathematics",
        "Soil Science & Conservation"
    ]
}