{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000370",
    "title": "0–1 ILP-based run-time hierarchical energy optimization for heterogeneous cluster-based multi/many-core systems",
    "abstract": "Heterogeneous cluster-based multi/many-core platforms are on the edge, delivering high computing and energy-efficient embedded systems. These platforms support Dynamic Voltage/Frequency Scaling (DVFS), allowing to change the voltage/frequency levels for each cluster independently. Mapping dynamic applications on such platforms at run-time is a tedious task. This article presents a 0–1  Integer Linear Programming  (ILP) based run-time management approach that aims to optimize the overall  system energy . The proposed approach adopts a hierarchical  management organization . A global management strategy determines application-to-cluster assignments and setups the cluster frequency configurations. A local management strategy determines task-to-core mapping in each cluster to minimize resource usage. Our approach achieves optimized solutions with reduced complexity and shows good scalability on different platform sizes. The experimental results show that, compared with the state-of-the-art approaches of similar complexity, the proposed global management strategy can reduce the average  power consumption  of the overall system by 80.3%. The experiment also demonstrates that resource minimization in the local management can significantly impact global management decisions, and thereby further reducing overall average power by up to 60.72%.",
    "citation_count": "5",
    "year": "2021/06/01",
    "authors": [
        {
            "name": "Simei Yang",
            "country": ""
        },
        {
            "name": "Sébastien Le Nours",
            "country": ""
        },
        {
            "name": "Maria Mendez Real",
            "country": ""
        },
        {
            "name": "Sébastien Pillement",
            "country": ""
        }
    ],
    "keywords": []
}