{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116300650",
    "title": "A compiler assisted wear leveling for morphable PCM in embedded systems",
    "abstract": "Phase change memory  (PCM) is considered as a promising alternative of DRAM-based main memory in embedded systems. A PCM cell can be dynamically programmed to be in either multiple-level cell (MLC) mode or single-level cell (SLC) mode. With this morphable feature, we can utilize the high-density of MLC and low-latency of SLC, to satisfy various memory requirements of specific applications in embedded systems. However, compared to its SLC counterpart, the lifetime of MLC is limited. To address this issue, this paper proposes a simple and effective wear-leveling technique, named  Mixer , to enhance the lifetime of morphable PCM considering the program specific features. We first build an  Integer Linear Programming  (ILP) formulation to dynamically configure the optimal SLC/MLC partition in morphable PCM, and produce the best data allocation for each variable to achieve a balanced write distribution in morphable PCM with low memory access cost. The basic idea is to allocate low-latency SLC and high-density MLC cells for write intensive variables and other ordinary variables, respectively. We then propose a  polynomial time  algorithm to achieve near-optimal results. The evaluation results show that the proposed technique can effectively improve the lifetime of morphable PCM in embedded systems compared with previous work.",
    "citation_count": "6",
    "year": "2016/11/01",
    "authors": [
        {
            "name": "Linbo Long",
            "country": ""
        },
        {
            "name": "Edwin H.-M. Sha",
            "country": ""
        },
        {
            "name": "Duo Liu",
            "country": ""
        },
        {
            "name": "Liang Liang",
            "country": ""
        },
        {
            "name": "Kan Zhong",
            "country": ""
        },
        {
            "name": "Xiao Zhu",
            "country": ""
        }
    ],
    "keywords": []
}