{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121002575",
    "title": "A cross-platform OpenVX library for FPGA accelerators",
    "abstract": "FPGAs are an excellent platform to implement computer vision applications, since these applications tend to offer a high level of parallelism with many data-independent operations. However, the freedom in the solution design space of FPGAs represents a problem because each solution must be individually designed, verified, and tuned. The emergence of High Level Synthesis (HLS) helps solving this problem and has allowed the implementation of open programming standards as OpenVX for computer vision applications on FPGAs, such as the HiFlipVX library developed exclusively for Xilinx devices. Although with the HiFlipVX library, designers can develop solutions efficiently on Xilinx, they do not have an approach to port and run their code on FPGAs from other manufacturers. This work extends the HiFlipVX capabilities in two significant ways: supporting Intel FPGA devices and enabling execution on discrete FPGA accelerators. To provide both without affecting user-facing code, the new carried out implementation combines two HLS programming models: C++, using Intel’s system of tasks, and OpenCL, which provides the CPU interoperability. Comparing with pure OpenCL implementations, this work reduces kernel dispatch resources, saving up to 24% of ALUT resources for each kernel in a graph, and improves performance 2.6  ×  and energy consumption 1.6  ×  on average for a set of representative applications, compared with state-of-the-art frameworks.",
    "citation_count": "0",
    "year": "2022/02/01",
    "authors": [
        {
            "name": "Maria Angélica Dávila-Guzmán",
            "country": ""
        },
        {
            "name": "Lester Kalms",
            "country": ""
        },
        {
            "name": "Rubén Gran Tejero",
            "country": ""
        },
        {
            "name": "María Villarroya-Gaudó",
            "country": ""
        },
        {
            "name": "Darío Suárez Gracia",
            "country": ""
        },
        {
            "name": "Diana Göhringer",
            "country": ""
        }
    ],
    "keywords": []
}