{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120301557",
    "title": "A genetic algorithm based energy efficient group paging approach for IoT over 5G",
    "abstract": "Cellular networks  are evolving to the era of 5th Generation (5G), where 5G new radio (NR) and Long-Term Evolution: Advanced (LTE-A) Pro technologies are being envisioned for enabling smart and innovative services of the Internet-of-Things (IoT). However, existing LTE-A Pro protocols such as the group paging approach is still heavily inclined towards human-to-human communications owing to the heterogeneous characteristics of a wide variety of  IoT devices . Since most IoT devices are  battery  operated and their  power consumption  rate decides the battery lifetime, hence energy-efficient  data transfer  protocols are of  paramount importance  for next-generation IoT networks. Group paging is one such mechanism that has been widely accepted to improve energy efficiency of IoT networks. However, grouping approach for IoT devices is still not a much addressed topic, though a few novel group paging approaches have been studied that focus on varied IoT characteristics and mobility; though such approaches are not computationally efficient particularly for massive IoT deployments. Therefore, this paper proposes a novel multi-parameter  evolutionary optimization , namely,  genetic algorithm  (GA) based grouping approach that also considers IoT features such as traffic patterns, delay requirements, and mobility patterns. Results obtained from simulations validate that our proposed method can significantly improve IoT devices’ energy efficiency over random grouping schemes and other approaches.",
    "citation_count": "17",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Buddhadeb Pradhan",
            "country": ""
        },
        {
            "name": "V. Vijayakumar",
            "country": ""
        },
        {
            "name": "Sanjoy Pratihar",
            "country": ""
        },
        {
            "name": "Deepak Kumar",
            "country": ""
        },
        {
            "name": "K. Hemant Kumar Reddy",
            "country": ""
        },
        {
            "name": "Diptendu Sinha Roy",
            "country": ""
        }
    ],
    "keywords": []
}