{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001545",
    "title": "A lightweight verifiable trust based data collection approach for sensor–cloud systems",
    "abstract": "A Lightweight Verifiable Trust based Data Collection (LVT-DC) approach is proposed to obtain credible data for mobile vehicles network, in which, a large number of  IoT  devices are deployed in smart city, and Mobile Vehicles (MVs) collect data from  IoT  devices and report data to cloud to construct various applications. First, some  IoT devices  are selected as core-IoT device whose data more than others. Then,  Unmanned Aerial Vehicles  (UAV) delivers a short verification code to each core-IoT devices and collects its data, and it embeds verification code into the data when the MVs collect it in order for cloud to check. Last, a verifiable trust inference method is proposed which includes two types of trust calculations. (a) Direct trust: MVs If the reported data cannot recover the verification code or is inconsistent with the UAV collection result, reduce the trust of the MVs, (b) Trust inference: If the data of a non-core-IoT devices reported by a MVs is inconsistent with the trusted MVs, then reduce its trust. After a large number of experimental results, the LVT-DC approach can quickly and accurately identify the credibility of the  data collector  and ensure credible data collection.",
    "citation_count": "25",
    "year": "2021/10/01",
    "authors": [
        {
            "name": "Jiawei Guo",
            "country": ""
        },
        {
            "name": "Haoyang Wang",
            "country": ""
        },
        {
            "name": "Wei Liu",
            "country": ""
        },
        {
            "name": "Guosheng Huang",
            "country": ""
        },
        {
            "name": "Jinsong Gui",
            "country": ""
        },
        {
            "name": "Shaobo Zhang",
            "country": ""
        }
    ],
    "keywords": []
}