{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000849",
    "title": "A lightweight key management scheme for key-escrow-free ECC-based CP-ABE for IoT healthcare systems",
    "abstract": "The rapid increase in the implementation of  Internet of Things  (IoT) solutions in diverse healthcare sectors raises the IoT in the healthcare market. The real-time health monitoring to manage the chronic diseases is likely to drive the demand of IoT in healthcare. Moreover, the enhancement in communication technologies like real-time  data transmission  has improved the patients’ confidence in managing the chronic disease and medication dosage. Although IoT in healthcare makes a positive impact on patients and  healthcare providers , however, it gets the challenges like  data security  and privacy. One means of sustaining security in IoT based healthcare system is through key management and at the same time an effective security mechanism for  outsourced data  to obtain fine-grained  access control  is the  Ciphertext  Policy-Attribute Based Encryption (CP-ABE). However, the overhead of complex decryption operations and key-escrow problem of CP-ABE hinders its applicability in IoT. Hence, in this work, we design a lightweight key management mechanism for the CP-ABE scheme using  Elliptic Curve Cryptography  (ECC). The novelty in this scheme is that irrespective of the secret key generation by the semi-trusted authority (honest, but curious to know the secret information), it is not capable to decrypt any message using these keys until and unless it has an additional private key of the receiver. For a constraint environment like IoT, the applicability of CP-ABE has two major issues: complex decryption operations and key-escrow problem. Hence, in this paper, a lightweight CP-ABE scheme for IoT based health care system using ECC has been designed. The proposed key management mechanism in the CP-ABE scheme is key-escrow free as well as significantly reduces the decryption overhead of the data receiver. The performance analysis shows that the proposed scheme is more effective as compared to the existing competing schemes.",
    "citation_count": "55",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "K. Sowjanya",
            "country": ""
        },
        {
            "name": "Mou Dasgupta",
            "country": ""
        },
        {
            "name": "Sangram Ray",
            "country": ""
        }
    ],
    "keywords": []
}