{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001431",
    "title": "A redesigned secure and efficient data transaction protocol for mobile payment system",
    "abstract": "Generally, the secure protocol was proposed from the certificateless signature (CLS) scheme to provide the corresponding security for the actual application. However, for the previous application protocols, most of the underlying CLS schemes cannot have their claimed security, because some proposals cannot resist  forgery attacks  or the  master secret key  can be captured by the probabilistic  polynomial time  adversary. To further address the above problems, we take several previous CLS schemes as instances to make a detailed analysis of the causes of the above security flaws and point out that, in a secure CLS scheme, we should appropriately publish the public parameters. Based on the above analysis, we design an efficient and secure CLS scheme in this paper, and the unforgeability is proved based on the hardness of  discrete logarithm  complexity assumption through the Forking lemma. Compared with the existing constructions, our new proposal has advantages in communication and computation efficiency but also has higher security. Furthermore, a concrete construction of a certificateless aggregate signature (CLAS) scheme is designed with the above basic CLS scheme to realize efficient verification of multiple signatures. Finally, we further improve the key conditions that need to be paid attention to design a secure CLS scheme.",
    "citation_count": "1",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Zirui Qiao",
            "country": ""
        },
        {
            "name": "Qiliang Yang",
            "country": ""
        },
        {
            "name": "Yanwei Zhou",
            "country": ""
        },
        {
            "name": "Bo Yang",
            "country": ""
        },
        {
            "name": "Mingwu Zhang",
            "country": ""
        }
    ],
    "keywords": []
}