{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117300735",
    "title": "A resource-efficient network interface supporting low latency reconfiguration of virtual circuits in time-division multiplexing networks-on-chip",
    "abstract": "This paper presents a resource-efficient time-division multiplexing network interface of a network-on-chip intended for use in a  multicore platform  for hard real-time systems. The network-on-chip provides virtual circuits to move data between core-local on-chip memories. In such a platform, a change of the application’s  operating mode  may require  reconfiguration  of virtual circuits that are setup by the network-on-chip. A unique feature of our network interface is the instantaneous reconfiguration between different time-division multiplexing schedules, containing sets of virtual circuits, without affecting virtual circuits that persist across the reconfiguration. The results show that the worst-case latency from triggering a reconfiguration until the new schedule is executing, is in the range of 300 clock cycles. Experiments show that new schedules can be transmitted from a single master to all slave nodes for a 16-core platform in between 500 and 3500 clock cycles. The results also show that the  hardware cost  for an  FPGA  implementation of our architecture is considerably smaller than other network-on-chips with similar reconfiguration functionalities, and that the worst-case time for a reconfiguration is smaller than that seen in functionally equivalent architectures.",
    "citation_count": "7",
    "year": "2017/03/01",
    "authors": [
        {
            "name": "Rasmus Bo Sørensen",
            "country": ""
        },
        {
            "name": "Luca Pezzarossa",
            "country": ""
        },
        {
            "name": "Martin Schoeberl",
            "country": ""
        },
        {
            "name": "Jens Sparsø",
            "country": ""
        }
    ],
    "keywords": []
}