{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002624",
    "title": "A server bypass architecture for hopscotch hashing key–value store on DRAM-NVM memories",
    "abstract": "Non-volatile memories (NVMs), along with DRAMs, provide key–value (KV) stores with strong support in persisting data and storing it in memories. The remote direct memory access (RDMA) technology has been employed to boost remote data access to KV stores, since it provides kernel-bypass, zero-copy and low-latency features. Meanwhile, existing KV stores on DRAM-NVM memories suffer from  performance bottlenecks ; extra costs still need to be spent in accessing data in memories and keeping data consistency. This paper introduces Reno, a server bypass architecture for KV stores on DRAM-NVM memories. Reno is a server–client architecture for KV stores. It is equipped with two techniques: (1) a hopscotch hashing technique that allows KV stores on DRAM-NVM memories to perform latch-enabled append operations and (2) a fully server-bypass read/write paradigm. These techniques help eliminate network round trips of the server(s) and as well reduce hash conflicts, allowing clients to access the KV stores much more efficiently. We evaluate Reno on an Intel’s Optane DC  Persistent Memory  platform. The results show that Reno outperforms its counterparts by 1.1 ∼ 3 . 3 ×  for remote reads and 1.9 ∼ 4 . 8 ×  for remote writes in latency; the speedups of concurrent throughput are up to 2.33 × , 2.36 × , 3.09 ×  and 5.08 ×  for read-only, read-heavy, write-heavy and write-only YCSB workloads, respectively.",
    "citation_count": "5",
    "year": "2023/01/01",
    "authors": [
        {
            "name": "Jingyu Wang",
            "country": ""
        },
        {
            "name": "Rulin Huang",
            "country": ""
        },
        {
            "name": "Kaixin Huang",
            "country": ""
        },
        {
            "name": "Yuting Chen",
            "country": ""
        }
    ],
    "keywords": []
}