{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001570",
    "title": "A Survey on Task Offloading in Multi-access Edge Computing",
    "abstract": "With the advent of new technologies in both hardware and software, we are in the need of a new type of application that requires huge computation power and minimal delay. Applications such as face recognition,  augmented reality , virtual reality, automated vehicles,  industrial IoT , etc. belong to this category.  Cloud computing  technology is one of the candidates to satisfy the computation requirement of resource-intensive applications running in UEs (User Equipment) as it has ample computational capacity, but the latency requirement for these applications cannot be satisfied by the cloud due to the  propagation delay  between UEs and the cloud. To solve the latency issues for the delay-sensitive applications a new network paradigm has emerged recently known as Multi-Access Edge Computing (MEC) (also known as mobile edge computing) in which computation can be done at the network edge of UE devices. To execute the resource-intensive tasks of UEs in the MEC servers hosted in the network edge, a UE device has to offload some of the tasks to MEC servers. Few survey papers talk about  task offloading  in MEC, but most of them do not have in-depth analysis and classification exclusive to MEC task offloading. In this paper, we are providing a comprehensive survey on the task offloading scheme for MEC proposed by many researchers. We will also discuss issues, challenges, and future research direction in the area of task offloading to MEC servers.",
    "citation_count": "192",
    "year": "2021/09/01",
    "authors": [
        {
            "name": "Akhirul Islam",
            "country": ""
        },
        {
            "name": "Arindam Debnath",
            "country": ""
        },
        {
            "name": "Manojit Ghose",
            "country": ""
        },
        {
            "name": "Suchetana Chakraborty",
            "country": ""
        }
    ],
    "keywords": []
}