{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376211830540X",
    "title": "A survey of optimization techniques for thermal-aware 3D processors",
    "abstract": "Interconnect scaling has become a major design challenge for traditional planar (2D)  integrated circuits  (ICs). Three-dimensional (3D) IC that stacks multiple device layers through 3D stacking technology is regarded as an effective solution to this dilemma. A promising 3D  IC design  direction is to construct 3D processors. However, 3D processors are likely to suffer from more serious thermal issues as compared to conventional 2D processors, which may hinder the employment or even offset the benefits of 3D stacking. Therefore, thermal-aware design techniques should be adopted to alleviate the thermal problems with 3D processors. In this survey, we review works on system level optimization techniques for thermal-aware 3D processor design from hierarchical perspectives of architecture,  floorplanning ,  memory management , and  task scheduling . We first survey 3D processor architectures to demonstrate how a 3D processor can be constructed by using 3D stacking technology, and present an overview of thermal characteristics of the constructed 3D processors. We then review thermal-aware floorplanning, memory management and task scheduling techniques to show how the thermal impact on 3D processor performance can be reduced. A systematic classification method is utilized throughout the survey to emphasize similarities and differences of various thermal-aware 3D processor optimization techniques. This paper shows that the thermal impact on 3D processors is manageable by adopting thermal-aware techniques, thus making 3D processors into the mainstream in the near future.",
    "citation_count": "102",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Kun Cao",
            "country": ""
        },
        {
            "name": "Junlong Zhou",
            "country": ""
        },
        {
            "name": "Tongquan Wei",
            "country": ""
        },
        {
            "name": "Mingsong Chen",
            "country": ""
        },
        {
            "name": "Shiyan Hu",
            "country": ""
        },
        {
            "name": "Keqin Li",
            "country": ""
        }
    ],
    "keywords": []
}