{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118304156",
    "title": "A Survey and Taxonomy of FPGA-based Deep Learning Accelerators",
    "abstract": "Deep learning, the fastest growing segment of  Artificial Neural Network  (ANN), has led to the emergence of many machine learning applications and their implementation across multiple platforms such as CPUs, GPUs and reconfigurable hardware ( Field-Programmable Gate Arrays  or FPGAs). However, inspired by the structure and function of ANNs, large-scale deep learning topologies require a considerable amount of parallel processing, memory resources, high throughput and significant processing power. Consequently, in the context of real time hardware systems, it is crucial to find the right trade-off between performance, energy efficiency, fast development, and cost. Although limited in size and resources, several approaches have showed that FPGAs provide a good starting point for the development of future deep learning implementation architectures. Through this paper, we briefly review recent work related to the implementation of deep learning algorithms in FPGAs. We will analyze and compare the design requirements and features of existing topologies to finally propose development strategies and implementation architectures for better use of FPGA-based deep learning topologies. In this context, we will examine the frameworks used in these studies, which will allow testing a lot of topologies to finally arrive at the best implementation alternatives in terms of performance and energy efficiency.",
    "citation_count": "68",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Ahmed Ghazi Blaiech",
            "country": ""
        },
        {
            "name": "Khaled Ben Khalifa",
            "country": ""
        },
        {
            "name": "Carlos Valderrama",
            "country": ""
        },
        {
            "name": "Marcelo A.C. Fernandes",
            "country": ""
        },
        {
            "name": "Mohamed Hedi Bedoui",
            "country": ""
        }
    ],
    "keywords": []
}