{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000711",
    "title": "A survey on privacy preservation techniques for blockchain interoperability",
    "abstract": "The prosperity of  blockchain  has spawned numerous blockchain-based platforms with different structures and  consensus mechanisms , further increasing the attention of blockchain interoperability for the interactions of different platforms. The interoperability supports the advanced development of blockchain technology by enabling value and information interactions of different chains. Considering the characteristics of openness and zero-trust of blockchain,  privacy preservation  is essential for blockchain interoperability technology. However, the state-of-the-art still lacks a comprehensive investigation of existing privacy preservation techniques for blockchain interoperability. To fill the research gap, this paper conducts an extensive survey on current privacy-preserving techniques in hash-locking-based, sidechains/relays-based and notary-scheme-based interoperability technology. Specifically, we put forward a series of evaluation criteria, including confidentiality,  anonymity , unlinkability, conditional traceability, auditability, scalability, universality, efficiency, fairness, atomicity, and  fault tolerance , to judge the effectiveness and weaknesses of the surveyed techniques. In the end, we discuss  unsolved problems  in the existing literature and propose promising directions for future research.",
    "citation_count": "15",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Ruoyu Yin",
            "country": ""
        },
        {
            "name": "Zheng Yan",
            "country": ""
        },
        {
            "name": "Xueqin Liang",
            "country": ""
        },
        {
            "name": "Haomeng Xie",
            "country": ""
        },
        {
            "name": "Zhiguo Wan",
            "country": ""
        }
    ],
    "keywords": []
}