{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117301704",
    "title": "A systematic approach and tool support for GSN-based safety case assessment",
    "abstract": "Context . In safety-critical domains, safety cases are widely used to demonstrate the safety of systems. A safety case is an argumentation for showing confidence in the claimed safety assurance of a system, which should be comprehensible and well-structured. Typically, safety cases can be represented in plain text or graphic way, such as Goal Structuring Notation (GSN). After safety cases are developed, assessment of safety cases needs to be performed to check the quality of them. Besides, different roles are involved during this process: safety case developers and safety case  assessors . Objective . During the safety case assessment process, safety case assessors are required to evaluate the validity of a safety case and discuss their judgement with safety case developers. Currently, the outcome of a safety case assessment and the way of providing judgement are not systematically supported, which may cause inconsistent outcomes and wrong judgements. Therefore a systematic process of safety case assessment is required. Moreover, to support safety case assessment in an efficient and effective way, tool support is needed. Recently, a number of safety case editors are developed to support safety case development with the GSN. These editors support the development and management of safety cases. However, only a few editors offer limited functionalities for safety case assessment which is one of the crucial phases of the safety assurance process. This motivates us to develop a tool to support safety case assessment. Method . In this paper, we first identify two research questions. Resulting in two directions for further study have been identified: formalising the safety case assessment process and developing safety case tooling. First, we carried out a study on the state of art on safety case assessment and safety case tooling. Based on our findings, we formalize the  safety assessment process  by identifying the typical steps in safety case assessment. This assessment process can guide assessors to assess a safety case from a general level to a detailed level and provide reliable and understandable feedback to developers. Finally two industrial case studies are carried out to validate the proposed assessment process. Results . To support the proposed process, a prototype tool for safety case assessment was developed. A number of required features are implemented in the prototype tooling, among other it provides a complete and self-contained evaluation system to measure the quality of the safety case. Moreover, the case study validations show potential for facilitating safety assessment in practice. Conclusions . In this paper, two research questions are identified and the solutions of them are discussed. Then we propose a systematic approach for safety case assessment. For demonstration, a tool support is also developed. For validation two industrial case studies have been carried out to show the effectiveness of the proposed process.",
    "citation_count": "11",
    "year": "2017/05/01",
    "authors": [
        {
            "name": "Yaping Luo",
            "country": ""
        },
        {
            "name": "Mark van den Brand",
            "country": ""
        },
        {
            "name": "Zhuoao Li",
            "country": ""
        },
        {
            "name": "Arash Khabbaz Saberi",
            "country": ""
        }
    ],
    "keywords": []
}