{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000784",
    "title": "A traceable and revocable decentralized multi-authority privacy protection scheme for social metaverse",
    "abstract": "Intelligent identification of close friends is the mainstream approach to protect users’ multi-dimensional data in the social  metaverse . It provides a fine-grained matching service for users. However, users enjoy these benefits at the cost of leaking personal multi-dimensional data. The existing social metaverse-based intelligent identification of close friends privacy protection models typically use centralized mechanisms. This will limit users’ control over their data and make them vulnerable to  privacy leakage  and data misuse. To address these problems, this paper proposes a traceable and revocable decentralized multi-authority privacy protection scheme (TRDM) for social metaverse. The scheme establishes multiple authority centers based on users’ multi-dimensional data, overcoming  single point of failure  and  performance bottlenecks . In addition, TRDM partially hides access policies and supports multi-dimensional attribute access control in social metaverse environment. By introducing  leaf node  values of  binary trees , TRDM achieves the traceability and completes the  revocation  of malicious users by updating part of the  ciphertext . Security analysis and experiments show that TRDM satisfies the requirement of static security under the random prediction model and has better performance in the revocation of malicious users.",
    "citation_count": "22",
    "year": "2023/07/01",
    "authors": [
        {
            "name": "Shaobo Zhang",
            "country": ""
        },
        {
            "name": "Yuechao Wang",
            "country": ""
        },
        {
            "name": "Entao Luo",
            "country": ""
        },
        {
            "name": "Qin Liu",
            "country": ""
        },
        {
            "name": "Ke Gu",
            "country": ""
        },
        {
            "name": "Guojun Wang",
            "country": ""
        }
    ],
    "keywords": []
}