{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212100045X",
    "title": "A two-layer optimal scheduling framework for energy savings in a data center for Cyber–Physical–Social Systems",
    "abstract": "In recent years,  big data  and data analytics based on Cyber–Physical–Social Systems (CPSS) have become increasingly popular in providing valued services to humans. For many applications of CPSS, adequate computing infrastructure, which can be realized using powerful data centers (DCs), is needed. These DCs can then provide CPSS application developers with flexible and efficient High-Performance-Computing-Communications services. In DCs, the energy consumption of the cooling system which dissipates the heat generated by information technology (IT) devices should be optimized. Since the cooling system is one of the main energy consumers of DCs, optimization of its energy consumption can drastically reduce the operating costs while maintaining stable operation of the IT devices by efficient heat dissipation. Therefore, there is continuing development on improving the performance of cooling systems for DCs using different  optimization strategies . In particular, model-based optimization algorithms have had impressive advances, but their deployment in real physical systems often becomes difficult due to limited data, poor optimization efficiency, and potential operation risks. In this paper, we propose a two-layer optimal scheduling framework for room-level cooling of DCs. In the global layer, we use limited data to build a set of novel physically-based empirical models to achieve accurate  system energy  tracking. Then with defined equipment operating constraints, a  genetic algorithm  efficiently obtains the optimal plan of all equipment control while ensuring  safe system  operations. In the local layer, through interactions with the global layer, local precision  air conditioners  are regulated to stabilize the room temperature within a safe range. To test our solution in a real physical system, we deployed the two-layer optimal scheduling technique in the real DC cooling system of Postal Savings Bank of China in Hefei, China. Our solution achieved an impressive average reduction of 6.1% on cooling load factor.",
    "citation_count": "12",
    "year": "2021/06/01",
    "authors": [
        {
            "name": "Qingxia Zhang",
            "country": ""
        },
        {
            "name": "Chao Tang",
            "country": ""
        },
        {
            "name": "Tian Bai",
            "country": ""
        },
        {
            "name": "Zihao Meng",
            "country": ""
        },
        {
            "name": "Yuhao Zhan",
            "country": ""
        },
        {
            "name": "Junyu Niu",
            "country": ""
        },
        {
            "name": "M. Jamal Deen",
            "country": ""
        }
    ],
    "keywords": []
}