{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001601",
    "title": "A voice spoofing detection framework for IoT systems with feature pyramid and online knowledge distillation",
    "abstract": "Voice anti-spoofing is an important step for secure speaker verification in voice-enabled  Internet of Things  (IoT) systems. Most voice spoofing detection methods require significant computational costs and lack good generalization capability, making them unsuitable for deployment in IoT systems. To alleviate these problems, this work proposes a voice spoofing detection framework, which contains four parts, namely the compact model, the feature pyramid module (FPM), the feature aggregation module (FAM) and online  knowledge distillation . FPM leverages multi-scale features from different layers of the compact model and then produces four embeddings with different resolutions. Instead of using frequently-used aggregation operations, FAM adaptively assigns weights for the four embeddings above and thus gains the high-quality soft embedding that can optimize the compact model in reverse. Moreover, the Kullback–Leibler (KL) divergence is employed to minimize the difference between the embedding predicted by the compact model and the soft embedding, which enables the compact model to learn dark knowledge in an online manner. We carry out a series of experiments on LA and PA corpora of ASVspoof 2019 dataset. These comprehensive experiments show that the proposed framework gives better performance than other methods without sacrificing inference complexity, demonstrating the superiority of our framework.",
    "citation_count": "7",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Yeqing Ren",
            "country": ""
        },
        {
            "name": "Haipeng Peng",
            "country": ""
        },
        {
            "name": "Lixiang Li",
            "country": ""
        },
        {
            "name": "Xiaopeng Xue",
            "country": ""
        },
        {
            "name": "Yang Lan",
            "country": ""
        },
        {
            "name": "Yixian Yang",
            "country": ""
        }
    ],
    "keywords": []
}