{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122000522",
    "title": "A write-optimal and concurrent persistent dynamic hashing with radix tree assistance",
    "abstract": "Non-volatile memory (NVM) is expected to coexist with DRAM as a hybrid memory to fully exploit DRAM’s low read–write latency and NVM’s high density, persistence, and low standby power. However, existing persistent hashing schemes cannot efficiently reap the hybrid-memory benefits, and suffer from a significant performance penalty due to consistency guarantee. In this paper, we present an optimized extendible hashing variant for hybrid DRAM-NVM memory, named OP-HMEH. In our design,  hash buckets  are persisted in NVM while the directory is placed in DRAM for faster access. We also keep a radix-tree-structured directory in NVM to instantaneously recover the directory in DRAM after system crashes. To reduce consistency guarantee overhead, OP-HMEH designs a cross-KV mechanism to reorganize items which can avoid the use of expensive persist barriers in most cases. Meanwhile, we employ low-overhead structural modification operations schemes to further improve system performance. For  concurrency control , the original version uses two lock-based techniques. We then propose an optimistic concurrency strategy that exploits lightweight locking to protect segments and enables lock-free search/operations of directories by leveraging atomic instructions. On real Intel Optane  DCPMM , experimental results with YCSB workloads show that our OP-HMEH outperforms the state-of-the-art NVM-based hashing structures by up to 2.18 × . The optimized HMEH obtains higher insert performance than the original HMEH.",
    "citation_count": "11",
    "year": "2022/04/01",
    "authors": [
        {
            "name": "Xiaomin Zou",
            "country": ""
        },
        {
            "name": "Fang Wang",
            "country": ""
        },
        {
            "name": "Dan Feng",
            "country": ""
        },
        {
            "name": "Junhao Zhu",
            "country": ""
        },
        {
            "name": "Renzhi Xiao",
            "country": ""
        },
        {
            "name": "Nan Su",
            "country": ""
        }
    ],
    "keywords": []
}