{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762109000526",
    "title": "Access region cache with register guided memory reference partitioning",
    "abstract": "Wide-issue and high-frequency processors require not only a low-latency but also high-bandwidth memory system to achieve high performance. Previous studies have shown that using multiple small single-ported caches instead of a monolithic large multi-ported one for L1 data cache can be a scalable and inexpensive way to provide higher bandwidth. Various schemes on how to direct the memory references have been proposed in order to achieve a close match to the performance of an ideal multi-ported cache. However, most existing designs seldom take dynamic data access patterns into consideration, thus suffer from access conflicts within one cache and unbalanced loads between the caches. It is observed in this paper that if one can group data references defined in a program into several regions (access regions) to allow parallel accesses, providing separate small caches – access region cache for these regions may prove to have better performance. A register-guided memory reference partitioning approach is proposed and it effectively identifies these semantic regions and organizes them into multiple caches adaptively to maximize concurrent accesses. The base register name, not its content, in the memory reference instruction is used as a basic guide for instruction steering. With the  initial assignment  to a specific access region cache per the base register name, a reassignment mechanism is applied to capture the access pattern when program is moving across its access regions. In addition, a distribution mechanism is introduced to adaptively enable access regions to extend or shrink among the physical caches to reduce potential conflicts further. The simulations of SPEC CPU2000 benchmarks have shown that the semantic-based scheme can reduce the conflicts effectively, and obtain considerable  performance improvement  in terms of IPC; with 8 access region caches, 25–33% higher IPC is achieved for integer  benchmark programs  than a comparable 8-banked cache, while the benefit is less for floating-point benchmark programs, 19% at most.",
    "citation_count": "0",
    "year": "2009/10/01",
    "authors": [
        {
            "name": "Gyungho Le",
            "country": ""
        },
        {
            "name": "Yixin Shi",
            "country": ""
        }
    ],
    "keywords": []
}