{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002491",
    "title": "An efficient conditional privacy-preserving authentication scheme with scalable revocation for VANETs",
    "abstract": "In  Vehicular Ad Hoc Networks  (VANETs), secure information sharing between vehicles is critical for improving traffic efficiency and driving safety. However, existing identity-based communication protocols for VANETs face problems of over-reliance on ideal Tamper-Proof Devices (TPDs) and the efficiency of verifying multiple messages in areas of high traffic density. Besides, many existing  authentication schemes  suffer from the heavy workload of revoking malicious vehicles when they misbehave. For addressing these problems, we propose an efficient Identity-Based conditional privacy-preserving  authentication protocol , which does not rely on the ideal TPD. In our scheme, the System Secret Key (SSK) is not directly preloaded with the TPD, thus avoiding a system crash when a vehicle is corrupted. To revoke malicious vehicles’ identity, we propose an efficient key updating method based on Shamir’s secret sharing algorithm, which improves key-update efficiency from linear to logarithmic in the number of unrevoked vehicles. Moreover, our scheme is based on Elliptic Curves  Cryptosystem  and avoids  bilinear pairing  operation while supporting batch verification, enabling faster verification even when the number of signatures is increasing. According to the results of exhaustive comparative analysis, our proposed scheme is secure against key leakage attack and efficient in overhead of computation and communication compared to related schemes.",
    "citation_count": "10",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Leyan Shen",
            "country": ""
        },
        {
            "name": "Liangliang Wang",
            "country": ""
        },
        {
            "name": "Kai Zhang",
            "country": ""
        },
        {
            "name": "Jinguo Li",
            "country": ""
        },
        {
            "name": "Kefei Chen",
            "country": ""
        }
    ],
    "keywords": []
}