{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302247",
    "title": "An energy-efficient system on a programmable chip platform for cloud applications",
    "abstract": "Traditional cloud service providers build large data-centers with a huge number of connected commodity computers to meet the ever-growing demand on performance. However, the growth potential of these data-centers is limited by their corresponding energy consumption and thermal issues. Energy efficiency becomes a key issue of building large-scale cloud computing centers. To solve this issue, we propose a standalone SOPC (System on a Programmable Chip) based platform for cloud applications. We improve the energy efficiency for cloud computing platforms with two techniques. First, we propose a massive-sessions optimized TCP/IP hardware stack using a macro-pipeline architecture. It enables the hardware acceleration of pipelining execution of network packet offloading and application level data processing. This achieves higher energy efficiency while maintaining peak performance. Second, we propose a online dynamic scheduling strategy. It can reconfigure or shut down FPGA nodes according to workload variance to reduce the runtime energy consumption in a standalone SOPC based reconfigurable cluster system. Two case studies including a webserver application and a cloud based ECG (electrocardiogram) classification application are developed to validate the effectiveness of the proposed platform. Evaluation results show that our SOPC based cloud computing platform can achieve up to 418X improvement in terms of energy efficiency over commercial cloud systems.",
    "citation_count": "6",
    "year": "2017/05/01",
    "authors": [
        {
            "name": "Xu Wang",
            "country": ""
        },
        {
            "name": "Yongxin Zhu",
            "country": ""
        },
        {
            "name": "Yajun Ha",
            "country": ""
        },
        {
            "name": "Meikang Qiu",
            "country": ""
        },
        {
            "name": "Tian Huang",
            "country": ""
        },
        {
            "name": "Xueming Si",
            "country": ""
        },
        {
            "name": "Jiangxing Wu",
            "country": ""
        }
    ],
    "keywords": []
}