{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000360",
    "title": "An effective and verifiable secure aggregation scheme with privacy-preserving for federated learning",
    "abstract": "Federated learning has gained significant attention for enabling collaborative model training on distributed devices while maintaining data privacy. However, sharing gradients poses risks to local data privacy. This paper presents a secure aggregation scheme that addresses privacy protection and verifiability in federated learning. Firstly, a new homomorphic signature algorithm has been used to verify the aggregation results. For efficient verification, this algorithm can be divided into an offline phase and an online phase, where results are pre-computed during the offline phase and reused. Secondly, we use the symmetric homomorphic encryption lightweight algorithm to generate public keys, greatly accelerating the key generation process, making both encryption and decryption particularly efficient. Under this architecture, the aggregation server is unable to peek into the specific content of each gradient. The task management center cannot access the client’s individual gradient and can only process the aggregated information. This design ensures that the aggregation server and task management center can only access information within their permissions, effectively preventing information leakage. Finally, the security assessment indicates that our method satisfies the essential security standards for privacy-preserving federated learning. Comprehensive experimental evaluations conducted on real-world datasets reveal that the proposed solution demonstrates impressive efficiency in practical applications.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Rong Wang",
            "country": ""
        },
        {
            "name": "Ling Xiong",
            "country": ""
        },
        {
            "name": "Jiazhou Geng",
            "country": ""
        },
        {
            "name": "Chun Xie",
            "country": ""
        },
        {
            "name": "Ruidong Li",
            "country": ""
        }
    ],
    "keywords": []
}