{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122001576",
    "title": "An Efficient Certificateless Ring Signcryption Scheme With Conditional Privacy-Preserving in VANETs",
    "abstract": "As an ever-increasing ingredient of  intelligent transportation systems ,  vehicular ad hoc networks  (VANETs) can be leveraged to improve road safety and driving convenience. However, the extreme mobility and volatility of VANETs can arouse serious concerns about vehicle identity  privacy leakages  as well as the authenticity and confidentiality of safety messages in  vehicular communication . To cope with these issues, we propose a certificateless ring signcryption scheme with conditional privacy-preserving based on  elliptic curve cryptography , which can provide secure vehicular communication with low transmission latency and  communication overhead . Besides, by integrating a tracking mark into the safety message, we design a tracking algorithm that enables the trusted party to distinguish malicious vehicles from the ring member list. It realizes conditional privacy while avoiding the huge cost of vehicular storage resources. Through security analysis, this scheme is proven to be secure under the Elliptic curve  discrete logarithm  and Elliptic curve computational Diffie–Hellman assumptions in the  random oracle model . Finally, we implement the performance evaluations in terms of the computational overhead, the  communication bandwidth  and the  packet loss  rate. By utilizing the MIRACL cryptography library and the Veins simulation framework, the results illustrate that the proposed scheme can support an efficient and highly reliable communication protocol for safety-related applications in VANETs environment.",
    "citation_count": "36",
    "year": "2022/08/01",
    "authors": [
        {
            "name": "Rui Guo",
            "country": ""
        },
        {
            "name": "Lei Xu",
            "country": ""
        },
        {
            "name": "Xiong Li",
            "country": ""
        },
        {
            "name": "Yinghui Zhang",
            "country": ""
        },
        {
            "name": "Xuelei Li",
            "country": ""
        }
    ],
    "keywords": []
}