{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212100076X",
    "title": "An enhanced planned obsolescence attack by aging networks-on-chip",
    "abstract": "Despite of a controversial practice, having the key components of a product undergo accelerated aging has been a very effective approach for  planned obsolescence . All previous studies on  planned obsolescence  merely focused on the aging process itself; however, if a malfunctioned product due to aging is still under its warranty, the manufacturer suffers from financial losses in the form of customer refund and/or product repair. In this paper, we reveal an enhanced planned obsolescence attack that takes the warranty issue into consideration. More specifically, aging of an NoC-based many-core chip is set to be slow before the warranty expires, and its aging process gets accelerated afterwards. Such controlled aging is achieved by manipulating the  routing algorithm  that influences the lifetime distribution of the  NoC  nodes. The routing-induced aging process is also integrated with a profit model to evaluate the profit gained from chip aging. Experimental results show that, with the proposed planned obsolescence attack and the profit model, the manufacturer can increase its profit margin by 15.54%, 25.69%, and 53.36%, respectively, compared to devices under a scheme without any attack, a scheme that aggressively accelerates chip aging, and a scheme that employs a measure to mitigate chip aging. Overall speaking, the proposed attack can give the manufacturer a clear advantage over customer who can barely notice the existence of such business practices, and consequently, some advanced countermeasure schemes need to be developed to balance the interests of the two parties.",
    "citation_count": "3",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Yinyuan Zhao",
            "country": ""
        },
        {
            "name": "Xiaohang Wang",
            "country": ""
        },
        {
            "name": "Yingtao Jiang",
            "country": ""
        },
        {
            "name": "Liang Wang",
            "country": ""
        },
        {
            "name": "Amit Kumar Singh",
            "country": ""
        },
        {
            "name": "Letian Huang",
            "country": ""
        },
        {
            "name": "Mei Yang",
            "country": ""
        }
    ],
    "keywords": []
}