{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002442",
    "title": "An online dynamic pricing framework for resource allocation in edge computing",
    "abstract": "As more and more  Internet of Things  (IoT) applications move to the edge clouds, the scarce resource cannot satisfy the users’ ever-growing demands. Usually, users are charged by Edge Service Providers (ESPs) and access the service according to their preference and budget. The usual non-interactive transactions aggravate the imbalance and inefficiency of the edge resource. Moreover, the network dynamics and uncertain user demands pose a considerable challenge to the operator. To achieve the load balancing and satisfy the users’ satisfaction simultaneously, we put forward an online congestion-aware dynamic pricing based  resource allocation  method. We aim at maximizing the operator’s profit and leverage the two-timescale  Lyapunov optimization  technique to jointly balance the utility maximization and  system stability . More briefly, it allows the ESP operator to make the online decisions on how much the  computing units  should be charged at a coarse-grained timescale, when and where to serve the users’ demands at a fine-grained timescale. We conduct rigorous theoretical analysis and verify the performance guarantee of our online control algorithm. The simulation results show that the proposed method can effectively improve the total utility and control the deadline miss rate within a relatively low range. Meanwhile, it turns out to be robust to the uncertain request  estimation errors .",
    "citation_count": "4",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Sheng Chen",
            "country": ""
        },
        {
            "name": "Baochao Chen",
            "country": ""
        },
        {
            "name": "Xiaoyi Tao",
            "country": ""
        },
        {
            "name": "Xin Xie",
            "country": ""
        },
        {
            "name": "Keqiu Li",
            "country": ""
        }
    ],
    "keywords": []
}