{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376211830448X",
    "title": "An offloading method using decentralized P2P-enabled mobile edge servers in edge computing",
    "abstract": "Edge computing  has emerged as a promising infrastructure for providing elastic resources in the proximity of mobile users. Owing to resource limitations in mobile devices, offloading several computational tasks from mobile devices to mobile edge servers is the main means of improving the  quality of experience  of mobile users. In fact, because of the high speeds of moving vehicles on expressways, there would be numerous candidate mobile edge servers available for them to offload their computational workload. However, the selection of the mobile edge server to be utilized and how much computation should be offloaded to meet the corresponding task deadlines without large computing bills are topics that have not been discussed much. Furthermore, with the increasing deployment of mobile edge servers, their centralized management would cause certain performance issues. In order to address these challenges, we firstly apply peer-to-peer networks to manage geo-distributed mobile edge servers. Secondly, we propose a new deadline-aware and cost-effective offloading approach, which aims to improve the offloading efficiency for vehicles and allows additional tasks to meet their deadlines. The proposed approach was validated for its feasibility and efficiency by means of extensive experiments, which are presented in this paper.",
    "citation_count": "47",
    "year": "2019/03/01",
    "authors": [
        {
            "name": "Wenda Tang",
            "country": ""
        },
        {
            "name": "Xuan Zhao",
            "country": ""
        },
        {
            "name": "Wajid Rafique",
            "country": ""
        },
        {
            "name": "Lianyong Qi",
            "country": ""
        },
        {
            "name": "Wanchun Dou",
            "country": ""
        },
        {
            "name": "Qiang Ni",
            "country": ""
        }
    ],
    "keywords": []
}