{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000333",
    "title": "Blockchain-assisted handover authentication for intelligent telehealth in multi-server edge computing environment",
    "abstract": "Intelligent  telehealth system  (ITS) provides patients and medical institutions with a lot of convenience, medical institutions can achieve medical services for patients in time through monitored health data. However, as the scope of people's daily activities extends, the traditional single-server architecture is no longer applicable. To deal with this problem, a multi-server architecture has been proposed recently while there remains security and privacy challenges, including  handover   authentication . In this paper, we investigate a blockchain-assisted handover authentication and key agreement scheme for ITS in a multi-server  edge computing  environment. Specifically, we first propose a novel handover authentication model of ITS with multi-server edge  computing architecture . Second, the proposed handover  authentication scheme  allows the authenticated server to assist users subsequently authenticate with other server, thereby achieving interactions with the server anytime and anywhere with low overhead. Finally,  blockchain  technology and strong  anonymity  mechanism are introduced to protect users’ privacy strictly. To our best knowledge, the proposed scheme is the first in the literature to provide efficient authentication, strict anonymity and  computational load  transfer simultaneously. The security analysis and performance evaluation show that our scheme can not only satisfy the security requirements but also achieve higher efficiency in computation and communication cost.",
    "citation_count": "57",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Wenming Wang",
            "country": ""
        },
        {
            "name": "Haiping Huang",
            "country": ""
        },
        {
            "name": "Lingyan Xue",
            "country": ""
        },
        {
            "name": "Qi Li",
            "country": ""
        },
        {
            "name": "Reza Malekian",
            "country": ""
        },
        {
            "name": "Youzhi Zhang",
            "country": ""
        }
    ],
    "keywords": []
}