{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001340",
    "title": "CPU frequency scheduling of real-time applications on embedded devices with temporal encoding-based deep reinforcement learning",
    "abstract": "Small devices are frequently used in  IoT  and smart-city applications to perform periodic dedicated tasks with soft deadlines. This work focuses on developing methods to derive efficient power-management methods for periodic tasks on small devices. We first study the limitations of the existing Linux built-in methods used in small devices. We illustrate three typical workload/system patterns that are challenging to manage with Linux’s built-in solutions. We develop a reinforcement-learning-based technique with temporal encoding to derive an effective  DVFS  governor even with the presence of the three system patterns. The derived governor uses only one performance counter, the same as the built-in Linux mechanism, and does not require an explicit task model for the workload. We implemented a prototype system on the Nvidia Jetson Nano Board and experimented with it with six applications, including two self-designed and four  benchmark applications . Under different deadline constraints, our approach can quickly derive a  DVFS  governor that can adapt to performance requirements and outperform the built-in Linux approach in  energy saving . On  Mibench  workloads, with performance slack ranging from 0.04 s to 0.4 s, the proposed method can save 3%–11% more energy compared to  Ondemand . AudioReg and FaceReg applications tested have 5%–14% energy-saving improvement. We have open-sourced the implementation of our in-kernel quantized  neural network  engine. The codebase can be found at:  https://github.com/coladog/tinyagent .",
    "citation_count": "1",
    "year": "2023/09/01",
    "authors": [
        {
            "name": "Ti Zhou",
            "country": ""
        },
        {
            "name": "Man Lin",
            "country": ""
        }
    ],
    "keywords": []
}