{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121001892",
    "title": "Decentralized and expressive data publish-subscribe scheme in cloud based on attribute-based keyword search",
    "abstract": "Data publish-subscribe scheme is a valuable approach to share and retrieve data from cloud platforms selectively. However, the common practice of standard encryption hinders the effective keyword-based  data subscription  over outsourced data. Attribute-based keyword search (ABKS), which fulfills the functionality of attribute-based encryption and searchable encryption, is a promising cryptographic primitive to construct secure data publish-subscribe scheme. In this paper, for the first time, we propose a decentralized and expressive CP-ABKS scheme with computation outsourcing and collusion resistance. Then we construct a novel data publish-subscribe scheme based on the proposed CP-ABKS to realize secure and flexible data sharing among multiple users. Both the access and subscription policies are expressed with the Linear Secret Sharing Scheme structure that can be derived from any monotonic Boolean formula and any threshold gate. To protect the keyword privacy, the subscription policy is partially publicized, and a keyword localization method is designed to enable the server to reconstruct the subscription policy and execute the search protocol in linear time. Additionally, the proposed scheme adopts online/offline encryption and outsourced decryption in a fully decentralized setting. Security analysis and performance evaluation show that our scheme achieves a good balance between security goals and practical efficiency.",
    "citation_count": "7",
    "year": "2021/10/01",
    "authors": [
        {
            "name": "Qian Xu",
            "country": ""
        },
        {
            "name": "Qing Zhang",
            "country": ""
        },
        {
            "name": "Bo Yu",
            "country": ""
        },
        {
            "name": "Nandi Shi",
            "country": ""
        },
        {
            "name": "Changshuai Wang",
            "country": ""
        },
        {
            "name": "Wei He",
            "country": ""
        }
    ],
    "keywords": []
}