{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762119300104",
    "title": "Dynamic Task Mapping and Scheduling with Temperature-Awareness on Network-on-Chip based Multicore Systems",
    "abstract": "Technology scaling has enabled integration of a large number of intellectual property cores, memory units and processing elements on a  single chip . This has led to the evolution of  multicore systems . In recent years, these systems have gained popularity as execution platforms for real-time applications. However, due to the close spacing of the cores and uneven heat dissipation among the processors of the  multicore platform , thermal hotspots are formed. Ensuring thermal safety in real-time systems is a challenging task, especially when various applications are executed with different timing constraints. In real-time dynamic systems, applications unknown at design-time, are submitted by users at runtime. In order to perform on-the-fly task assignment to the processors of the multicore platform, different  dynamic resource allocation  approaches are reported in the literature. However, most of the dynamic task allocation approaches lack in thermal awareness and do not consider thermal safety of the chip. Also, most of the existing thermal-aware task mapping methods rely on offline thermal analysis which is either unavailable in dynamic scenarios or is computationally too expensive for providing end-to-end thermal-aware solution at runtime. In this work, we propose an improved algorithm for dynamic thermal-aware task mapping and scheduling using a non-profiling based strategy for NoC based multi-core systems. By using a combination of threshold based  thermal management  scheme and dynamic task (re)allocation, the proposed thermal-aware approach helps to maintain the thermal safety of the chip. Simulation results demonstrate that the proposed algorithm achieves 25.3% and 45.6% reduction in chip peak temperature compared to recent dynamic task allocation approaches ATM [1] and DEAMS [2] respectively. Also, the proposed thermal-aware strategy satisfies the task deadline while reducing the  average packet delay  of the allocated applications. When compared to other thermal-aware methods such as ATM [1] and TAPP [3], the proposed strategy improves the deadline satisfaction of the tasks by 37.8% and 67.3% respectively.",
    "citation_count": "15",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Suraj Paul",
            "country": ""
        },
        {
            "name": "Navonil Chatterjee",
            "country": ""
        },
        {
            "name": "Prasun Ghosal",
            "country": ""
        }
    ],
    "keywords": []
}