{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001820",
    "title": "Dynamic forward secure searchable encryption scheme with phrase search for smart healthcare",
    "abstract": "The phrase searchable encryption scheme improves search efficiency and accuracy by searching a set of consecutive keywords from ciphertext. However, most current phrase searchable encryption schemes still don't support dynamic data updates in practical application scenarios such as smart healthcare due to forward security issues. In this article, a dynamic forward secure searchable encryption scheme with phrase search for smart healthcare systems is proposed. On the one hand, we adopt a state chain structure to construct an inverted index, which contains the location of keywords so as to achieve phrase search. On the other hand, we have added a modification operation that modifies the location of keywords directly by traversing the inverted index to achieve indexes update. In this way, the efficiency of data updating can be raised greatly because the update operation of first-delete-then-add is avoided in the previous phrase search scheme. The scheme is proved to satisfy the forward security in the leaked search pattern and access pattern since the server cannot know the updated state of updated files in the state chain index structure which is randomly generated by the client. Experimental results show that the proposed scheme has higher search accuracy and efficiency which can save at least 50 ms in search time compared to other related schemes.",
    "citation_count": "0",
    "year": "2023/11/01",
    "authors": [
        {
            "name": "Xixi Yan",
            "country": ""
        },
        {
            "name": "Chengfu Zheng",
            "country": ""
        },
        {
            "name": "Yongli Tang",
            "country": ""
        },
        {
            "name": "Yachao Huo",
            "country": ""
        },
        {
            "name": "Minglu Jin",
            "country": ""
        }
    ],
    "keywords": []
}