{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762113001483",
    "title": "Early-phase performance exploration of embedded systems with ABSOLUT framework",
    "abstract": "Future interactive embedded systems will support a large number of applications providing users with services related to e.g. telecommunication, audio and video,  digital television , internet and navigation. To accommodate these performance demanding applications, the digital processing architectures will evolve from current system-on-chips to massively parallel computers consisting of heterogeneous subsystems connected by a network-on-chip. More flexibility, scalability and modularity are needed from the embedded devices. Consequently, the complexity of system design will increase by orders of magnitude. New methods and tools are needed for the performance evaluation of future embedded systems due to the increasing system complexity. This paper presents a high-level performance  modelling and simulation  approach called ABSOLUT that alleviates exploration complexity by using abstract virtual system models. The characteristics of the applications are abstracted to workload models that at the bottom level consist of instruction-like primitives. The workload models can be created from application specifications, measurement results, execution traces or source code. The complexity of the execution platform models is reduced since the processing elements need not be modelled in detail and data transfers and storage are simulated only from the performance point of view. The approach enables early evaluation, since the modelling and simulation of complete systems does not require mature hardware or software to exist. ABSOLUT has been applied to a number of  case studies  including mobile phone usage, MP3 playback,  MPEG4  encoding and decoding, 3D gaming,  virtual network computing  and parallel  software defined radio  applications. The platforms modelled are either existing or future designs for both embedded systems and  personal computers . In several cases, the results obtained from simulations are compared to measurements from real platforms, which reveal an average difference of 12% in the results. This exceeds the accuracy requirements expected from virtual system based simulation approaches intended for early evaluation. In this paper, the most recent enhancements of the ABSOLUT methodology and tool framework are applied in a FFMPEG case study on OMAP4 platform model. The simulation results are compared with those obtained from the execution on an OMAP4-based PandaBoard.",
    "citation_count": "3",
    "year": "2013/11/01",
    "authors": [
        {
            "name": "Janne Vatjus-Anttila",
            "country": ""
        },
        {
            "name": "Jari Kreku",
            "country": ""
        },
        {
            "name": "Juha Korpi",
            "country": ""
        },
        {
            "name": "Subayal Khan",
            "country": ""
        },
        {
            "name": "Jukka Saastamoinen",
            "country": ""
        },
        {
            "name": "Kari Tiensyrjä",
            "country": ""
        }
    ],
    "keywords": []
}