{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123000139",
    "title": "Edge-aided searchable data sharing scheme for IoV in the 5G environment",
    "abstract": "The development of 5G technology provides huge potential for the  Internet of Vehicles  (IoV). In the IoV scenario, the secure exchange of traffic warning data is necessary to guarantee the safety of pedestrians, vehicles, and public transport facilities. However, there remain a series of challenging issues to achieve data secure sharing while ensuring efficiency. Current solutions such as the data outsourcing storage of traditional centralized cloud servers may cause  information leakage  due to their incomplete credibility. To address these problems mentioned above, this paper proposes an edge-aided searchable data sharing scheme based on  blockchain  for IoV in a 5G environment. First, the proposed scheme stores the search index of the keyword and the hash value of the data  ciphertext  on the  blockchain  to ensure its integrity and authenticity, and the  smart contract  automatically verifies the search trapdoor. And then, an  edge caching  mechanism is designed to quickly feedback on users’ retrieval needs based on a cloud-edge collaboration model. In addition, attribute-based searchable encryption is used to ensure that only the users who meet the access attributes and policy can decrypt the encrypted traffic warning data, which can achieve fine-grained access control and  keyword search  simultaneously. Finally, security analysis and performance evaluation demonstrate that our scheme is secure and more efficient compared with other schemes.",
    "citation_count": "14",
    "year": "2023/03/01",
    "authors": [
        {
            "name": "Xudong Tan",
            "country": ""
        },
        {
            "name": "Wei Cheng",
            "country": ""
        },
        {
            "name": "Haiping Huang",
            "country": ""
        },
        {
            "name": "Tianyi Jing",
            "country": ""
        },
        {
            "name": "Haiyan Wang",
            "country": ""
        }
    ],
    "keywords": []
}