{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120302186",
    "title": "Edge-based auditing method for data security in resource-constrained Internet of Things",
    "abstract": "The explosive generation of  Internet of Things  (IoT) data calls for  cloud service providers  (CSP) to further provide more secure and reliable transmission, storage, and management services. This requirement, however, goes against the honest and curious nature of CSP, to the extent that existing methods introduce the third-party audit (TPA) to check  data security  in the cloud. TPA solves the problem of unreliable CSP but puts a heavy burden on lightweight users because of the sheer amount of the pre-audit  data processing  work. In this paper, we establish an audit model based on a designed  binary tree  assisted by  edge computing , which provides computing capability for the resource-constrained terminals. The data pre-processing task is offloaded to the edge, which reduces computing load and improves the efficiency of task processing. We propose an improved correlation mechanism between data blocks and nodes on the binary tree so that all nodes on the binary tree can be fully utilized while existing methods use only  leaf nodes  and thus are required to establish multiple binary trees. Moreover, to improve audit efficiency, the binary tree in the  audit process  is designed to be self-balanced. In experiments, we compare our methods with the traditional method and experimental results show that the proposed mechanism is more effective to store and manage  big data , which is conducive to providing users with more secure IoT services.",
    "citation_count": "64",
    "year": "2021/03/01",
    "authors": [
        {
            "name": "Tian Wang",
            "country": ""
        },
        {
            "name": "Yaxin Mei",
            "country": ""
        },
        {
            "name": "Xuxun Liu",
            "country": ""
        },
        {
            "name": "Jin Wang",
            "country": ""
        },
        {
            "name": "Hong-Ning Dai",
            "country": ""
        },
        {
            "name": "Zhijian Wang",
            "country": ""
        }
    ],
    "keywords": []
}