{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122000029",
    "title": "Efficient and accurate identification of missing tags for large-scale dynamic RFID systems",
    "abstract": "The future real-world applications is bound up with  Radio frequency identification  (RFID) technology as it develops dramatically fast, especially in the field of warehouse management and inventory control, etc. In such applications, identifying missing tags to determine which goods are missing is an important issue. However, since only static scenarios with no new tag movement are considered, existing missing tag identification protocols hardly work well in more common dynamic scenarios where there are tags entering the system or missing frequently. In highly dynamic  RFID  systems, identifying missing tags becomes more challenge under the interference of unknown tags. Existing methods suppress this interference by filtering unknown tags, which is time-consuming and inefficient. In this paper, for high dynamic  RFID systems , we propose an efficiently and accurately protocol HDMI to identify missing tags. By combining the reply slot location of the tags and the reply bits, HDMI identifies missing tags and filters the unknown tags simultaneously, which maximizes the slot utilization. We also optimize the setting of key parameters to reduce  execution time  while ensuring  recognition accuracy . Simulation results show that, compared with state-of-art protocols, HDMI has a higher accuracy rate and better time efficiency in identifying missing tags.",
    "citation_count": "10",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Xinning Chen",
            "country": ""
        },
        {
            "name": "Kehua Yang",
            "country": ""
        },
        {
            "name": "Xuan Liu",
            "country": ""
        },
        {
            "name": "Ying Xu",
            "country": ""
        },
        {
            "name": "Juan Luo",
            "country": ""
        },
        {
            "name": "Shigeng Zhang",
            "country": ""
        }
    ],
    "keywords": []
}