{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124000717",
    "title": "Efficient privacy-preserving Gaussian process via secure multi-party computation",
    "abstract": "Gaussian  processes (GPs), known for their flexibility as non-parametric models, have been widely used in practice involving sensitive data (e.g., healthcare, finance) from multiple sources. With the challenge of data isolation and the need for high-performance models, how to jointly develop privacy-preserving GP for multiple parties has emerged as a crucial topic. In this paper, we propose a new  privacy-preserving GP  algorithm, namely PP-GP, which employs  secret sharing  (SS) techniques. Specifically, we introduce a new SS-based exponentiation operation (PP-Exp) through confusion correction and an SS-based matrix inversion operation (PP-MI) based on  Cholesky decomposition . However, the advantages of the GP come with a great computational burden and space cost. To further enhance the efficiency, we propose an efficient split learning framework for privacy-preserving GP, named Split-GP, which demonstrably improves performance on large-scale data. We leave the private data-related and SMPC-hostile computations (i.e., random features) on data holders, and delegate the rest of SMPC-friendly computations (i.e., low-rank approximation, model construction, and prediction) to semi-honest servers. The resulting algorithm significantly reduces computational and communication costs compared to PP-GP, making it well-suited for application to large-scale datasets. We provide a theoretical analysis in terms of the correctness and security of the proposed SS-based operations. Extensive experiments show that our methods can achieve competitive performance and efficiency under the premise of preserving privacy.",
    "citation_count": "2",
    "year": "2024/06/01",
    "authors": [
        {
            "name": "Shiyu Liu",
            "country": ""
        },
        {
            "name": "Jinglong Luo",
            "country": ""
        },
        {
            "name": "Yehong Zhang",
            "country": ""
        },
        {
            "name": "Hui Wang",
            "country": ""
        },
        {
            "name": "Yue Yu",
            "country": ""
        },
        {
            "name": "Zenglin Xu",
            "country": ""
        }
    ],
    "keywords": []
}