{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118304491",
    "title": "Electromagnetic radiation based continuous authentication in edge computing enabled internet of things",
    "abstract": "With the rapid proliferation of  Internet of Things , the centralized cloud faces the performance problems caused by remote network access and real-time services. To ensure  good performance , edge  computing paradigm  emerges, and requires a secure  authentication  between edge host and cloud server to safeguard resources against any illegitimate access. Securing edge host authentication is an effective method and cornerstone to protect the information security in  edge computing . Existing methods most recognize an entity's identity by password only once at the time of initial stage, which may lead to security problem. Continuous authentication as a novel authentication modality has the ability to alleviate this issue. Unlike the authentication operating merely at point-of-entry, a continuous edge host  authentication method  is proposed on the basis of  electromagnetic radiation  which reflects the behavioral characteristics of edge host with heterogeneous hardware. We demonstrate the feasibility of the proposed method through analysis of success rate from ten thousand waterfall  spectrograms , and experimental results show that the average success rate of 95% has been achieved by  support vector machine  combining multiple features.",
    "citation_count": "17",
    "year": "2019/06/01",
    "authors": [
        {
            "name": "Jun Wang",
            "country": ""
        },
        {
            "name": "Mingtao Ni",
            "country": ""
        },
        {
            "name": "Fusheng Wu",
            "country": ""
        },
        {
            "name": "Shubo Liu",
            "country": ""
        },
        {
            "name": "Jun Qin",
            "country": ""
        },
        {
            "name": "Rongbo Zhu",
            "country": ""
        }
    ],
    "keywords": []
}