{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000189",
    "title": "Fast post-quantum private set intersection from oblivious pseudorandom function for mobile social networks",
    "abstract": "Mobile social networks have become integral to our daily lives, transforming communication methods and facilitating social interactions. With technological advancements, users generate vast amounts of valuable and sensitive personal data, which is stored on servers to enable instant information sharing. To protect the sharing data, each platform has implemented many techniques such as end-to-end encryption mechanisms, fully homomorphic encryption, etc. However, these approaches face several security and privacy challenges, including potential leaks of user data, vulnerabilities in encryption that expose privacy ciphertexts to probabilistic attacks, and threats posed by future quantum computers. Aimed at the above, we introduce a private set intersection (PSI) protocol based on oblivious pseudorandom functions (OPRF) under ring LPR problem from lattice. The proposed perturbed pseudorandom generator not only enhances the PSI’s resistance to probabilistic attacks, but also leads to generate a more efficient OPRF and a PSI. It boasts a time complexity of  O ( n log n )  and is superior to existing well-known fast post-quantum PSI protocol operating at  O ( m n log ( m n ) ) , where  m  is the bit length of the cryptographic modulus and  n  represents the dimension of the security parameter. Simulation experiments and security analyses demonstrate that our proposal effectively preserves user privacy, ensures collusion resilience, verifies computation results, and maintains low computational costs. Finally, as an expansion of our OPRF, we also give a fast private information retrieval (PIR) protocol.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Zhuang Shan",
            "country": ""
        },
        {
            "name": "Leyou Zhang",
            "country": ""
        },
        {
            "name": "Qing Wu",
            "country": ""
        },
        {
            "name": "Qiqi Lai",
            "country": ""
        },
        {
            "name": "Fuchun Guo",
            "country": ""
        }
    ],
    "keywords": []
}