{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376212100031X",
    "title": "Fault-Tolerant Application Mapping on Mesh-of-Tree based Network-on-Chip",
    "abstract": "Network-on-Chip (NoC) has been considered as an efficient communication infrastructure to support Multi-Processor System-on-Chip (MPSoC) design requirements for future generation computing. With the increased application requirements and rapid scale down in VLSI technology, the probability of forming thermal hotspots in the processing elements is relatively high which may lead to system failure. Therefore, efficient fault-tolerant techniques are required to improve the reliability of a system by addressing the failures that may occur at different component levels in NoC. This paper proposes fault-tolerant NoC design methodologies to address the core failures that may occur in an application. An  Integer Linear Programming  (ILP) based mathematical formulation and  Particle Swarm Optimization  (PSO) based evolutionary approach have been proposed to perform fault-tolerant mapping using spare cores onto the Mesh-of-Tree (MoT) network. In the event of core failures, spare cores are used to enhance system reliability. Most of the approaches have fixed the position of spare core in the networks while performing fault-tolerant application-mapping onto NoCs. In contrast to fixing the position of spare core in MoT networks, flexibility is provided by our approaches ILP and PSO to place the spare core in the network. We have experimented with  multimedia applications  and synthetic applications generated using TGFF tool in static and dynamic environments. In static environment, the experiments are performed (a) by scaling the MoT network size with fixed router fault-percentage, (b) by varying the router fault-percentage in the MoT network, and (c) by considering multiple failed cores in the application. In dynamic environment, the experiments are carried out using cycle-accurate NoC simulator and performance parameters namely  network latency , throughput, and  power consumption  are analyzed. The experimental results have shown significant improvements using our approach over the approaches proposed in the literature.",
    "citation_count": "18",
    "year": "2021/06/01",
    "authors": [
        {
            "name": "P. Veda Bhanu",
            "country": ""
        },
        {
            "name": "Soumya J.",
            "country": ""
        }
    ],
    "keywords": []
}