{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302053",
    "title": "FPGA Implementation Issues of a Flexible Synchronizer Suitable for NC-OFDM-Based Cognitive Radios",
    "abstract": "This paper presents a flexible timing  synchronization  scheme alongside the hardware implementation issues on an Altera Stratix-V  Field Programmable Gate Array  (FPGA) device. The core content of the  synchronizer  is based on Finite Impulse Response (FIR) filter which operates as a multicorrelator on demand. The term “flexibility” refers to a specific part of the  synchronizer  where the multicorrelator reconfigures its FIR filter block on-the-fly by employing  Partial Reconfiguration  (PR) feature. Moreover, different implementations have been evaluated for the multicorrelator, including MultiplierLess (ML) approach (an  approximate computing  technique only for  autocorrelation  purpose) along with the Direct From as well as the Transposed, Parallel, and Pipelined-Parallel Direct Form FIR filters. All the developed architectures are compared to each other in terms of  power consumption ,  silicon  area, and maximum frequency. Preliminary synthesis results show that the ML approach achieves better performance (including 94% less  power dissipation , 75% less logic utilization as well as 67% fewer registers) than other architectures when performing  autocorrelation function . Furthermore, the critical path is analyzed and appropriate optimization techniques (such as  DSP  register packing and intermediate register insertion) are applied to the best candidates of the architectures mentioned. As the best results, 2.83× speed-up, 56.57% less logic utilization along with 38.86% fewer registers are achieved for different architectures. Accordingly, we discover that the parallel form, as well as the pipelined-parallel one, achieve more interesting results than the transposed version in most of the cases.",
    "citation_count": "8",
    "year": "2017/05/01",
    "authors": [
        {
            "name": "Farid Shamani",
            "country": ""
        },
        {
            "name": "Roberto Airoldi",
            "country": ""
        },
        {
            "name": "Vida Fakour Sevom",
            "country": ""
        },
        {
            "name": "Tapani Ahonen",
            "country": ""
        },
        {
            "name": "Jari Nurmi",
            "country": ""
        }
    ],
    "keywords": []
}