{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122002673",
    "title": "Fully homomorphic encryption-based privacy-preserving scheme for cross edge blockchain network",
    "abstract": "The growing development of  blockchain  technology has led to the emergence of blockchain applications for various fields. One significant use of  blockchain technology  is the edge blockchain network, which is a blockchain network made up of connected edge computer nodes. However, on-chain privacy data leaking is a concern on the present edge blockchain network. The demand for collaborative interaction amongst  edge computing  nodes in many domains is growing more critical as the  Internet of Things  continues to evolve. In this paper, we propose a data privacy-preserving scheme for cross edge blockchain network, which uses the privacy protection technology of  fully homomorphic encryption  to encrypt the data on the chain to ensure the “available and invisible” of the on-chain privacy data. First of all, this paper designs a cross edge blockchain model and give details of the interaction and privacy computing process in the cross edge blockchain. a distributed private key sharing scheme is designed in this work to provide the relay chain’s auditable functionality. Subsequently, we describe the security of the scheme in detail. Finally, we implement this scheme using the CKKS algorithm. Through simulation experiments, we evaluate the performance of the  instantiation  process of the scheme. The test results manifest that the proposed scheme has excellent practicability and security.",
    "citation_count": "27",
    "year": "2023/01/01",
    "authors": [
        {
            "name": "Zhaofeng Ma",
            "country": ""
        },
        {
            "name": "Jingyu Wang",
            "country": ""
        },
        {
            "name": "Keke Gai",
            "country": ""
        },
        {
            "name": "Pengfei Duan",
            "country": ""
        },
        {
            "name": "Yuqing Zhang",
            "country": ""
        },
        {
            "name": "Shoushan Luo",
            "country": ""
        }
    ],
    "keywords": []
}