{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302892",
    "title": "Fuzzy logic based objective image quality assessment with FPGA implementation",
    "abstract": "This paper analyzes the application of different  machine learning techniques  for objective  Image Quality Assessment  (IQA), and proposes an implementation on  Field Programmable Gate Array  (FPGA) system of final model generated by one of these techniques. The quality database TID2013 used for the construction of models contains a set of independent variables (quality metrics) and human rating  Mean Opinion Score  (MOS) extract from image. The first step in the modeling process deals with the selection of an accurate set of image metrics that are used as the input data of the model. The selected input metric data are used with the MOS as entries of  machine learning methods  to produce the final models. Different  machine learning  methods are evaluated and their performances in terms of image quality prediction are compared. The proposed methods consist of two  classification techniques  (Linear  Discriminant Analysis  and k-Nearest Neighbors) and four  nonlinear regressions  approaches (Artificial  Neural Network , Non-Linear  Polynomial Regression ,  decision tree  and fuzzy logic). Both the stability and the robustness of designed models are evaluated by using a variant of Monte-Carlo cross-validation (MCCV) with 1000 randomly chosen validation sets. The simulation results demonstrate that fuzzy logic model has the highest stable behavior and the best agreement with  human visual perception . Thus implemented models consist of the final models produced by fuzzy logic modeling using Gaussian and Generalize Bell membership functions. The proposal implementation is done on Kintex 7 FPGA by using Xilinx Vivado and Vivado HLS tool.",
    "citation_count": "21",
    "year": "2018/01/01",
    "authors": [
        {
            "name": "Ghislain Takam Tchendjou",
            "country": ""
        },
        {
            "name": "Emmanuel Simeu",
            "country": ""
        },
        {
            "name": "Rshdee Alhakim",
            "country": ""
        }
    ],
    "keywords": []
}