{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116300248",
    "title": "High performance real-time scheduling of multiple mixed-criticality functions in heterogeneous distributed embedded systems",
    "abstract": "The architectures of high-end embedded system have evolved into heterogeneous distributed integrated architectures. The scheduling of multiple distributed mixed-criticality functions in heterogeneous distributed embedded systems is a considerable challenge because of the different requirements of systems and functions. Overall scheduling length (i.e., makespan) is the main concern in  system performance , whereas deadlines represent the major timing constraints of functions. Most algorithms use the fairness policies to reduce the makespan in heterogeneous distributed systems. However, these fairness policies cannot meet the deadlines of most functions. Each function has different criticality levels (e.g., severity), and missing the deadlines of certain high-criticality functions may cause fatal injuries to people under this situation. This study first constructs related models for heterogeneous distributed embedded systems. Thereafter, the criticality certification, scheduling framework, and fairness of multiple heterogeneous earliest finish time (F_MHEFT) algorithm for heterogeneous distributed embedded systems are presented. Finally, this study proposes a novel algorithm called the deadline-span of multiple heterogeneous earliest finish time (D_MHEFT), which is a scheduling algorithm for multiple mixed-criticality functions. The F_MHEFT algorithm aims at improving the performance of systems, while the D_MHEFT algorithm tries to meet the deadlines of more high-criticality functions by sacrificing a certain performance. The experimental results demonstrate that the D_MHEFT algorithm can significantly reduce the deadline miss ratio (DMR) and keep satisfactory performance over existing methods.",
    "citation_count": "63",
    "year": "2016/10/01",
    "authors": [
        {
            "name": "Guoqi Xie",
            "country": ""
        },
        {
            "name": "Gang Zeng",
            "country": ""
        },
        {
            "name": "Liangjiao Liu",
            "country": ""
        },
        {
            "name": "Renfa Li",
            "country": ""
        },
        {
            "name": "Keqin Li",
            "country": ""
        }
    ],
    "keywords": []
}