{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762122000200",
    "title": "Hybrid differential privacy based federated learning for Internet of Things",
    "abstract": "Wireless sensor networks  have been widely used to achieve fine-grained information collection. However, numerous data acquisition and processing of sensors bring some privacy issues.  Federated learning  is a promising and privacy-friendly framework that trains a model across multiple devices or edge nodes holding local data samples without  transferring  their data to the server. It is not enough to protect privacy only by maintaining  data locality , so  differential privacy  technology is often used to protect privacy in federated learning. However, different users have different privacy requirements, so it is inappropriate to use the same privacy protection scheme, assuming that all users trust or distrust the server. The former has poor accuracy, while the latter has poor privacy. This paper proposes a secure and reliable federated learning algorithm by integrating hybrid differential privacy into federated learning. We divide users into two categories according to their different privacy needs. In addition, we analyze the convergence and privacy bounds of the proposed algorithm and propose an adaptive gradient clip scheme and improved composition method to reduce the effects of noise and clip, respectively. The validity of the algorithm is verified by theoretical analysis and experimental evaluation on real-world datasets.",
    "citation_count": "33",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Wenyan Liu",
            "country": ""
        },
        {
            "name": "Junhong Cheng",
            "country": ""
        },
        {
            "name": "Xiaoling Wang",
            "country": ""
        },
        {
            "name": "Xingjian Lu",
            "country": ""
        },
        {
            "name": "Jianwei Yin",
            "country": ""
        }
    ],
    "keywords": []
}