{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000151",
    "title": "Improving in-memory file system reading performance by fine-grained user-space cache mechanisms",
    "abstract": "Nowadays, as the memory capacity of servers become larger and larger, distributed in-memory file systems, which enable applications to interact with data at fast speed, have been widely used. However, the existing distributed in-memory file systems still face the problem of low data access performance in small data reading, which seriously reduce their usefulness in many important  big data  scenarios. In this paper, we analyze the factors that affect the performance of reading in-memory files and propose a two-layer user space cache management mechanism: in the first layer, we cache data packet references to reduce frequent page fault interruptions (packet-level cache); in the second layer, we cache and manage small file data units to avoid redundant inter-process communications (object-level cache). We further design a fine-grained caching model based on the submodular function  optimization theory , for efficiently managing the variable-length cache units with partially overlapping fragments on the client side. Experimental results on synthetic and real-world workloads show that compared with the existing cutting-edge systems, the  first level cache  can double the reading performance on average, and the  second level cache  can improve random reading performance by more than 4 times. Our caching strategies also outperform the cutting-edge cache algorithms over 20% on hit ratio. Furthermore, the proposed client-side  caching framework  idea has been adopted by the Alluxio  open source community , which shows the practical benefits of this work.",
    "citation_count": "6",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Rong Gu",
            "country": ""
        },
        {
            "name": "Chongjie Li",
            "country": ""
        },
        {
            "name": "Haipeng Dai",
            "country": ""
        },
        {
            "name": "Yili Luo",
            "country": ""
        },
        {
            "name": "Xiaolong Xu",
            "country": ""
        },
        {
            "name": "Shaohua Wan",
            "country": ""
        },
        {
            "name": "Yihua Huang",
            "country": ""
        }
    ],
    "keywords": []
}