{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000736",
    "title": "Joint optimization of layering and power allocation for scalable VR video in 6G networks based on Deep Reinforcement Learning",
    "abstract": "With the advancement and application of virtual reality (VR) technology, there is a growing demand for network bandwidth and computational capabilities. To address the challenges of high bandwidth requirements, low latency demands, and intensive computational tasks in VR video transmission, this paper proposes a joint optimization method for layering and power allocation based on Deep Reinforcement Learning (DRL). The method focuses on the transmission of scalable VR videos in 6G networks, utilizing DRL to achieve a cloud-edge-end collaborative transmission framework, where Tile-based scalable VR video is proactively cached to the MEC nodes, and Asynchronous Advantage Actor-Critic (A3C) algorithm is adopted to jointly optimize dual-connected link resources, edge computing resources, and user terminal computing resources. Through simulation experiments, the effectiveness of the proposed algorithms was validated. The results show that compared to baseline algorithms and state-of-the-art methods, the proposed A3C algorithm effectively improves the average quality of experience (QoE) for VR users and maintains low latency under various sub-6G and millimeter wave link capacities. Furthermore, with increased Mobile Edge Computing (MEC) computing power and User Equipment (UE) computing capabilities, the proposed method can further improve QoE and reduce latency.",
    "citation_count": "0",
    "year": "2025/05/01",
    "authors": [
        {
            "name": "Junchao Yang",
            "country": ""
        },
        {
            "name": "Hui Zhang",
            "country": ""
        },
        {
            "name": "Wenxin Jiao",
            "country": ""
        },
        {
            "name": "Zhiwei Guo",
            "country": ""
        },
        {
            "name": "Fayez Alqahtani",
            "country": ""
        },
        {
            "name": "Amr Tolba",
            "country": ""
        },
        {
            "name": "Yu Shen",
            "country": ""
        }
    ],
    "keywords": []
}