{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762123001583",
    "title": "Lyapunov optimized energy-efficient dynamic offloading with queue length constraints",
    "abstract": "With the advent of the  Internet of Things  (IoT), more computation-intensive applications are migrated to  IoT devices . Whereas the  battery  with limited capacity and the processor with low computing power become the bottlenecks that limit its further development.  Mobile edge computing  (MEC) provides a promising solution to break through the bottlenecks. Many effective methods are proposed to guide how to offload tasks from IoT devices to MEC to enhance the computing capacity and prolong the battery life of devices. This paper investigates the  task offloading  problem for a multi-device single-MEC system whose status, such as task arrival rate and channel state, is dynamically changing over time and aims at minimizing the energy consumption of devices and maintaining the  system stability  in the long term. This problem requires lots of future information about the system, which brings a challenge since it is difficult to obtain future information. Moreover, to improve the  system performance  with respect to task  response time , we define an individual queue length threshold for each IoT device such that the queue length of each device can stabilize around the predefined threshold. To address this problem, we first construct a virtual queue for each device to transform the queue length threshold constraint into the virtual queue stability constraint. Secondly, applying the  Lyapunov optimization  method, the original problem, which requires future  system information , is transformed into a problem that only depends on the information of the current time. Thirdly, a dynamic energy-efficient task offloading algorithm is proposed to optimize the time-average energy consumption while maintaining the queue length constraint. This algorithm generates the offloading decision in real-time without requiring system statistical information. Lastly, simulations are conducted to analyze the effect of different parameters on performance. A group of comparisons are given, showing that the task queue length under the proposed method can be controlled effectively compared with the existing studies.",
    "citation_count": "5",
    "year": "2023/10/01",
    "authors": [
        {
            "name": "Jing Mei",
            "country": ""
        },
        {
            "name": "Longbao Dai",
            "country": ""
        },
        {
            "name": "Zhao Tong",
            "country": ""
        },
        {
            "name": "Lianming Zhang",
            "country": ""
        },
        {
            "name": "Keqin Li",
            "country": ""
        }
    ],
    "keywords": []
}