{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762113001884",
    "title": "Measurement-based research on cryptographic algorithms for embedded real-time systems",
    "abstract": "Security, energy and timing are three main concerns for embedded real-time systems, especially in battery-powered security-critical embedded systems. Existing researches on  cryptographic algorithms  seriously ignored the timing properties and their running environments were supposed for general applications while not based on real-time operating systems. In this paper we make efforts to analyse both energy and time related characteristics of widely used cryptographic algorithms for data-sensitive embedded real-time systems. All our studies are based on empirical data measured from a widely used ARM9 developing platform which runs security-critical test tasks within the real-time operating systems  μ C/OSII. To efficiently obtain precise and accuracy data, we use NI instrument and devise a well-defined data-processing method. Identifying the inherent characteristics of security algorithms, we propose a multi-dimensional analysis framework that reveals potential features cryptographic algorithms from the angles of power, speed, and unit energy cost. The energy and time features of most popular cryptographic algorithms including symmetric, asymmetric, and  hash algorithms  are well studied. In addition, some mathematical models are also built to help explain and investigate these features. Based on the experiments and analysis, we found some interesting results like (1) energy consumptions and time overheads of cryptographic algorithms are not linear functions of the size of plain text, (2) energy cost is near-linear to the  execution time  of each cryptographic algorithm under any data size due to the hard/software experimental platform constraint, (3) the power is a  Gaussian function  of data size while the processing speed and unit energy are polynomial functions of data size. We believe this paper could help the design of security-critical applications in embedded real-time systems, e.g. utilizing directly these experimental data of cryptographic algorithms or these fitting mathematical functions to optimize the energy consumption of security-critical real-time applications under limited resources and security requirements.",
    "citation_count": "25",
    "year": "2013/11/01",
    "authors": [
        {
            "name": "Wei Jiang",
            "country": ""
        },
        {
            "name": "Zhenlin Guo",
            "country": ""
        },
        {
            "name": "Yue Ma",
            "country": ""
        },
        {
            "name": "Nan Sang",
            "country": ""
        }
    ],
    "keywords": []
}