{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000345",
    "title": "Mitigating service-oriented attacks using context-based trust for smart cities in IoT networks",
    "abstract": "Smart City technology is an attempt to improve the quality of life of its citizens by providing promising smart solutions for multiple applications. These applications include healthcare monitoring,  resource utilization , city resource management, and various public services.  Internet of Things  (IoT) enables  smart city applications  to collect data from various sensors and process it for providing numerous smart services to the end-users with improved performance. The diverse nature of IoT network requires the use of multiple types of sensors which produce a huge amount of data. This data is highly vulnerable to multiple service-oriented attacks; therefore, it must be protected during the communication of IoT nodes. This  research work  has focused on the identification and detection of malicious nodes causing service-oriented attacks in smart city applications and networks. The direct experience of communicating nodes and recommendations from neighboring nodes are collected to formulate a total trust score. The adaptive weights assigned to direct observations and indirect recommendations ensure the effectiveness of the Context-Based Trust Evaluation System Model (CTES) in detecting On–Off attacks. Moreover, context similarity measure calculations filter out those bad nodes which are posing a  Sybil Attack . The proposed CTES has also been simulated on Contiki Cooja. The results also validate the effectiveness of CTES in detecting the bad behavior of malicious nodes.",
    "citation_count": "27",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Ayesha Altaf",
            "country": ""
        },
        {
            "name": "Haider Abbas",
            "country": ""
        },
        {
            "name": "Faiza Iqbal",
            "country": ""
        },
        {
            "name": "Malik Muhammad Zaki Murtaza Khan",
            "country": ""
        },
        {
            "name": "Abdul Rauf",
            "country": ""
        },
        {
            "name": "Tehsin Kanwal",
            "country": ""
        }
    ],
    "keywords": []
}