{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762113001811",
    "title": "Multi-layered scheduling of mixed-criticality cyber-physical systems",
    "abstract": "In this paper, we deal with the schedule synthesis problem of  mixed-criticality cyber-physical systems  (MCCPS), which are composed of hard real-time tasks and feedback control tasks. The real-time tasks are associated with deadlines that must always be satisfied whereas feedback control tasks are characterized by their Quality of Control (QoC) which needs to be optimized. A straight-forward approach to the above scheduling problem is to translate the QoC requirements into deadline constraints and then, to apply traditional real-time scheduling techniques such as Deadline Monotonic (DM). In this work, we show that such scheduling leads to overly conservative results and hence is not efficient in the above context. On the other hand, methods from the  mixed-criticality  systems (MC) literature mainly focus on tasks with different criticality  levels  and certification issues. However, in MCCPS, the tasks may not be fully characterized by only criticality  levels , but they may further be classified according to their criticality  types , e.g.,  deadline-critical  real-time tasks and  QoC-critical  feedback control tasks. On the contrary to traditional deadline-driven scheduling, scheduling MCCPS requires to integrate both, deadline-driven and QoC-driven techniques which gives rise to a challenging scheduling problem. In this paper, we present a  multi-layered  schedule synthesis scheme for MCCPS that aims to jointly schedule  deadline-critical , and  QoC-critical  tasks at different scheduling layers. Our scheduling framework (i) integrates a number of QoC-oriented metrics to capture the QoC requirements in the schedule synthesis (ii) uses  arrival curves  from real-time calculus which allow a general characterization of task triggering patterns compared to simple task models such as  periodic  or  sporadic , and (iii) has pseudo-polynomial complexity. Finally, we show the applicability of our scheduling scheme by a number of experiments.",
    "citation_count": "38",
    "year": "2013/11/01",
    "authors": [
        {
            "name": "Reinhard Schneider",
            "country": ""
        },
        {
            "name": "Dip Goswami",
            "country": ""
        },
        {
            "name": "Alejandro Masrur",
            "country": ""
        },
        {
            "name": "Martin Becker",
            "country": ""
        },
        {
            "name": "Samarjit Chakraborty",
            "country": ""
        }
    ],
    "keywords": []
}