{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124000286",
    "title": "Network traffic classification based on federated semi-supervised learning",
    "abstract": "Traffic Classification (TC) has been applied to a wide range of applications, from security monitoring to quality of service (QoS) provisioning in network Internet Service Providers (ISPs). In recent years, many researchers have applied Machine Learning (ML) or Deep Learning (DL) to TC, namely AI-TC. However, AI-TC methods face significant challenges, including high data dependency, exhaustively costly traffic labeling, and network subscribers’ privacy. This paper proposes a TC framework for smart home networks using Federated Learning (FL) that protects traffic data privacy by performing local training and inference of TC models. Firstly, we design a DPI-based traffic labeling method on edge home gateways as FL nodes, which enables these nodes to have data labeling capability while protecting data privacy. Then, a semi-supervised TC model based on an autoencoder (AE) is proposed to reduce the dependence of the model on labeled traffic samples. Finally, an XAI-based method is utilized to interpret the model to ensure its explainability. We validate the proposed method on public and real datasets using benchmarking methods. The experimental results show that the method can achieve high performance using a small number of samples while protecting data privacy and improving the model’s credibility. Experimental code can be found in the following url:  https://github.com/PrinceXuan12138/HGW-TC-Experimental-code .",
    "citation_count": "0",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "ZiXuan Wang",
            "country": ""
        },
        {
            "name": "ZeYi Li",
            "country": ""
        },
        {
            "name": "MengYi Fu",
            "country": ""
        },
        {
            "name": "YingChun Ye",
            "country": ""
        },
        {
            "name": "Pan Wang",
            "country": ""
        }
    ],
    "keywords": []
}