{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120300515",
    "title": "On hardware-trojan-assisted power budgeting system attack targeting many core systems",
    "abstract": "In a modern many-core chip, as all the cores are constantly competing for their shares of power out of the maximum power available to the chip, a sound power budgeting scheme is needed to efficiently allocate power to achieve the highest possible overall  system performance . When a core is poised to run some applications, it has to request its power budget by sending a series of data packets, routed typically through an on-chip communication network infrastructure, to a specific core designated as the global manager that makes its  power allocation  decision based on all the budget requests it receives and its assessment of each core’s potential contribution to the overall system performance. This power budgeting scheme is shown, in this paper, to be highly vulnerable to stealthy false-data attacks, which can cause catastrophic  denial of service  (DoS) effects. Essentially, when a power budget request packet is routed through a Trojan-infected network-on-chip node, such as a router, the power budget request can be secretly modified by the Trojan. The global manager then tends to make really bad power budget allocation decisions with all the tampered power requests it received. That is, legitimate applications will be victimized with lower power budgets than what they initially asked for, and thus, could suffer serious  performance degradation ;  malicious applications , on the other hand, may be entitled to high power budgets and thus see performance boost that they do not deserve. Our study has revealed that this new type of  DoS attack  can be initiated and sustained by a simple hardware Trojan (HT) circuit that is extremely hard to be detected due to its low silicon footprint and short activation time. The effects of this new  DoS attack  are simulated following a network model, and all the major parameters and factors that impact the attack effects are identified and quantified. The HTs are intelligently turned ON/OFF following a scheme based on Q-learning, we further demonstrate that the attacks can undermine the best countermeasures against power budgeting system attack as suggested in this paper, which gives rise to a need for further research in this regard.",
    "citation_count": "8",
    "year": "2020/10/01",
    "authors": [
        {
            "name": "Yiming Zhao",
            "country": ""
        },
        {
            "name": "Xiaohang Wang",
            "country": ""
        },
        {
            "name": "Yingtao Jiang",
            "country": ""
        },
        {
            "name": "Liang Wang",
            "country": ""
        },
        {
            "name": "Mei Yang",
            "country": ""
        },
        {
            "name": "Amit Kumar Singh",
            "country": ""
        },
        {
            "name": "Terrence Mak",
            "country": ""
        }
    ],
    "keywords": []
}