{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116000023",
    "title": "Online slack consolidation in global-EDF for energy consumption minimisation",
    "abstract": "Leakage  power dissipation  is one of the major concerns in homogeneous  multicore platforms . Therefore, individual cores on such platforms are often equipped with multiple sleep states to reduce the leakage power dissipation. With the current body of knowledge, an efficient selection of sleep states is a non-trivial problem for system designers. In this work, we propose leakage-aware  energy management  algorithms for homogeneous multicore platforms using a  global -EDF scheduler. Global-EDF assumes that at any time instant the tasks (constituting the application) with the closest absolute deadlines are selected for execution on any core of the platform, sometimes allowing migration. Initially, individual cores are allowed to change their power states independently. This assumption is relaxed in the second algorithm and cores transition into different power states in coordination with each other. The main idea behind the proposed algorithms consists of exploiting the spare capacity available in the schedule of each core to either initiate a sleep state on this core or prolong the sleep state of cores already in a sleep state in order to minimise the leakage power dissipation. The presented algorithms have low complexity, thus making it practically feasible. Evaluations are carried out by assuming the specifications of Intel Xeon E3-1285L V4 embedded  multicore processor  and Freescale P5040 QorIQ Integrated Processor to demonstrate its effectiveness. In the best-case, up to 50% and 60% of the energy consumption wasted in idle intervals — i.e., when a core is not performing any execution — on Intel Xeon and Freescale P5040 platform, respectively, is saved over the baseline  global -EDF schedule.",
    "citation_count": "2",
    "year": "2016/02/01",
    "authors": [
        {
            "name": "Muhammad Ali Awan",
            "country": ""
        },
        {
            "name": "Geoffrey Nelissen",
            "country": ""
        },
        {
            "name": "Patrick Meumeu Yomsi",
            "country": ""
        },
        {
            "name": "Stefan M. Petters",
            "country": ""
        }
    ],
    "keywords": []
}