{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762118304740",
    "title": "Online stereo camera calibration for automotive vision based on HW-accelerated A-KAZE-feature extraction",
    "abstract": "Nowadays ongoing integration of camera based  advanced driver assistance systems  (ADAS) in vehicles demands increasingly complex  digital image processing  in order to interpret the surrounding situations. To ensure a timely reaction for obstacles lying ahead, far reaching depth information of the observed scene is necessary. Using  stereo camera  systems, this is achievable by enlarging the camera base line. With rapid driving, the exact alignment of the  stereo images  is no longer ensured due to vibrations of the vehicle. Based on detection, extraction and matching of Accelerated-KAZE  image features  (A-KAZE), the  geometric distortions  are compensable by estimating the external camera parameters for image  rectification . The indispensable frame rate for applications in vehicles and the limited power budget in combination with the SW-flexibility demanded for future ADAS applications requires the usage of optimized hardware architectures. Thus, an online  camera calibration  based on an HW-accelerated A-KAZE extraction is introduced in this work. The suitability of A-KAZE features for an online camera calibration is proven. Furthermore, the Tensilica Vision P5-processor is evaluated regarding its suitability for real-time A-KAZE feature extraction. This processor provides a comprehensive instruction-set extension for high-performance  digital image processing . While preserving the initial A-KAZE accuracy, a  feature descriptor  length reduction of factor  × 3.8 is attained compared to the initial descriptor size and an estimated frame rate of 20 fps is achieved for A-KAZE feature extraction on the Tensilica Vision P5-processor.",
    "citation_count": "6",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Nico Mentzer",
            "country": ""
        },
        {
            "name": "Jannik Mahr",
            "country": ""
        },
        {
            "name": "Guillermo Payá-Vayá",
            "country": ""
        },
        {
            "name": "Holger Blume",
            "country": ""
        }
    ],
    "keywords": []
}