{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762120300023",
    "title": "Packet priority assignment for wireless control systems of multiple physical systems",
    "abstract": "Wireless control systems (WCSs) have gained much attention lately, due to their easy deployment and flexibility compared to wired control systems. However, this comes at the cost of possibly increased network delay and  packet losses , that can significantly impact the control  system performance , and possibly its stability. Such problems become even more relevant if the network is shared among different control systems, and thus becomes a scarce resource, like in Industrial  Internet of Things  applications. In this paper, we aim at minimizing the  performance degradation  of the WCS with multiple physical systems sharing a network. We propose a dynamic packet scheduling solution to minimize the performance error of WCS, by dynamically determining the packet priorities of different control systems and characteristic of network paths. We consider two cases for network path selection: (1) network delay only by developing a worst-case end-to-end delay analysis; (2) network delay + reliability by proposing a new network quality model including both delay and packet losses, both of which are very important for the quality of output of the WCSs. Our solution is evaluated over two different use cases to show the generality of the approach: the WCS for a set of inverted pendula, and the WCS for small  modular reactors  in a  nuclear power plant . The results show that the proposed approach allows for a more stable performance even in presence of highly  nonlinear systems , sensitive to time-varying delays, as well as in presence of high network interference.",
    "citation_count": "5",
    "year": "2020/08/01",
    "authors": [
        {
            "name": "Wenchen Wang",
            "country": ""
        },
        {
            "name": "Daniel Mosse",
            "country": ""
        },
        {
            "name": "Alessandro Vittorio Papadopoulos",
            "country": ""
        }
    ],
    "keywords": []
}