{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762116302934",
    "title": "Porting a PCA-based hyperspectral image dimensionality reduction algorithm for brain cancer detection on a manycore architecture",
    "abstract": "This paper presents a study of the  parallelism  of a  Principal Component  Analysis (PCA) algorithm and its adaptation to a manycore MPPA (Massively Parallel Processor Array) architecture, which gathers 256 cores distributed among 16 clusters. This study focuses on porting  hyperspectral image processing  into manycore platforms by optimizing their processing to fulfill real-time constraints, fixed by the image capture rate of the  hyperspectral sensor . Real-time is a challenging objective for  hyperspectral image  processing, as  hyperspectral images  consist of extremely large volumes of data and this problem is often solved by reducing image size before starting the processing itself. To tackle the challenge, this paper proposes an analysis of the intrinsic  parallelism  of the different stages of the PCA algorithm with the objective of exploiting the  parallelization  possibilities offered by an MPPA manycore architecture. Furthermore, the impact on internal communication when increasing the level of parallelism is also analyzed. Experimenting with medical images obtained from two different surgical use cases, an average speedup of 20 is achieved. Internal communications are shown to rapidly become the bottleneck that reduces the achievable speedup offered by the PCA parallelization. As a result of this study, PCA processing time is reduced to less than 6   s, a time compatible with the targeted brain surgery application requiring 1   frame-per-minute.",
    "citation_count": "38",
    "year": "2017/06/01",
    "authors": [
        {
            "name": "R. Lazcano",
            "country": ""
        },
        {
            "name": "D. Madroñal",
            "country": ""
        },
        {
            "name": "R. Salvador",
            "country": ""
        },
        {
            "name": "K. Desnos",
            "country": ""
        },
        {
            "name": "M. Pelcat",
            "country": ""
        },
        {
            "name": "R. Guerra",
            "country": ""
        },
        {
            "name": "H. Fabelo",
            "country": ""
        },
        {
            "name": "S. Ortega",
            "country": ""
        },
        {
            "name": "S. Lopez",
            "country": ""
        },
        {
            "name": "G.M. Callico",
            "country": ""
        },
        {
            "name": "E. Juarez",
            "country": ""
        },
        {
            "name": "C. Sanz",
            "country": ""
        }
    ],
    "keywords": []
}