{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762125000347",
    "title": "Quantum-safe identity-based designated verifier signature for BIoMT",
    "abstract": "Blockchain technology changes the centralized management form in traditional healthcare systems and constructs the distributed and secure medical data-sharing mechanism to achieve data value maximization. However, the advanced capabilities of quantum algorithms bring a serious threat to current blockchain cryptographic algorithms which are based on classical mathematical difficulties. This paper proposes the first quantum-safe identity-based designated verifier signature (ID-DVS) scheme for blockchain-based Internet of medical things (BIoMT) systems. This scheme is constructed based on the lattice assumption of the short integer solution (SIS) problem, which is believed to resist the quantum attack. The identity mechanism helps to establish a transaction traceability mechanism when this data is shared among different medical institutions. The designated verifier mechanism also prevents unauthorized users from accessing data to improve the security of medical data-sharing processes. Next, this ID-DVS scheme is proved in random oracle model, which can achieve the security properties of anonymity and unforgeability. It also can capture the post-quantum security. Then, the performance analysis of the key size and time consumption are presented, and the results show that this ID-DVS is more efficient than other similar schemes. Therefore, this work supports secure medical data-sharing and protects the privacy of users and medical data.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Chaoyang Li",
            "country": ""
        },
        {
            "name": "Yuling Chen",
            "country": ""
        },
        {
            "name": "Mianxiong Dong",
            "country": ""
        },
        {
            "name": "Jian Li",
            "country": ""
        },
        {
            "name": "Min Huang",
            "country": ""
        },
        {
            "name": "Xiangjun Xin",
            "country": ""
        },
        {
            "name": "Kaoru Ota",
            "country": ""
        }
    ],
    "keywords": []
}