{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124001772",
    "title": "Real-time intelligent on-device monitoring of heart rate variability with PPG sensors",
    "abstract": "Heart rate variability (HRV) is a vital sign with the potential to predict stress and various diseases, including heart attack and arrhythmia. Typically, hospitals utilize electrocardiogram (ECG) devices to capture the heart’s bioelectrical signals, which are then used to calculate HRV values. However, this method is costly and inconvenient due to the requirement for stable connections to the body. In recent years, photoplethysmography (PPG) sensors, which collect reflective light signals, have gained attention as a cost-effective alternative for measuring heart health. However, accurately estimating HRV using PPG signals remains a challenging task due to the inherent sensitivity of PPG sensors. To address the challenges, this paper presents an on-device, low-cost machine learning-based system that aims to achieve high-accuracy HRV estimation in real-time. Firstly, we propose a novel unified performance and resource-aware neural network (UP-RaNN) search method that leverages grid search techniques to identify a neural network model that can deliver both high HRV accuracy and smooth operation on resource-limited devices. Secondly, we design a real-time HRV monitoring system using a resource-limited, ultra-low-power microcontroller unit (MCU). This system utilizes the neural network model obtained through the UP-RaNN to provide HRV readings from PPG data in real-time. Thirdly, we evaluate the proposed UP-RaNN method and the real-time HRV monitoring system by comparing its performance to state-of-the-art studies. Moreover, the system is enhanced with adaptive reconfiguration capability, enabling it to improve energy efficiency and adapt to varying demands during runtime. The results demonstrate that when deployed on an MSP430FR5994 development board running at 8 MHz, the trained deep neural network model obtained through our proposed UP-RaNN achieves HRV estimation in just 0.3 s per inference. Additionally, the model exhibits a better mean absolute percentage error ( ∼  5.8%) than the state-of-the-art HRV estimation methods using PPG, while significantly reducing model complexity and computational time.",
    "citation_count": "0",
    "year": "2024/09/01",
    "authors": [
        {
            "name": "Jingye Xu",
            "country": ""
        },
        {
            "name": "Yuntong Zhang",
            "country": ""
        },
        {
            "name": "Mimi Xie",
            "country": ""
        },
        {
            "name": "Wei Wang",
            "country": ""
        },
        {
            "name": "Dakai Zhu",
            "country": ""
        }
    ],
    "keywords": []
}