{
    "url": "https://www.sciencedirect.com/science/article/pii/S138376211830290X",
    "title": "Scheduling and power management in energy harvesting computing systems with real-time constraints",
    "abstract": "Recently, a new class of energy  autonomous systems  has emerged. They scavenge regenerative energy from the environment which allows them perpetual operation. In this paper we focus on systems with  energy harvesting  and DPM (Dynamic Power Management) capabilities under real-time requirements expressed in terms of deadlines. The classical Earliest Deadline First (EDF) scheduler is optimal when dedicated to deadline-constrained job sets in systems with no energy limitation. However, greediness in consuming the energy makes EDF not always the most appropriate solution to  energy harvesting  conditions. The purpose of this paper is to answer the following question: How to choose a scheduler for the design of a real-time energy harvesting application where the real-time jobs execute on a single processor? We consider a system model composed of a uniprocessor platform provided with  energy harvester  (e.g. solar panel) and energy reservoir (e.g.  battery  or capacitor). Firstly, we investigate three distinct schedulers based on the earliest deadline rule, namely ED-H, EH-EDF and EDF. They are respectively proved optimal for clairvoyant, idling and non-idling settings. Secondly, we evaluate the  relative performance  of the proposed  scheduling algorithms  based on simulation experiments. We bring to light the effect of clairvoyance and idling capabilities of the scheduler on the improvement in  quality of service  which is related to deadline success rate and energy  storage capacity  requirement for maintaining zero deadline miss rate. In addition, this paper gives a selection guide that leads any software designer to find the scheduler that is most pertinent in accordance to  operational specifications .",
    "citation_count": "16",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Maryline Chetto",
            "country": ""
        },
        {
            "name": "Hussein El Ghor",
            "country": ""
        }
    ],
    "keywords": []
}