{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124002054",
    "title": "Secure pairing-free certificateless aggregate signcryption scheme for IoT",
    "abstract": "The widespread application of wireless sensor technology in the Internet of Things (IoT) industry significantly enhances productivity. However, the large scale deployment of IoT and the inherent vulnerabilities of wireless communication methods to attacks present significant new challenges. Consequently, there is a need to address the efficiency and security of information transfer in IoT. To effectively solve these issues, this paper presents a secure and efficient pairing-free certificateless aggregated signcryption (CL-ASC) scheme for IoT based on the elliptic curve cryptosystem. Our scheme avoids the complex certificate management issues associated with Public Key Cryptography (PKC) and the key escrow problem found in identity-based cryptography, while maintaining the storage and communication efficiency benefits of aggregated signcryption. The use of secure signcryption and aggregation techniques effectively resists a variety of potential attacks. Both formal and informal security analyses demonstrate that our scheme meets the expected security requirements. Specifically, our scheme shows significant improvements in computational and communication overheads. Compared to other state-of-the-art protocols, our scheme achieves signcryption computation cost of 0.691 ms, unsigncryption computation cost of 3.917 ms for 5 messages, and a total cost of 4.608 ms for 5 messages. Additionally, it provides a signcryption communication overhead of 128 bytes and aggregated communication overhead of 580 bytes for 5 messages.",
    "citation_count": "2",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Dongmei Chen",
            "country": ""
        },
        {
            "name": "Fei Zhou",
            "country": ""
        },
        {
            "name": "Yining Liu",
            "country": ""
        },
        {
            "name": "Lihui Li",
            "country": ""
        },
        {
            "name": "Yangfan Liang",
            "country": ""
        }
    ],
    "keywords": []
}