{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762115000818",
    "title": "Self-adaptive corner detection on MPSoC through resource-aware programming",
    "abstract": "Multiprocessor system-on-chip (MPSoC) designs offer a lot of computational power assembled in a compact design. In mobile  robotic applications , they offer the chance to replace several dedicated computing boards by a single processor, which typically leads to a significant acceleration of the computer-vision algorithms employed. This enables robots to perform more complex tasks at lower power budgets, less cooling overhead and, ultimately, smaller physical dimensions. However, the presence of  shared resources  and dynamically varying load situations leads to low throughput and quality for  corner detection ; an algorithm very widely used in computer-vision. The contemporary operating systems from the domain have not been designed for the management of highly parallel but shared computing resources. In this paper, we evaluate  resource-aware programming  as a means to overcome these issues. Our work is based on  Invasive Computing , a MPSoC hardware and operating-system design for resource-aware programming. We evaluate this system with real-world algorithms, like Harris and Shi–Tomasi corner detectors. Our results indicate that resource-aware programming can lead to significant improvements in the behavior of these detectors, with up to 22 percent improvement in throughput and up to 20 percent improvement in accuracy.",
    "citation_count": "6",
    "year": "2015/11/01",
    "authors": [
        {
            "name": "Johny Paul",
            "country": ""
        },
        {
            "name": "Benjamin Oechslein",
            "country": ""
        },
        {
            "name": "Christoph Erhardt",
            "country": ""
        },
        {
            "name": "Jens Schedel",
            "country": ""
        },
        {
            "name": "Manfred Kröhnert",
            "country": ""
        },
        {
            "name": "Daniel Lohmann",
            "country": ""
        },
        {
            "name": "Walter Stechele",
            "country": ""
        },
        {
            "name": "Tamim Asfour",
            "country": ""
        },
        {
            "name": "Wolfgang Schröder-Preikschat",
            "country": ""
        }
    ],
    "keywords": []
}