{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124002030",
    "title": "Toward Linux-based safety-critical systems—Execution time variability analysis of Linux system calls",
    "abstract": "Modern transportation and industrial domain safety-critical applications, such as autonomous vehicles and collaborative robots, exhibit a combination of escalating software complexity and the need to integrate diverse software stacks and machine learning algorithms, consequently demanding complex high-performance hardware. Linux’s extensive platform support and library ecosystem make it a valuable general-purpose operating system for developing complex software systems. However, because the Linux kernel has not been designed to comply with safety standards, it has a high execution path variability and does not provide execution time guarantees. In this context, several research initiatives have studied the usage of Linux for developing complex safety-related systems, focusing on topics that include its development process, isolation architectures, or test coverage estimation. Nonetheless, execution-time analysis and providing temporal guarantees is still a challenge. This work extends the novel statistical analysis of Linux system call execution paths with the analysis of execution-time variability and proposes a method for estimating the worst-case execution time, forming a sound approach for an in-depth analysis of the Linux kernel execution paths and execution times for safety-related systems. The proposed method is applied to a representative use case that implements an Autonomous Emergency Brake application in an NVIDIA Jetson Nano board connected to the CARLA autonomous driving simulator.",
    "citation_count": "0",
    "year": "2024/11/01",
    "authors": [
        {
            "name": "Markel Galarraga",
            "country": ""
        },
        {
            "name": "Charles-Alexis Lefebvre",
            "country": ""
        },
        {
            "name": "Jon Perez-Cerrolaza",
            "country": ""
        },
        {
            "name": "Jose A. Pascual",
            "country": ""
        }
    ],
    "keywords": []
}