{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762117301145",
    "title": "Using data visualization technique to detect sensitive information re-identification problem of real open dataset",
    "abstract": "With plenty valuable information,  open data  are often deemed as great assets to academia or industry. In spite of some de-identification processing that most of data owners will perform before releasing the data, the more datasets are opened to public, the more likely personal privacy will be exposed. According to previous real  case studies , even though the  personally identifiable information  has been de-identified, sensitive personal information could still be uncovered by heterogeneous or cross-domain data joining operations. The involved privacy re-identification processes are usually too complicated or obscure to be realized by data owners, not to mention that this problem will be more severe as the scale of data will get larger and larger. For preventing the leakage of  sensitive information , this paper shows how to use a novel visualization analysis tool for  open data  de-identification (ODD Visualizer) to verify whether there exists sensitive  information leakage  problem in the target datasets. The high effectiveness that the ODD Visualizer can provide mainly comes from implementing a scalable computing platform as well as developing an efficient data visualization technique. Our demonstrations show that the ODD Visualizer can indeed uncover real vulnerability of record linkage attacks among open datasets available on the Internet.",
    "citation_count": "10",
    "year": "2017/10/01",
    "authors": [
        {
            "name": "Chiun-How Kao",
            "country": ""
        },
        {
            "name": "Chih-Hung Hsieh",
            "country": ""
        },
        {
            "name": "Yu-Feng Chu",
            "country": ""
        },
        {
            "name": "Yu-Ting Kuang",
            "country": ""
        },
        {
            "name": "Chuan-Kai Yang",
            "country": ""
        }
    ],
    "keywords": []
}