{
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762121000163",
    "title": "Wireless edge caching based on content similarity in dynamic environments",
    "abstract": "Edge caching  could greatly relieve the burden of the  backbone network  and reduce the content request latency experienced by end-user devices. This makes edge caching a promising technology for enabling data-intensive and latency-sensitive applications on the eve of the large-scale commercial operation of 5G. However, the slow-start phenomenon incurred by existing request history-based caching strategies limits the performance of wireless edge caching, especially in the dynamic scenario where both mobile devices and contents arrive and leave periodically. On the other hand, it is also a hard task for deep reinforcement learning-based methods to adapt to the dynamics of the environment. In this backdrop, a new caching algorithm, called Similarity-Aware Popularity-based Caching (SAPoC), is presented in this paper to promote the performance of wireless edge caching in dynamic scenarios through utilizing the similarity among contents. In SAPoC algorithm, a content’s popularity is determined by not only its requests history but also its similarity with existing popular ones to enable a quick-start of newly arrived contents. A series of simulation experiments are conducted to evaluate SAPoC algorithm’s performance. Results have shown that SAPoC outperforms several typical proposals in both cache hit ratio and energy consumption.",
    "citation_count": "62",
    "year": "2021/05/01",
    "authors": [
        {
            "name": "Xianglin Wei",
            "country": ""
        },
        {
            "name": "Jianwei Liu",
            "country": ""
        },
        {
            "name": "Yangang Wang",
            "country": ""
        },
        {
            "name": "Chaogang Tang",
            "country": ""
        },
        {
            "name": "Yongyang Hu",
            "country": ""
        }
    ],
    "keywords": []
}