{
    "url": "https://www.sciencedirect.com/science/article/pii/S2405959523000358",
    "title": "Load balancing in 5G heterogeneous networks based on automatic weight function",
    "abstract": "Load balancing is a major challenge in heterogeneous networks (HetNets) consisting of 5G and 6G ultra-dense small cells with long-term evaluation advanced (LTE-A) networks. A key factor in achieving efficient load balancing during user mobility is creating appropriate optimisation for handover control parameters (HCP). This paper proposes a coordinated load balancing algorithm for LTE-A/fifth generation (5G) HetNets. The algorithm automatically optimises HCP settings for a given user based on three bounded functions (the signal-to-interference-plus-noise ratio (SINR) of the user equipment (UE), the number of physical resource blocks (PRBs) per UE and the UE’s speed) as well as their automatic weight levels. A two-step target cell determination strategy is implemented according to the cell load level and RSRP criteria, ensuring that users are handed over to low-loaded target cells. A new HO procedure that considers the pilot signal power is also proposed, which includes the number of PRBs per UE and the RSRP. Cells with freer PRBs are prioritised in user association to provide load balance and enhanced throughput. The proposed load balancing algorithm is compared with five other load balancing algorithms selected from the literature. The simulation results reveal that under various mobile speed scenarios, the proposed load balancing scheme enhances network performance in terms of load level, throughput, spectral efficiency and call dropping ratio (CDR).",
    "citation_count": "0",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Emre Gures",
            "country": ""
        },
        {
            "name": "Ibraheem Shayea",
            "country": ""
        },
        {
            "name": "Sawsan Ali Saad",
            "country": ""
        },
        {
            "name": "Mustafa Ergen",
            "country": ""
        },
        {
            "name": "Ayman A. El-Saleh",
            "country": ""
        },
        {
            "name": "Nada M.O. Sid Ahmed",
            "country": ""
        },
        {
            "name": "Mohammad Alnakhli",
            "country": ""
        }
    ],
    "keywords": []
}