{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650214000029",
    "title": "A comparative performance assessment of a set of multiobjective algorithms for constrained portfolio assets selection",
    "abstract": "This paper addresses a realistic portfolio assets selection problem as a  multiobjective optimization  one, considering the budget, floor, ceiling and  cardinality  as constraints. A novel multiobjective  optimization algorithm , namely the non-dominated sorting multiobjective  particle swarm optimization  (NS-MOPSO), has been proposed and employed efficiently to solve this important problem. The performance of the proposed algorithm is compared with four multiobjective evolution algorithms (MOEAs), based on non-dominated sorting, and one MOEA algorithm based on decomposition (MOEA/D). The performance results obtained from the study are also compared with those of single objective  evolutionary algorithms , such as the  genetic algorithm  (GA),  tabu  search (TS), simulated annealing (SA) and  particle swarm optimization  (PSO). The comparisons of the performance include three error measures, four performance metrics, the  Pareto front  and  computational time . A nonparametric statistical analysis, using the Sign test and Wilcoxon signed  rank test , is also performed, to demonstrate the superiority of the NS-MOPSO algorithm. On examining the performance metrics, it is observed that the proposed NS-MOPSO approach is capable of identifying good  Pareto solutions , maintaining adequate diversity. The proposed algorithm is also applied to different  cardinality  constraint conditions, for six different market indices, such as the Hang-Seng in  Hong Kong , DAX 100 in  Germany , FTSE 100 in UK, S&P 100 in  USA , Nikkei 225 in  Japan , and BSE-500 in  India .",
    "citation_count": "52",
    "year": "2014/06/01",
    "authors": [
        {
            "name": "Sudhansu Kumar Mishra",
            "country": ""
        },
        {
            "name": "Ganapati Panda",
            "country": ""
        },
        {
            "name": "Ritanjali Majhi",
            "country": ""
        }
    ],
    "keywords": []
}