{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002062",
    "title": "A cooperative learning-aware dynamic hierarchical hyper-heuristic for distributed heterogeneous mixed no-wait flow-shop scheduling",
    "abstract": "The distributed heterogeneous mixed scheduling mode in the manufacturing systems emphasizes the cooperation between factories for the entire production cycle, which poses enormous challenges to the processing and assignment of jobs. Discrepancies in the processing environment and types of machines of each factory during various production stages cause diverse processing paths and scheduling. The distributed heterogeneous mixed no-wait flow-shop scheduling problem with sequence-dependent setup time (DHMNWFSP-SDST), abstracted from the industrial scenarios, is addressed in this paper. The mathematical model of DHMNWFSP-SDST is established. A cooperative learning-aware dynamic hierarchical hyper-heuristic (CLDHH) is proposed to solve the DHMNWFSP-SDST. In CLDHH, a cooperative initialization method is developed to promote diversity and quality of solutions. A hierarchical hyper-heuristic framework with reinforcement learning (RL) is designed to select the algorithm component automatically. Estimation of Distribution Algorithm (EDA) guides the upper-layer RL to select four neighborhood structures. A dynamic adaptive neighborhood switching constructs the lower-layer RL to accelerate exploitation with the dominant sub-neighborhoods. An elite-guided hybrid path relinking achieves local enhancement. The experimental results of CLDHH and six state-of-the-art algorithms on instances indicate that the proposed CLDHH is superior to the state-of-the-art algorithms in solution quality, robustness, and efficiency.",
    "citation_count": "2",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Ningning Zhu",
            "country": ""
        },
        {
            "name": "Fuqing Zhao",
            "country": ""
        },
        {
            "name": "Yang Yu",
            "country": ""
        },
        {
            "name": "Ling Wang",
            "country": ""
        }
    ],
    "keywords": []
}