{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002803",
    "title": "A comparative study of evolutionary algorithms and particle swarm optimization approaches for constrained multi-objective optimization problems",
    "abstract": "Many real-world optimization problems contain multiple conflicting objectives as well as additional problem constraints. These problems are referred to as constrained multi-objective optimization problems (CMOPs). Many meta-heuristics for solving CMOPs, called constrained multi-objective meta-heuristics (CMOMHs) have been introduced in the literature, including those using particle swarm optimization (PSO)(Kennedy and Eberhart, 1995), genetic algorithms (GAs)(Man et al., 1996), and differential evolution (DE)(Storn and Price, 1997). CMOMHs can be grouped into four different classes: classic CMOMHs, co-evolutionary approaches, multi-stage approaches, and multi-tasking approaches. An extensive comparative study of twenty different CMOMHs on a wide variety of test problems, including real-world CMOPs in the fields of science and engineering, is conducted. A multi-swarm PSO approach called constrained multi-guide particle swarm optimization (ConMGPSO) is introduced and compared to the best-performing previous approaches according to the comparative study. The performance of each algorithm was found to be problem dependent, however the best overall approaches were ConMGPSO, paired-offspring constrained evolutionary algorithm (POCEA)(He et al., 2021), adaptive non-dominated sorting genetic algorithm III (A-NSGA-III)(Jain and Deb, 2014), and constrained multi-objective framework using Q-learning and evolutionary multi-tasking (CMOQLMT)(Ming and Gong, 2023). ConMGPSO and POCEA had the best performance on the CF benchmark set, which contains examples of bi-objective and tri-objective CMOPs with disconnected CPOFs. The CMOQLMT approach had the best performance on the DAS-CMOP benchmark set, which contain additional difficulty in terms of feasibility-, convergence-, and diversity-hardness. For the selected real-world CMOPs, A-NSGA-III had the best performance overall. ConMGPSO was shown to have the best performance on the process, design, and synthesis problems, and had competitive performance for the power system optimization problems.",
    "citation_count": "0",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Alanna McNulty",
            "country": ""
        },
        {
            "name": "Beatrice Ombuki-Berman",
            "country": ""
        },
        {
            "name": "Andries Engelbrecht",
            "country": ""
        }
    ],
    "keywords": []
}