{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400186X",
    "title": "A Co-evolutionary Multi-population Evolutionary Algorithm for Dynamic Multiobjective Optimization",
    "abstract": "Dynamic multiobjective optimization problems (DMOPs) widely appear in various real-world applications and have attracted increasing attention worldwide. However, how to obtain both good population diversity and fast convergence speed to efficiently solve DMOPs are two challenging issues. Inspired by that the multiple populations for multiple objectives (MPMO) framework can provide algorithms with good population diversity and fast convergence speed, this paper proposes a new efficient algorithm called a co-evolutionary multi-population  evolutionary algorithm  (CMEA) based on the MPMO framework together with three novel strategies, which are helpful for solving DMOPs efficiently from two aspects. First, in the evolution control aspect, a convergence-based population evolution strategy is proposed to select the suitable population for executing the evolution in different generations, so as to accelerate the convergence speed of the algorithm. Second, in the dynamic control aspect, a multi-population-based dynamic detection strategy and a multi-population-based dynamic response strategy are proposed to help the algorithm maintain the population diversity, which are efficient for detecting and responding to the dynamic changes of environments. Integrating with the above strategies, the CMEA is proposed to solve the DMOP efficiently. The superiority of the proposed CMEA is validated in experiments on widely-used DMOP benchmark problems.",
    "citation_count": "1",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Xin-Xin Xu",
            "country": ""
        },
        {
            "name": "Jian-Yu Li",
            "country": ""
        },
        {
            "name": "Xiao-Fang Liu",
            "country": ""
        },
        {
            "name": "Hui-Li Gong",
            "country": ""
        },
        {
            "name": "Xiang-Qian Ding",
            "country": ""
        },
        {
            "name": "Sang-Woon Jeon",
            "country": ""
        },
        {
            "name": "Zhi-Hui Zhan",
            "country": ""
        }
    ],
    "keywords": []
}