{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001468",
    "title": "A discrete artificial bee colony method based on variable neighborhood structures for the distributed permutation flowshop problem with sequence-dependent setup times",
    "abstract": "In today's global economy, distributed manufacturing has become increasingly appropriate. Job setup time is invariably a factor in manufacturing, and needs to be considered when making scheduling decisions. This study aims to minimize the total flow time by solving a distributed permutation flowshop scheduling problem (DPFSP) with a sequence-dependent setup time (SDST) to minimize total flowtime. First, to manage the DPFSP/SDST effectively, we propose a constructive heuristic framework based on the LR heuristic, which contains three constructive heuristics to obtain good initial solutions. Second, a discrete artificial bee colony (DABC) method based on variable neighborhood structures (DABC vns ) is proposed. By analyzing the problem-specific characteristics in the DABC vns , four different neighborhood structures are proposed, which are selectively applied in three stages of DABC vns  to obtain more feasible neighborhood solutions. In addition, two variable neighborhood descent algorithms are proposed, which are each based on local search methods. The algorithms are developed to improve the best solution obtained in initial population and the best solution generated in the three stages. Finally, we conduct an experiment to calibrate the parameter of the DABC vns  method. To evaluate the performance of the proposed method compared to six other algorithms, comprehensive computational experiments are conducted. The simulation results indicate that the proposed method delivers the best quality solutions for the DPFSP/SDST in the minimization of total flowtime.",
    "citation_count": "20",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Yang Yu",
            "country": ""
        },
        {
            "name": "Feng-Qi Zhang",
            "country": ""
        },
        {
            "name": "Guo-Dong Yang",
            "country": ""
        },
        {
            "name": "Yu Wang",
            "country": ""
        },
        {
            "name": "Jiang-Ping Huang",
            "country": ""
        },
        {
            "name": "Yu-Yan Han",
            "country": ""
        }
    ],
    "keywords": []
}