{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219302342",
    "title": "A discrete multi-objective fireworks algorithm for flowshop scheduling with sequence-dependent setup times",
    "abstract": "Multi-objective  flow shop scheduling  problem with sequence-dependent setup times (MOFSP-SDST) is a class of important production scheduling problem with strong industry background. In this paper, a MOFSP-SDST mathematic model with the objectives of  total production  cost, makespan, mean flow time and mean idle time of machines is developed. To solve this multi-objective model, a novel multi-objective approach based on fuzzy correlation entropy analysis is proposed firstly. In this multi-objective approach, two types of objective  function value  sequences, namely the referenced function value sequence and comparable function value sequence, are constructed and mapped into two types of  fuzzy sets  by a modified relative membership function. The fuzzy correlation entropy coefficient between the two types of fuzzy sets is used to select better solutions in a multi-objective problem. A discrete multi-objective fireworks algorithm (DMOFWA) is proposed to address the MOFSP-SDST. In the DMOFWA, a new multi-objective approach is adopted to handle the multiple objectives and guide the search of the algorithm. Two kinds of  machine learning  strategies are adopted, namely opposition-based learning (OBL) and  clustering analysis  (CA). The OBL is employed to learn from the current  search space  and improve the exploration ability of DMOFWA, and the CA based on fuzzy correlation entropy coefficient is proposed to cluster firework individuals. Computational and statistical results show that the novel multi-objective approach, OBL and CA strategies can effectively improve the performance of DMOFWA. Furthermore, the results indicate that DMOFWA performs better than four state-of-the-art comparison algorithms.",
    "citation_count": "75",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Lijun He",
            "country": ""
        },
        {
            "name": "Wenfeng Li",
            "country": ""
        },
        {
            "name": "Yu Zhang",
            "country": ""
        },
        {
            "name": "Yulian Cao",
            "country": ""
        }
    ],
    "keywords": []
}