{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000214",
    "title": "A dual-population evolutionary algorithm based on adaptive constraint strength for constrained multi-objective optimization",
    "abstract": "It is challenging to balance convergence and diversity while fully satisfying feasibility when dealing with constrained multi-objective  optimization problems  (CMOPs). Overemphasizing the feasibility optimization of  constraint satisfaction  may lead to the search falling into local optimum, and overemphasizing the  objective optimization  of ignoring constraints may cause a lot of  computational resources  to be wasted in searching for infeasible solutions. This paper proposes a dual-population algorithm called dp-ACS, aiming to seek a balance between constraint satisfaction and  objective optimization . The algorithm proposes a dominance relation to speed up the algorithm’s convergence and an adaptive constraint  strength  strategy to consider the information of excellent infeasible solutions. Specifically, the former defines a new domination relationship to distinguish the pros and cons of  nondominated solutions . The population converges faster by selecting better  nondominated solutions  into the matching pool. The latter is informed by infeasible solutions with good objective values by maintaining two cooperatively complementary populations (i.e.,  m a i n P o p  and  a u x P o p ).  m a i n P o p  uses an adaptive constraint strength function that optimizes the objective of the original problem while satisfying the current constraint strengths. Dynamic adjustment of constraint strength can improve the diversity when the population converges to the boundary of the feasible local region.  a u x P o p  optimizes the unconstrained objective of the original problem, which can provide  m a i n P o p  with favorable information outside the  feasible region  it explores to guide the evolution of  m a i n P o p . Experimental results show that the proposed algorithm was more competitive on four constrained test suites and four real-world CMOPs, compared with seven state-of-the-art  CMOEAs .",
    "citation_count": "22",
    "year": "2023/03/01",
    "authors": [
        {
            "name": "Kaixi Yang",
            "country": ""
        },
        {
            "name": "Jinhua Zheng",
            "country": ""
        },
        {
            "name": "Juan Zou",
            "country": ""
        },
        {
            "name": "Fan Yu",
            "country": ""
        },
        {
            "name": "Shengxiang Yang",
            "country": ""
        }
    ],
    "keywords": []
}