{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001597",
    "title": "A dynamic multi-objective optimization evolutionary algorithm with adaptive boosting",
    "abstract": "Dynamic multi-objective optimization problems (DMOPs) are prevalent in the real world, where the challenge in solving DMOPs is how to track the time-varying Pareto-optimal front (PF) and Pareto-optimal set (PS) quickly and accurately. However, balancing convergence and diversity is challenging as a single strategy can only address a particular type of DMOP. To solve this issue, a dynamic multi-objective optimization evolutionary algorithm with adaptive boosting (AB-DMOEA) is proposed in this paper. In the AB-DMOEA, an adaptive boosting response mechanism will increase the weights of high-performing strategies, including those based on prediction, memory, and diversity, which have been improved and integrated into the mechanism to tackle various problems. Additionally, the dominated solutions reinforcement strategy optimizes the population to ensure the effective operation of the above mechanism. In static optimization, the static optimization boosting mechanism selects the appropriate static multi-objective optimizer for the current problem. AB-DMOEA is compared with the other seven state-of-the-art DMOEAs on 35 benchmark DMOPs. The comprehensive experimental results demonstrate that the overall performance of the AB-DMOEA is superior or comparable to that of the compared algorithms. The proposed AB-DMOEA is also successfully applied to the smart greenhouses problem.",
    "citation_count": "5",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Hu Peng",
            "country": ""
        },
        {
            "name": "Jianpeng Xiong",
            "country": ""
        },
        {
            "name": "Chen Pi",
            "country": ""
        },
        {
            "name": "Xinyu Zhou",
            "country": ""
        },
        {
            "name": "Zhijian Wu",
            "country": ""
        }
    ],
    "keywords": []
}