{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224003146",
    "title": "A feasibility restoration particle swarm optimizer with chaotic maps for two-stage fixed-charge transportation problems",
    "abstract": "This paper delves into solving the two-stage non-linear fixed-charge transportation problem (two-stage NFCTP), where each arc is associated with fixed and variable costs that increase proportionally to the square of the units transported. The presence of fixed charges and non-linear components categorizes this problem as  N P − hard, leading to computational challenges, inefficiencies, and the risk of local optima. To address these challenges, a feasibility restoration particle swarm optimizer with chaotic maps (CEPSO) is presented. The proposed algorithm introduces  (i)  non-linear adaptive inertia weight and acceleration coefficients to maintain better exploration and exploitation rates during the search.  (ii)  Ten chaotic maps are integrated into the acceleration coefficients to enhance optimization capabilities further.  (iii)  Feasibility restoration mechanisms, including constraint compliance adjustment and ratio adjustment procedures, are incorporated to ensure the feasibility of solutions generated by CEPSO. The algorithm’s performance is evaluated across small and large-scale NFCTPs, ranging from 35 to 1044 dimensions, and compared to existing PSO variants using various evaluation metrics. Experimental analyses demonstrate CEPSO’s superior optimization performance for two-stage NFCTPs, positioning it as an advanced framework in this domain and contributing to the novelty of this study. The related codes can be found using this link:  https://github.com/ChauhanDikshit .",
    "citation_count": "0",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Dikshit Shivani",
            "country": ""
        },
        {
            "name": "Deepika Chauhan",
            "country": ""
        }
    ],
    "keywords": []
}