{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217301001",
    "title": "A fitness-based multi-role particle swarm optimization",
    "abstract": "In the canonical  particle swarm optimization  (PSO), “self-cognitive” and “social-learning” play important roles in searching for promising solutions since the two parts can help particles efficiently share their valuable information. In this paper, a fitness-based multi-role PSO (FMPSO) is proposed, in which a new component, named as “subsocial-learning” part, is added to particles' velocity update rule. Moreover, a fitness-based multi-role PSO is proposed, in which three roles, i.e., leader, rambler, and follower, are assigned for particles at each generation based on their fitness. Accordingly, different learning weights for the three parts are introduced for different roles, the aim of which is to help the population carry out various search mechanisms. Furthermore, a particle can adjust its learning exemplar and objective dimensions for the three different parts according the particle's role. During the evolutionary process, two tuning operators are introduce to adjust particles' roles and objective dimensions. The dynamical and diverse learning models of the particles enable the population to deal with different situations. Moreover, a local searching operator based on  BFGS  Quasi-Newton method is proposed to refine the best solution at the later evolutionary stage. Experimental results show that FMPSO outperforms other state-of-art PSOs on a majority of functions in CEC2005 and CEC2013 test suites in terms of the global search ability, solution accuracy, and convergence speed. Two statistical tests also verify the promising performance of FMPSO. Furthermore, experiments aiming to analysis the sensitivity and effectiveness of the new proposed components in FMPSO are also conducted.",
    "citation_count": "67",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Xuewen Xia",
            "country": ""
        },
        {
            "name": "Ying Xing",
            "country": ""
        },
        {
            "name": "Bo Wei",
            "country": ""
        },
        {
            "name": "Yinglong Zhang",
            "country": ""
        },
        {
            "name": "Xiong Li",
            "country": ""
        },
        {
            "name": "Xianli Deng",
            "country": ""
        },
        {
            "name": "Ling Gui",
            "country": ""
        }
    ],
    "keywords": []
}