{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000574",
    "title": "A high-dimensional feature selection algorithm via fast dimensionality reduction and multi-objective differential evolution",
    "abstract": "The multi-objective feature selection problem typically involves two key objectives: minimizing the number of selected features and maximizing classification performance. However, most multi-objective evolutionary algorithms (MOEAs) face challenges in high-dimensional datasets, including low search efficiency and potential loss of search space. To address these challenges, this paper proposes a hybrid algorithm based on fast dimensionality reduction and multi-objective differential evolution with redundant and preference processing (termed DR-RPMODE). In DR-RPMODE, the DR phase uses the freezing and activation operators to remove many irrelevant and redundant features in the high-dimensional datasets, thereby achieving fast dimensionality reduction. Subsequently, the RPMODE algorithm continues the search on the reduced datasets, improving the traditional differential evolutionary framework from two aspects: duplicated and redundant solutions are filtered by redundant handling, and a preference handling method that pays more attention to classification performance is designed for different preference objectives of decision-makers. In the experiment, DR-RPMODE is compared with seven feature selection algorithms on 16 classification datasets. The results indicate that DR-RPMODE outperforms the comparison algorithms on most datasets, demonstrating that it not only achieves outstanding optimization performance but also obtains good classification and scalability results.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Xuezhi Yue",
            "country": ""
        },
        {
            "name": "Yihang Liao",
            "country": ""
        },
        {
            "name": "Hu Peng",
            "country": ""
        },
        {
            "name": "Lanlan Kang",
            "country": ""
        },
        {
            "name": "Yuan Zeng",
            "country": ""
        }
    ],
    "keywords": []
}