{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222000700",
    "title": "A level-based multi-strategy learning swarm optimizer for large-Scale multi-objective optimization",
    "abstract": "The continuous roaming of particles in high-dimensional space makes it difficult for  particle swarm optimization  to achieve better optimization results. On the other hand, increasing the dimensionality may also bring about an explosive increase in the number of locally optimal solutions surrounded by more significant local optimal regions. Therefore, the algorithm requires high convergence while maintaining good diversity. This paper proposes a level-based multi-strategy learning swarm algorithm called LSLSO. LSLSO’s optimization process is divided into the level-based multi-strategies search and the detailed search stages. First, particles are divided into four levels according to their fitness value. When the particles are at different levels, the particles have different learning strategies to update. Particles with better fitness focus on exploiting space. In contrast, particles with poor fitness will focus on exploring space. In the detailed search stage, particles at the same level learn from each other. Particles with similar fitness to detail search for the small gaps in the promising space already explored. The theoretical discussion results show that LSLSO has strong competitiveness in exploration and exploitation capabilities. Moreover, it shows good performance compared with the most advanced large-scale multi-objective optimization algorithms on the LSMOP and LMF problems.",
    "citation_count": "18",
    "year": "2022/08/01",
    "authors": [
        {
            "name": "Sheng Qi",
            "country": ""
        },
        {
            "name": "Juan Zou",
            "country": ""
        },
        {
            "name": "Shengxiang Yang",
            "country": ""
        },
        {
            "name": "Jinhua Zheng",
            "country": ""
        }
    ],
    "keywords": []
}