{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002031",
    "title": "A multi-modal multi-objective evolutionary algorithm based on dual decomposition and subset selection",
    "abstract": "Multi-modal multi-objective problems (MMOPs) arise frequently in  real world applications , in which multiple Pareto-optimal solution sets (PSs) correspond to the same point on the  Pareto front  (PF). Diversity preservation is a crucial issue in multi-modal multi-objective  evolutionary algorithms  (MMOEAs), which aims at evolving the population toward the PF and equivalent PSs with a uniform distribution and good spread. In spite of many diversity preservation approaches in MMOEAs, most of them guarantee the diversity in decision space with a degraded performance in  objective space . To address the above issues, this article proposes a MMEA based on dual decomposition and  subset selection , which employes the  weight vectors  and grids to decompose both the objective and decision spaces. On the basis of dual decomposition, the mating selection are adaptively performed based on estimated  optimization stages  of current  subproblem . Moreover, a subset with good diversity in both the objective and decision spaces are selected from the promising solutions ever collected during the evolution process. Experimental results on 22 benchmark problems demonstrate our advantages to maintain a more balanced diversity in both objective and decision spaces. © 2017 Elsevier Inc. All rights reserved.",
    "citation_count": "7",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Minghui Xiong",
            "country": ""
        },
        {
            "name": "Wei Xiong",
            "country": ""
        },
        {
            "name": "Zheng Liu",
            "country": ""
        },
        {
            "name": "Yali Liu",
            "country": ""
        },
        {
            "name": "Chi Han",
            "country": ""
        }
    ],
    "keywords": []
}