{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000720",
    "title": "A multi-objective evolutionary algorithm for feature selection incorporating dominance-based initialization and duplication analysis",
    "abstract": "The primary objective of feature selection is to reduce the number of features while improving classification performance. Therefore, this problem is typically modeled as a multi-objective optimization problem and can be solved using multi-objective evolutionary algorithms (MOEAs). However, feature selection based on weights derived from preferences may lead to the exclusion of specific features, thereby impacting classification performance. Furthermore, if duplicate individuals are not adequately addressed during the evolutionary process, it may adversely affect the convergence and diversity of the population. In this paper, we propose a multi-objective evolutionary algorithm for feature selection incorporating dominance-based initialization and duplication analysis. To filter features impartially, we transform the correlation issues among features, as well as those between features and labels, into a multi-objective optimization problem by assigning corresponding weights based on their dominance relationships. In addressing the duplication problem within the evolutionary process, the disparity between duplicate individuals as well as between duplicate individuals and elite solutions is analyzed to systematically eliminate redundancy. In the experiments, the proposed method was compared with two classical algorithms and three feature selection algorithms across thirteen datasets. The experimental results indicate that the proposed method exhibits superior classification and optimization performance across the majority of datasets.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Chuili Chen",
            "country": ""
        },
        {
            "name": "Xiangjuan Yao",
            "country": ""
        },
        {
            "name": "Dunwei Gong",
            "country": ""
        },
        {
            "name": "Huijie Tu",
            "country": ""
        }
    ],
    "keywords": []
}