{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216304722",
    "title": "A multi-objective evolutionary artificial bee colony algorithm for optimizing network topology design",
    "abstract": "The topological design of a computer communication network is a well-known NP-hard problem. The problem complexity is further magnified by the presence of multiple design objectives and numerous design constraints. This paper presents a goal programming-based multi-objective  artificial bee colony optimization  (MOABC) algorithm to solve the problem of topological design of distributed local area networks (DLANs). Five design objectives are considered herein, namely, network reliability, network availability, average link utilization, monetary cost, and network delay. Goal programming (GP) is incorporated to aggregate the multiple design objectives into a single objective function. A modified version of MOABC, named as evolutionary multi-objective  ABC  (EMOABC) is also proposed which incorporates the characteristics of simulated evolution (SE) algorithm for improved local search. The effect of  control parameters  of MOABC is investigated. Comparison of EMOABC with MOABC and the standard ABC (SABC) shows better performance of EMOABC. Furthermore, a comparative analysis is also done with non-dominated sorting genetic algorithm II (NSGA-II), Pareto-dominance  particle swarm optimization  (PDPSO) algorithm and two recent variants of decomposition based multi-objective evolutionary algorithms, namely, MOEA/D-1 and MOEA/D-2. Results indicate that EMOABC demonstrated superior performance than all the other algorithms.",
    "citation_count": "45",
    "year": "2018/02/01",
    "authors": [
        {
            "name": "Amani Saad",
            "country": ""
        },
        {
            "name": "Salman A. Khan",
            "country": ""
        },
        {
            "name": "Amjad Mahmood",
            "country": ""
        }
    ],
    "keywords": []
}