{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216302851",
    "title": "A novel orthogonal PSO algorithm based on orthogonal diagonalization",
    "abstract": "One of the major drawbacks of the global  particle swarm optimization  (GPSO) algorithm is zigzagging of the direction of search that leads to premature convergence by falling into local minima. In this paper, a new algorithm named orthogonal PSO (OPSO) algorithm is proposed that not only alleviates the associated problems in GPSO algorithm but also achieves better performance. In OPSO algorithm, the  m  particles of the swarm are divided into two groups: one active group of best  personal experience  of  d  particles and a passive group of personal experience of remaining ( m  ‒  d ) particles. The purpose of creating two groups is to enhance the diversity in the swarm's population. In each iteration, the  d  active group particles undergo an orthogonal diagonalization process and are updated in such way that their position vectors are orthogonally diagonalized. The passive group particles are not updated as their contribution in finding correct direction is not significant. In the proposed algorithm, the particles are updated using only one guide, thus avoiding the conflict between the two guides that occurs in the GPSO algorithm. We tested the OPSO algorithm with thirty unimodal and multimodal high-dimensional benchmark functions and compared its performance with GPSO and several competing evolutionary techniques. With extensive simulated experiments, we have shown superiority of the proposed algorithm in terms of convergence, accuracy, consistency, robustness and reliability over other algorithms. The proposed algorithm is found to be successful in achieving optimal solution in all the thirty benchmark functions.",
    "citation_count": "42",
    "year": "2018/06/01",
    "authors": [
        {
            "name": "Loau Tawfak Al-Bahrani",
            "country": ""
        },
        {
            "name": "Jagdish C. Patra",
            "country": ""
        }
    ],
    "keywords": []
}