{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219304468",
    "title": "A novel design of differential evolution for solving discrete traveling salesman problems",
    "abstract": "Differential evolution is one of the most powerful and popular  evolutionary algorithms , which is primarily used to solve continuous-based  optimization problems . Although differential evolution has been considered unsuitable for solving many permutation-based real-world  combinatorial problems , several efforts for designing an efficient discrete version of the  differential evolution algorithm  have occurred in recent years. This paper introduces a novel discrete differential evolution algorithm for improving the performance of the standard differential evolution algorithm when it is used to solve complex discrete  traveling salesman problems . In this approach, we propose to use a combination of, 1) an improved mapping mechanism to map continuous variables to discrete ones and vice versa, 2) a  k -means clustering-based repairing method for enhancing the solutions in the initial population, 3) an ensemble of mutation strategies for increasing the exploration capability of the algorithm. Finally, for improving the local capability of the proposed algorithm when solving discrete problems, two well-known  local searches  have also been adapted. To judge its performance, the proposed algorithm is compared with those of 27 state-of-the-art algorithms, for solving 45 instances of  traveling salesman problems , with different numbers of cities. The experimental results demonstrated that our technique significantly outperforms most of the  comparative methods , in terms of the average errors from the best-known solutions, and achieved very competitive results with better  computational time  than others.",
    "citation_count": "88",
    "year": "2020/02/01",
    "authors": [
        {
            "name": "Ismail M. Ali",
            "country": ""
        },
        {
            "name": "Daryl Essam",
            "country": ""
        },
        {
            "name": "Kathryn Kasmarik",
            "country": ""
        }
    ],
    "keywords": []
}