{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001797",
    "title": "A novel hybrid simulated annealing algorithm for colored bottleneck traveling salesman problem",
    "abstract": "In the fields, such as intelligent transport and multiple tasks cooperation, many real-world problems can be modeled by colored bottleneck traveling salesman problem (CBTSP). Since CBTSP has been proved belong to the NP-hard problems, the population-based algorithms, such as genetic algorithm (GA), hill climbing GA (HCGA) and simulated annealing GA (SAGA), have been used for solving it. However, in term of convergence speed and solution quality, their performances are limited. Moreover, some intelligent algorithms still have the problems such as “black box problem” or lacking theoretical support. Aiming at these problems, this paper proposes a new hybrid simulated annealing algorithm with generating neighborhood solution and crossover operator (GCSA) for CBTSP. In the iterative process of GCSA, the gene coding (dual-chromosome coding) is used to code feasible solutions, and the improved generating neighborhood solution and crossover operator by ITÖ lemma (Wiener process)  are used to explore and exploit new unknown region. During the process, generating neighborhood solution and crossover operator are both controlled by the activity intensity based on Wiener process. The experiments show that GCSA can demonstrate an improvement over the state-of-the-art algorithms for this problem.",
    "citation_count": "15",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Xueshi Dong",
            "country": ""
        },
        {
            "name": "Qing Lin",
            "country": ""
        },
        {
            "name": "Fanfan Shen",
            "country": ""
        },
        {
            "name": "Qingteng Guo",
            "country": ""
        },
        {
            "name": "Qingshun Li",
            "country": ""
        }
    ],
    "keywords": []
}