{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001730",
    "title": "A novel particle swarm optimization algorithm with Lévy flight and orthogonal learning",
    "abstract": "Taguchi method  This paper presents a novel particle swarm optimization algorithm (PSO) variant to tackle single-objective numerical optimization, named “Lévy flight orthogonal learning particle swarm optimization” (LOPSO). There are three contributions mentioned in the paper: First, a novel PSO based on Lévy flight and orthogonal learning with enhanced exploitation ability and faster search efficiency is proposed. The jumping ability of Lévy flight is utilized to enhance the exploration, while the orthogonal learning process aims to strengthen the exploitation; Second, an orthogonal learning process for particle swarms is developed. In the orthogonal learning process, the Lévy flight term's inclusion in the  Taguchi method  levels is determined based on the flight probability value. Besides, parallel computation is easier to perform during orthogonal learning, which greatly improves efficiency. Third, each particle in the proposed  LOPSO  learns from the only best experience generated by a new search strategy instead of the historical best experience of each particle and the global best experience that is used in the classical PSO variants, thus avoiding the conflict between the above two guides. A large test suite containing benchmarks from the CEC2013 and the CEC2015 test suites on real-parameter single-objective optimization is employed in the algorithm validation, and extensive experiments demonstrate that the comprehensive performance of  LOPSO  ranks first in terms of accuracy and Wilcoxon signed-rank test in most cases with the same population size and iteration steps and similar time consumption, when compared with the canonical PSO and 13 state-of-the-art PSO variants.",
    "citation_count": "47",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Zhenyu Wang",
            "country": ""
        },
        {
            "name": "Yichun Chen",
            "country": ""
        },
        {
            "name": "Sheng Ding",
            "country": ""
        },
        {
            "name": "Deli Liang",
            "country": ""
        },
        {
            "name": "Huan He",
            "country": ""
        }
    ],
    "keywords": []
}