{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001584",
    "title": "A novel Bayesian approach for multi-objective stochastic simulation optimization",
    "abstract": "Multi-objective  stochastic simulation  optimization plays an important role in designing complex engineering systems. To identify optimal solutions via simulations,  Bayesian optimization , which utilizes metamodels and an acquisition function to determine the next design point, has been popular in machine learning. However, studies on Bayesian optimization of multi-objective stochastic simulation are limited and can give undesired performances in terms of convergence and diversity metrics. Moreover, direct extension of Bayesian optimization algorithms of deterministic responses is unrealistic as stochastic responses are observed with heterogeneous noise. To handle these issues, we propose a novel framework for Bayesian optimization of multiple stochastic responses. Stochastic kriging metamodels are constructed independently for multiple stochastic responses considering heterogeneous simulation noise. To remove undesired effects of random simulation noise on comparing solutions,  quantiles  of stochastic kriging metamodels are employed to define the Pareto dominance. Acquisition functions are proposed by integrating the hypervolume-based and probability-of-improvement (PoI)-based acquisition functions from deterministic multi-objective optimization with typical acquisition functions from univariate stochastic response optimization. This not only enhances the convergence and diversity of Pareto-optimal solutions but also properly handles heterogeneous noise. Exact calculation formulas of the proposed algorithms are further developed. Typical numerical cases and two engineering examples (a rocket  injector  design example and a real inventory design scenario) demonstrate that the proposed algorithms give better Pareto-optimal solutions of which the proximity to true Pareto fronts and the diversity are improved.",
    "citation_count": "5",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Mei Han",
            "country": ""
        },
        {
            "name": "Linhan Ouyang",
            "country": ""
        }
    ],
    "keywords": []
}