{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216304047",
    "title": "A production inventory model with price discounted fuzzy demand using an interval compared hybrid algorithm",
    "abstract": "An economic production quantity (EPQ) model in an imprecise environment is proposed, where the production rate, planning horizon and demand coefficients are fuzzy in nature. At the beginning of each cycle a price discount is offered for a period to boost the demand. During this period, demand increases with time depending upon the amount of discount. Here, demand also depends on the unit selling price. After withdrawal of the price discount, demand depends only on the unit selling price. The governing differential equation for the model is obviously fuzzy in nature as the production rate and demand are fuzzy. For this reason, the model is formulated using a fuzzy differential equation and the  α -cut of the total profit from the planning horizon is obtained using fuzzy Riemann integration. To optimize the interval objective function, using a fuzzy preference relation on intervals and a fuzzy possibility/necessity measure, a hybrid algorithm with varying  population size  is developed by combining the features of particle swarm optimization (PSO) and a genetic algorithm (GA). This algorithm is named Interval Compared Hybrid Particle Swarm-Genetic Algorithm (ICHPSGA) and is used to find an optimal decision for the  decision maker  (DM) in different cases of the model. To test the efficiency of the algorithm, it is compared with two other established algorithms namely PSO and PSGA. Numerical experiments are performed to illustrate the model and some interesting observations are made.",
    "citation_count": "22",
    "year": "2017/06/01",
    "authors": [
        {
            "name": "Anindita Kundu",
            "country": ""
        },
        {
            "name": "Partha Guchhait",
            "country": ""
        },
        {
            "name": "Prasenjit Pramanik",
            "country": ""
        },
        {
            "name": "Manas Kumar Maiti",
            "country": ""
        },
        {
            "name": "Manoranjan Maiti",
            "country": ""
        }
    ],
    "keywords": []
}