{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001962",
    "title": "A Q-Learning based NSGA-II for dynamic flexible job shop scheduling with limited transportation resources",
    "abstract": "With the widespread adoption of  intelligent transportation  equipment such as  AGVs  in the manufacturing field, the flexible  job shop scheduling  considering limited transportation resources has increasingly attracted attention. However, current research does not consider various dynamic disturbances in real production scenarios, resulting in lower executability of scheduling solutions. To solve this problem, a dynamic flexible job shop scheduling model with limited transportation resources is established, aiming to minimize makespan and  total energy consumption . Considering three types of disturbances: job cancellation, machine breakdown, and AGV breakdown, the corresponding event-driven rescheduling strategy is proposed, and a rescheduling instability index is designed to measure the performance of the rescheduling strategy. A  Q -Learning-based NSGA-II algorithm (QNSGA-II) is proposed. By learning the feedback historical search experience, it adaptively selects the appropriate neighborhood structures for local search; and a hybrid initialization strategy tailored to the problem characteristics is designed to improve the  optimization performance  of the algorithm. Through simulation experiments, the effectiveness of the rescheduling strategies and the superiority of the QNSGA-II algorithm in solving such problems are validated.",
    "citation_count": "13",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Rensheng Chen",
            "country": ""
        },
        {
            "name": "Bin Wu",
            "country": ""
        },
        {
            "name": "Hua Wang",
            "country": ""
        },
        {
            "name": "Huagang Tong",
            "country": ""
        },
        {
            "name": "Feiyi Yan",
            "country": ""
        }
    ],
    "keywords": []
}