{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000021",
    "title": "A reinforcement learning-based ranking teaching-learning-based optimization algorithm for parameters estimation of photovoltaic models",
    "abstract": "Accurate parameter control and optimization are vital issues in the process of utilizing solar energy through photovoltaic systems, which poses significant challenges due to the inherent complexity of photovoltaic systems. The paper proposes a new algorithm, reinforcement learning-based ranking teaching-learning-based optimization, for identifying photovoltaic model parameters. Parameters play a major role in the performance of many optimization algorithms, and the same parameter is not appropriate for all problems. Reinforcement learning adjusts parameters by accumulating returns to meet the requirements of the environmental model. The proposed algorithm divides learners into superior and inferior groups based on fitness rankings and uses a reinforcement learning approach to dynamically adjust learner classification divisions to ensure adaptability in different optimization scenarios. In the teacher phase, superior learners emulate top performers, while inferior learners engage in guided mutual learning to enhance global search capabilities. In the learner phase, superior learners communicate with better peers, while inferior learners seek a wider range of information sources, balancing exploration and exploitation. In the experimental evaluation of five different photovoltaic models, the comparative analysis of eleven established algorithms verified its superior performance in accuracy, convergence speed, and complexity.",
    "citation_count": "3",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Haoyu Wang",
            "country": ""
        },
        {
            "name": "Xiaobing Yu",
            "country": ""
        },
        {
            "name": "Yangchen Lu",
            "country": ""
        }
    ],
    "keywords": []
}