{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650213000035",
    "title": "A robust clustering method based on blind, naked mole-rats (BNMR) algorithm",
    "abstract": "One of most popular  data clustering  algorithms is  K -means algorithm that uses the distance criterion for measuring the correlation among data. To do that, we should know in advance the number of classes ( K ) and choose  K  data point as an initial set to run the algorithm. However, the choice of  initial points  is a main problem in this algorithm, which may cause that the algorithm converges to local optima. So, some other  clustering algorithms  have been proposed to overcome this problem such as the methods based on  K -means (SBKM),  Genetic Algorithm  (GAPS and VGAPS),  Particle Swarm Optimization  (PSO),  Ant Colony Optimization  (Dynamic ants), Simulated Annealing (SA) and Artificial Bee Colony (ABC) algorithm. In this paper, we employ a new meta-heuristic algorithm. We called it blind, naked mole-rats (BNMR) algorithm, for data clustering. The algorithm was inspired by social behavior of the blind, naked mole-rats colony in searching the food and protecting the colony against invasions. We developed a new data clustering based on this algorithm, which has the advantages such as high  speed of convergence . The experimental results obtained by using the new algorithm on different well-known datasets compared with those obtained using other mentioned methods showed the better accuracy and high speed of the new algorithm.",
    "citation_count": "25",
    "year": "2013/06/01",
    "authors": [
        {
            "name": "Mohammad Taherdangkoo",
            "country": ""
        },
        {
            "name": "Mohammad Hossein Shirzadi",
            "country": ""
        },
        {
            "name": "Mehran Yazdi",
            "country": ""
        },
        {
            "name": "Mohammad Hadi Bagheri",
            "country": ""
        }
    ],
    "keywords": []
}