{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217302730",
    "title": "A semi-supervised Genetic Programming method for dealing with noisy labels and hidden overfitting",
    "abstract": "Data gathered in the real world normally contains noise, either stemming from inaccurate experimental measurements or introduced by human errors. Our work deals with  classification data  where the attribute values were accurately measured, but the categories may have been mislabeled by the human in several sample points, resulting in unreliable  training data .  Genetic Programming  (GP) compares favorably with the Classification and Regression Trees (CART) method, but it is still highly affected by these errors. Despite consistently achieving high accuracy in both training and test sets, many  classification errors  are found in a later validation phase, revealing a previously hidden overfitting to the erroneous data. Furthermore, the evolved models frequently output raw values that are far from the expected range. To improve the behavior of the evolved models, we extend the original training set with additional sample points where the class label is unknown, and devise a simple way for GP to use this additional information and learn in a semi-supervised manner. The results are surprisingly good. In the presence of the exact same mislabeling errors, the additional  unlabeled data  allowed GP to evolve models that achieved high accuracy also in the validation phase. This is a brand new approach to semi-supervised learning that opens an array of possibilities for making the most of the abundance of unlabeled data available today, in a simple and inexpensive way.",
    "citation_count": "14",
    "year": "2018/04/01",
    "authors": [
        {
            "name": "Sara Silva",
            "country": ""
        },
        {
            "name": "Leonardo Vanneschi",
            "country": ""
        },
        {
            "name": "Ana I.R. Cabral",
            "country": ""
        },
        {
            "name": "Maria J. Vasconcelos",
            "country": ""
        }
    ],
    "keywords": []
}