{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021730250X",
    "title": "A set of new compact firefly algorithms",
    "abstract": "Population-based algorithms are among the most successful approaches to optimization. These algorithms require high computational capacities such as memory storage. During the last decade, an alternative approach, called compact optimization, was developed. In real-valued compact algorithms, the population is represented by a probabilistic distribution function. Real-valued compact genetic algorithm was first developed and then the idea was extended to other population-based algorithms, like differential evolution,  particle swarm optimization  and teaching-learning-based optimization. In this paper, we introduce a set of new compact firefly algorithms (cFAs) with minimal computational costs. Our primary aim is to reduce the computational capacity and storage required by the classical variants of FA. The proposed approaches lead to the reduction of the complexity of the attraction model used in FA. The proposed cFAs achieve the optimization with a minimal number of attractions. Several propositions are investigated and reported; such as: elitism strategies, Lévy movements, and opposition-based learning. The proposed algorithms consist of: permanent elitism-based compact firefly algorithm (pe-cFA), non-permanent elitism-based compact firefly algorithms (ne-cFA), permanent elitism-based compact Lévy-flight firefly algorithms (pe-cLFA), non-permanent elitism-based compact Lévy-flight firefly algorithms (ne-cLFA), opposition-based compact firefly algorithms (OBcFA) and opposition-based compact Lévy-flight firefly algorithms (OBcLFA). All the known compact algorithms use normal probability of density function (NPDF) to represent the population. In this paper, a new way is investigated. The alternative solution proposed here is based on uniform PDF (UPDF). Thus, two categories of cFAs are presented: NPDF-based cFAs and UPDF-based cFAs. Hence, for each proposed algorithm, two versions are presented and analyzed. The proposed set of twelve algorithms are tested on the IEEE CEC2014 benchmark functions and compared to the state-of-art of compact evolutionary algorithms (cEAs), swarm intelligent algorithms (SIAs), and the most advanced evolutionary algorithms (EAs). The obtained results show that the proposed cFAs are very competitive and that the uniform distribution is very efficient. The case study of this paper concerns the optimal swing-up control of a  gymnastic  humanoid robot hanging on a bar.",
    "citation_count": "51",
    "year": "2018/06/01",
    "authors": [
        {
            "name": "Lyes Tighzert",
            "country": ""
        },
        {
            "name": "Cyril Fonlupt",
            "country": ""
        },
        {
            "name": "Boubekeur Mendil",
            "country": ""
        }
    ],
    "keywords": []
}