{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000744",
    "title": "A single-objective Sequential Search Assistance-based Multi-Objective Algorithm Framework",
    "abstract": "In recent years, multi-objective optimization has garnered significant attention from researchers. Evolutionary algorithms are proven to be highly effective in solving complex optimization problems in plenty of cases. However, in the pursuit of improved performance, the focus on generality and efficiency has gradually been sidelined. To address this problem, this paper proposes a generalized framework, called Single-objective Sequential Search Assistance-based Multi-objective Algorithm Framework (SSMAF), to enhance the efficiency of existing multi-objective algorithms while reducing computational costs. The framework comprises two phases. The first phase involves two mechanisms to expedite the convergence of the population: (1) A Sequential Search Mechanism (SSM) is utilized to sequentially search corner solutions to enhance the quality of final population, which includes a corner solution search step and a standard solution detection step to search the Pareto Front (PF) while avoiding obtaining unexpected solutions; (2) A Diversity Search Method (DSM) is designed to conduct reinforced searches within localized regions and assess the population’s crowding degree to prevent it from getting stuck in local optima. After obtaining a population with better distribution, the existing multi-objective algorithms can regard it as the initial population to further search the PF. In the experiments, SSMAF is compared with 13 existing algorithms on 42 widely used benchmark test problems and 4 real-world problems. The experimental results show that SSMAF simultaneously improves the solution quality of existing algorithms while reducing their computational complexity.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Peng Chen",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Kangjia Qiao",
            "country": ""
        },
        {
            "name": "Xuanxuan Ban",
            "country": ""
        },
        {
            "name": "P.N. Suganthan",
            "country": ""
        },
        {
            "name": "Hongyu Lin",
            "country": ""
        },
        {
            "name": "Jilong Zhang",
            "country": ""
        }
    ],
    "keywords": []
}