{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000493",
    "title": "A Tutorial On the design, experimentation and application of metaheuristic algorithms to real-World optimization problems",
    "abstract": "In the last few years, the formulation of real-world  optimization problems  and their efficient solution via  metaheuristic algorithms  has been a catalyst for a myriad of research studies. In spite of decades of historical advancements on the design and use of  metaheuristics , large difficulties still remain in regards to the  understandability , algorithmic design uprightness, and performance verifiability of new technical achievements. A clear example stems from the scarce replicability of works dealing with metaheuristics used for optimization, which is often infeasible due to ambiguity and lack of detail in the presentation of the methods to be reproduced. Additionally, in many cases, there is a questionable statistical significance of their reported results. This work aims at providing the audience with a proposal of good practices which should be embraced when conducting studies about metaheuristics methods used for optimization in order to provide scientific rigor, value and transparency. To this end, we introduce a step by step methodology covering every research phase that should be followed when addressing this scientific field. Specifically, frequently overlooked yet crucial aspects and useful recommendations will be discussed in regards to the formulation of the problem, solution encoding, implementation of search operators,  evaluation metrics ,  design of experiments , and considerations for real-world performance, among others. Finally, we will outline important considerations, challenges, and research directions for the success of newly developed optimization metaheuristics in their deployment and operation over real-world application environments.",
    "citation_count": "247",
    "year": "2021/07/01",
    "authors": [
        {
            "name": "Eneko Osaba",
            "country": ""
        },
        {
            "name": "Esther Villar-Rodriguez",
            "country": ""
        },
        {
            "name": "Javier Del Ser",
            "country": ""
        },
        {
            "name": "Antonio J. Nebro",
            "country": ""
        },
        {
            "name": "Daniel Molina",
            "country": ""
        },
        {
            "name": "Antonio LaTorre",
            "country": ""
        },
        {
            "name": "Ponnuthurai N. Suganthan",
            "country": ""
        },
        {
            "name": "Carlos A. Coello Coello",
            "country": ""
        },
        {
            "name": "Francisco Herrera",
            "country": ""
        }
    ],
    "keywords": []
}