{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002761",
    "title": "An archive-assisted multi-modal multi-objective evolutionary algorithm",
    "abstract": "The multi-modal multi-objective optimization problems (MMOPs) pertain to characteristic of the decision space that exhibit multiple sets of Pareto optimal solutions that are either identical or similar. The resolution of these problems necessitates the utilization of optimization algorithms to locate multiple Pareto sets (PSs). However, existing multi-modal multi-objective evolutionary algorithms (MMOEAs) encounter difficulties in concurrently enhancing solution quality in both decision space and objective space. In order to deal with this predicament, this paper presents an Archive-assisted Multi-modal Multi-objective Evolutionary Algorithm, called A-MMOEA. This algorithm maintains a main population and an external archive, which is leveraged to improve the fault tolerance of individual screening. To augment the quality of solutions in the archive, an archive evolution mechanism (AEM) is formulated for updating the archive and an archive output mechanism (AOM) is used to output the final solutions. Both mechanisms incorporate a comprehensive crowding distance metric that employs objective space crowding distance to facilitate the calculation of decision space crowding distance. Besides, a data screening method is employed in the AOM to alleviate the negative impact on the final results arising from undesirable individuals resulting from diversity search. Finally, in order to enable individuals to effectively escape the limitation of niches and further enhance diversity of population, a diversity search method with level-based evolution mechanism (DSMLBEM) is proposed. The proposed algorithm’s performance is evaluated through extensive experiments conducted on two distinct test sets. Final results indicate that, in comparison to other commonly used algorithms, this approach exhibits favorable performance.",
    "citation_count": "1",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Peng Chen",
            "country": ""
        },
        {
            "name": "Zhimeng Li",
            "country": ""
        },
        {
            "name": "Kangjia Qiao",
            "country": ""
        },
        {
            "name": "P.N. Suganthan",
            "country": ""
        },
        {
            "name": "Xuanxuan Ban",
            "country": ""
        },
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Caitong Yue",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        }
    ],
    "keywords": []
}