{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002621",
    "title": "An arithmetic optimization algorithm with balanced diversity and convergence for multimodal multiobjective optimization",
    "abstract": "Multimodal multiobjective optimization problems are widely prevalent in real life. Addressing these challenges is crucial as they directly impact the efficiency and effectiveness of solutions across various domains. This paper proposes a novel Multi-Modal Multi-Objective Arithmetic Optimization Algorithm (MMOP-AOA), aimed at achieving a high balance between diversity and convergence in both decision and objective spaces. Arithmetic Optimization Algorithm (AOA) is a highly competitive metaheuristic optimization algorithm with strong exploration and exploitation capabilities. MMOP-AOA extends the AOA for the first time to solve multimodal multiobjective problems, with the following ideas: Firstly, a new exploration and exploitation strategy (NBC NEE) is designed based on the characteristics of AOA.The strategy utilizes Neighborhood-Based Clustering (NBC) to partition the decision space into multiple clusters, aiding MMOP-AOA in capturing more equivalent Pareto subsets (ePSs). Secondly, a convergence and diversity balance mechanism (CDBM) is developed. This mechanism involves comparing the convergence indicator and diversity indicator to select different mutation strategies. Thirdly, an improved crowding distance (ICD) is proposed to address the deficiencies of existing special crowding distance measures. The effectiveness of CDBM and ICD is demonstrated in the paper through experiments on 22 benchmark functions from CEC-2019 and a real-world problem of signal timing optimization at road intersections. The research also reveals that compared to four other advanced multimodal multiobjective optimization algorithms, MMOP-AOA exhibits superior search capability and stability. Furthermore, MMOP-AOA utilizes Neighborhood-Based Clustering (NBC) to partition the decision space into multiple clusters, aiding MMOP-AOA in capturing more equivalent Pareto subsets (ePSs) and provides a theoretical framework for other metaheuristic optimization algorithms to tackle multimodal multiobjective problems.",
    "citation_count": "3",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Ruyue Zhang",
            "country": ""
        },
        {
            "name": "Shuhua Mao",
            "country": ""
        },
        {
            "name": "Shangrui Zhao",
            "country": ""
        },
        {
            "name": "Chang Liu",
            "country": ""
        }
    ],
    "keywords": []
}