{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224002876",
    "title": "An adaptive interval many-objective evolutionary algorithm with information entropy dominance",
    "abstract": "Interval many-objective optimization problems (IMaOPs) involve more than three conflicting objectives with interval parameters. Various real-world applications under uncertainty can be modeled as IMaOPs to solve, so effectively handling IMaOPs is crucial for solving practical problems. This paper proposes an adaptive interval many-objective evolutionary algorithm with information entropy dominance (IMEA-IED) to tackle IMaOPs. Firstly, an interval dominance method based on information entropy is proposed to adaptively compare intervals. This method constructs convergence entropy and uncertainty entropy related to interval features and innovatively introduces the idea of using global information to regulate the direction of local interval comparison. Corresponding interval confidence levels are designed for different directions. Additionally, a novel niche strategy is designed through interval population partitioning. This strategy introduces a crowding distance increment for improved subpopulation comparison and employs an updated reference vector method to adjust the search regions for empty subpopulations. The IMEA-IED is compared with seven interval optimization algorithms on 60 interval test problems and a practical application. Empirical results affirm the superior performance of our proposed algorithm in tackling IMaOPs.",
    "citation_count": "5",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Zhihua Cui",
            "country": ""
        },
        {
            "name": "Conghong Qu",
            "country": ""
        },
        {
            "name": "Zhixia Zhang",
            "country": ""
        },
        {
            "name": "Yaqing Jin",
            "country": ""
        },
        {
            "name": "Jianghui Cai",
            "country": ""
        },
        {
            "name": "Wensheng Zhang",
            "country": ""
        },
        {
            "name": "Jinjun Chen",
            "country": ""
        }
    ],
    "keywords": []
}