{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000233",
    "title": "An experimental approach to designing grouping genetic algorithms",
    "abstract": "Grouping problems are a special case of  combinatorial problems  that emerge in several practical and theoretical situations, where the goal is to find the optimal groups that minimize an objective function. One of the most outstanding  metaheuristics  to solve them is the Grouping  Genetic Algorithm  (GGA). Nevertheless, many grouping problems have very complex  search spaces  with unique and hard features that demand sophisticated search processes; therefore, their solution implies designing GGAs with specific-purpose intelligent heuristic strategies. This work presents an experimental approach to designing high-performance GGAs by analyzing in isolation its components and studying the weaknesses and  strengths  of its optimization process. Furthermore, we introduce a  case study  to develop a GGA for the Parallel Machine-Scheduling with Unrelated Machines and Makespan Minimization ( R | | C m a x ) problem to show the aspects to consider by implementing the proposed experimental approach. The information generated from this study allowed us to recognize the appropriate intelligent heuristic strategies for every genetic component, giving rise to the Grouping Genetic Algorithm with Intelligent Heuristic Strategies (GGA-IHS). The experimental results showed the usefulness of our proposal since GGA-IHS is about 91% better than the state-of-the-art Grouping Genetic Algorithm with Controlled Genes Transmission (GGA-CGT) for the  R | | C m a x  problem. Additionally, the experimental results indicate that the GGA-IHS performance is comparable with state-of-the-art  solution methods  by using only 10000 generations. The outcome of this work demonstrates the importance of knowing in-depth the problem to solve and the algorithmic behavior of each intelligent heuristic strategy included in every GGA.",
    "citation_count": "1",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Octavio Ramos-Figueroa",
            "country": ""
        },
        {
            "name": "Marcela Quiroz-Castellanos",
            "country": ""
        }
    ],
    "keywords": []
}