{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224003535",
    "title": "An effective cooperative coevolutionary algorithm with global and local-oriented cooperative mechanisms for multi-objective hybrid flowshop lot-streaming scheduling with limited and flexible sub-lots",
    "abstract": "Job-splitting is a universally recognized approach to improve production efficiency, particularly in cases where the job lot size is excessively large. Flexible sub-lots that have unequal sizes and can be processed by parallel machines at each stage promote the on-time delivery of the full lot of a job. However, the tool resources in the workshop are limited, and the number of available tools strictly limits the maximum number of sub-lots. Hence, this work addresses a hybrid flowshop lot-streaming scheduling problem with limited and flexible sub-lots for simultaneous minimization of  makespan  and due time deviation. A mixed-integer linear programming model is formulated to identify the particular character, the coexistence of two types of time overlaps, which contributes to the simultaneous optimization of two objectives to a large extent. An effective cooperative coevolutionary algorithm with global and local-oriented cooperative mechanisms is thereafter proposed. Specifically, the semi-random initialization and heuristic decoding respectively advocates time-overlaps among sub-lots processed by parallel machines within stages and by machines at successive stages. A global-oriented cooperative mechanism, containing multipoint preservative crossover and critical machine-based crossover, is developed to enable the coevolution of two populations and enhance global convergence. A local-oriented cooperative mechanism, consisting of critical path/pair-based local search heuristics and a restart operator, is designed for deep exploitation in the complete solution space. A slope-based dichotomy is proposed to improve computational efficiency. Finally, experimental results demonstrate the effectiveness of three improvements and the superiority of the proposed algorithm.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Yingying Zhu",
            "country": ""
        },
        {
            "name": "Qiuhua Tang",
            "country": ""
        },
        {
            "name": "Zikai Zhang",
            "country": ""
        },
        {
            "name": "Ronghua Meng",
            "country": ""
        },
        {
            "name": "Siwei Huang",
            "country": ""
        }
    ],
    "keywords": []
}