{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218306552",
    "title": "An improved artificial bee colony algorithm combined with extremal optimization and Boltzmann Selection probability",
    "abstract": "Artificial Bee Colony (ABC) algorithm is an optimization algorithm based on a particular intelligent behavior of honeybee swarms. The standard ABC has been utilized to deal with a lot of optimization problems in real world. However, there are still some defects of the standard ABC such as weak local-search capability and low solution precision. In order to improve the performance of ABC, in this paper, we propose two improved versions of ABC-EO and IABC-EO presented in our previous work, called ABC-EO II and IABC-EO II, where Extremal Optimization (EO) is introduced to ABC and IABC in different ways. There are some advanced characteristics of our proposed algorithms: (1) Compared with ABC-EO and IABC-EO, the improved versions have lower computational costs by introducing EO in different ways; (2) An easier-operated mutation method is introduced which can increase the diversity of new offspring and helps our algorithms jump out of local optima; (3) The selection pressure can be dynamically adjusted in evolutionary process by means of Boltzmann selection probability; (4) A novel selection probability is used to select the worse solutions for the mutation operation by EO mechanism. The experimental results on three groups of benchmark functions indicate that the performance of the proposed algorithms is as good as or superior to those of 15 state-of-the-art optimization algorithms in terms of solution accuracy, convergence speed, successful rate and statistical tests. Finally, in order to testify the feasibilities of the proposed methods for solving the real life problems, our algorithms are applied to solving two kinds of parameters identification of photovoltaic models and four well-recognized evolutionary algorithms are selected as the competitors. The simulation results indicate that the proposed IABC-EO II algorithm has superior performance in comparison with other five algorithms, while the proposed ABC-EO II outperforms at least competitive with other four algorithms in term of solution accuracy and statistical tests. As a result, our algorithms may be good alternatives for solving complex unconstrained continuous optimization problems.",
    "citation_count": "43",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "Min-Rong Chen",
            "country": ""
        },
        {
            "name": "Jun-Han Chen",
            "country": ""
        },
        {
            "name": "Guo-Qiang Zeng",
            "country": ""
        },
        {
            "name": "Kang-Di Lu",
            "country": ""
        },
        {
            "name": "Xin-Fa Jiang",
            "country": ""
        }
    ],
    "keywords": []
}