{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001184",
    "title": "An iterated greedy algorithm with acceleration of job allocation probability for distributed heterogeneous permutation flowshop scheduling problem",
    "abstract": "Distributed manufacturing paradigm is becoming one of the dominant manufacturing models today. Heterogeneities between factories exist in fact due to the differences in process flexibility and machine performance. Most research focuses on identical distributed factories and overlooks the influence of heterogeneous factories on the  subproblem  of job allocation. This paper investigates a distributed heterogeneous permutation  flowshop scheduling  problem (DHPFSP) to minimize the makespan, and a mixed-integer linear programming (MILP) model is established. Building upon a special phenomenon of job assignment to a specific heterogeneous factory in DHPFSP, an iterated  greedy algorithm  with acceleration of job allocation probability (IGP) is proposed. To utilize this phenomenon, a job allocation probability matrix is introduced to describe the trend of job allocation, and a fast pass strategy with job allocation probability is suggested to speed up the algorithm search process. Furthermore, to generate a high-quality initial solution quickly for IGP, an NEH-based heuristic framework for distributed heterogeneous factory environment (NEHDHF) is proposed. In NEHDHF, several distinct initial job sequence generation strategies and a new first-f job allocation strategy are proposed for obtain a better initial solution. In computational experiments, there are 720 test instances designed and publicized. The IGP achieves 535 best solutions out of 720 instances. Statistically sound results demonstrate the effectiveness of the presented algorithms for the  considered problem .",
    "citation_count": "9",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Haoran Li",
            "country": ""
        },
        {
            "name": "Xinyu Li",
            "country": ""
        },
        {
            "name": "Liang Gao",
            "country": ""
        }
    ],
    "keywords": []
}