{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000112",
    "title": "An interval evolutionary algorithm based on dynamic relation adjustment strategy for many-objective problems",
    "abstract": "Interval many-objective optimization problems (IMaOPs) are a kind of uncertain optimization problems. It is characterized by four or more objectives, at least one of which is an interval objective caused by parameter uncertainty. The upper and lower bounds of the interval objective make it difficult to take into account the relationship between convergence, diversity and uncertainty in the process of solving IMaOPs. In this paper, an interval many-objective evolutionary algorithm based on dynamic relation adjustment (IMaOEA-DRA) is proposed to aim at this challenge. Firstly, a dynamic interval pareto dominance (DIP-dominance) strategy is designed to adaptively adjust the proportion weight between individual uncertainty and convergence according to the number of iterations in the process of environment selection, so that the algorithm can maintain a good evolutionary direction while maintaining uncertainty. In addition, to ensure population diversity, penalty-based interval boundary intersections (PIBI) indicator is proposed and calculated in different clustering subspaces to select elite interval individuals. Finally, IMaOEA-DRA is tested on 23 benchmarks of IMaOPs. The numerical results show the superior performance of the proposed interval optimization method.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Zhang jingbo",
            "country": ""
        },
        {
            "name": "Zhang zhixia",
            "country": ""
        },
        {
            "name": "Cai xingjuan",
            "country": ""
        },
        {
            "name": "Cai jianghui",
            "country": ""
        },
        {
            "name": "Chen jinjun",
            "country": ""
        }
    ],
    "keywords": []
}