{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218300853",
    "title": "An immune network based distributed architecture to control public bus transportation systems",
    "abstract": "Although many Public Transportation Control Systems (PTCS) were developed to support the management of public transportation systems, there is still a need to improve the capability of PTCS to deal with a variety of disturbance types, which may degrade performance (e.g. earliness/delay) and  quality of service  (QoS, e.g. punctuality, frequency and utilization). This paper extends our previous works on artificial  immune systems  to control Public Transportation Systems by means of buses (PTS). The main contribution consists in developing a distributed reaction mechanism based on the immune network theory and its related mechanisms, such as cell co-stimulation, co-suppression, activation and coordination. The immune network reaction mechanism is implemented within a distributed multi-agent architecture, and its performance is assessed using traffic simulation software. The immune network reaction mechanism is benchmarked against other control strategies (holding at station, skip station, and their combination), and performance is evaluated based on three classes of criteria: time oriented criteria, passenger oriented criteria and service oriented criteria. The performance of the suggested system with respect to passenger and service oriented criteria was remarkably higher than the performance of other control algorithms. With respect to time oriented criteria, the performance of the suggested system was found slightly better than the combination of holding and skipping stations.",
    "citation_count": "8",
    "year": "2019/11/01",
    "authors": [
        {
            "name": "Salima Mnif",
            "country": ""
        },
        {
            "name": "Sabeur Elkosantini",
            "country": ""
        },
        {
            "name": "Saber Darmoul",
            "country": ""
        },
        {
            "name": "Lamjed Ben Said",
            "country": ""
        }
    ],
    "keywords": []
}