{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001281",
    "title": "An improved iterative greedy athm for energy-efficient distributed assembly no-wait flow-shop scheduling problem",
    "abstract": "With the development of the economy and technology, distributed manufacturing and green manufacturing are becoming more and more important parts of intelligent manufacturing. In this paper, an energy-efficient distributed assembly no-wait  flow shop scheduling  problem (EEDANWFSP) is proposed to minimize assembly completion time and total energy consumption. An improved iterative greedy (IIG) algorithm is proposed, which includes initialization, destruction, and construction, seven sequence-dependent and speed-dependent search strategies, and energy-saving operations. The initialization operation makes full use of the specific rules of the problem, constructs an initial job sequence for each product according to the principle of the shortest processing time, and then constructs the product sequence according to the assembly completion time of the product. Destruction and construction mechanisms generate a candidate individually. Seven search strategies operate on critical factories, randomly selecting possible locations where jobs or products are inserted or swapped into the rest of the sequence. Finally, an energy-saving strategy is used to optimize the energy consumption index. Experimental results on 900 small-scale and 810 large-scale benchmark tests demonstrate the effectiveness of IIG in addressing energy-efficient EEDANWFSP.",
    "citation_count": "11",
    "year": "2023/08/01",
    "authors": [
        {
            "name": "Fuqing Zhao",
            "country": ""
        },
        {
            "name": "Zesong Xu",
            "country": ""
        },
        {
            "name": "Xiaotong Hu",
            "country": ""
        },
        {
            "name": "Tianpeng Xu",
            "country": ""
        },
        {
            "name": "Ningning Zhu",
            "country": ""
        }
    ],
    "keywords": []
}