{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022500001X",
    "title": "An improved shuffled frog leaping algorithm based on support vector machine for hybrid flow shop rescheduling with disturbance prediction",
    "abstract": "The current research on casting scheduling focuses on multi-resource constraints and the disturbances on machines, transport, and other resources. The uncertain disturbance have the potential to significantly disrupt the casting process, leading instability and delay in the whole manufacturing system. The evaluation and prediction for disturbance is a key challenge in solving the casting scheduling problem. This paper presents a hybrid flow shop rescheduling model for the casting process, which considers the maximum completion time and delay as the optimization targets under a disturbing environment. A disturbance degree evaluation system comprising five indicators in casting was established, and a classification prediction model based on a support vector machine (SVM) is developed. An improved shuffled frog leaping algorithm (ISFLA) is proposed. First, an coding and an improved NEH initialization method are designed for the single-batch coupling and resource-constrained problems. Secondly, an improved module group search strategy based on a multi-classified SVM prediction model to establish the relationship between the severity of disturbance events and the algorithmic strategy. Finally, the efficacy of the proposed casting rescheduling model under disturbance environment and the ISFLA are validated through the simulation experiments and case study.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Wei Zhang",
            "country": ""
        },
        {
            "name": "Shaofeng Yan",
            "country": ""
        },
        {
            "name": "Hongtao Tang",
            "country": ""
        },
        {
            "name": "Xing Li",
            "country": ""
        },
        {
            "name": "Deming Lei",
            "country": ""
        }
    ],
    "keywords": []
}