{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001171",
    "title": "An offline learning co-evolutionary algorithm with problem-specific knowledge",
    "abstract": "The meta-heuristics is an effective way to solve the complex optimization problems. However, the applicability of meta-heuristic is restricted in real applications due to the various characteristics of the corresponding problems. An offline learning co-evolutionary algorithm (OLCA) based on the fitness landscape analysis that introduces the Gaussian estimation of distribution algorithm (EDA) and a variant of differential evolution (DE) for enhancing the search ability, is proposed for complex continuous real-valued problems. The relationship between strategies and fitness landscapes is established by using offline learning of a random forest. The suitable strategy is determined based on the properties of the fitness landscape trained by a random forest before the beginning of the evolutionary process. The proposed OLCA is tested by using the CEC 2017 benchmark test suite and is compared with several state-of-the-art algorithms. The results show that the proposed OLCA is efficient and competitive for solving complex continuous optimization problems. In addition, the effectiveness of the proposed OLCA is also verified by using 19 IEEE CEC 2011 benchmark problems for tackling real-world problems.",
    "citation_count": "12",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Fuqing Zhao",
            "country": ""
        },
        {
            "name": "Bo Zhu",
            "country": ""
        },
        {
            "name": "Ling Wang",
            "country": ""
        },
        {
            "name": "Tianpeng Xu",
            "country": ""
        },
        {
            "name": "Ningning Zhu",
            "country": ""
        },
        {
            "name": "Jonrinaldi Jonrinaldi",
            "country": ""
        }
    ],
    "keywords": []
}