{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219301567",
    "title": "Chaotic particle swarm optimization with sigmoid-based acceleration coefficients for numerical function optimization",
    "abstract": "Particle swarm optimization  (PSO) is a stochastic computation technique motivated by intelligent collective behavior of some animals, which has been widely used to address many hard  optimization problems . However, like other  evolutionary algorithms , PSO also suffers from premature convergence and entrapment into local optima when dealing with complex multimodal problems. In this paper, we propose a chaotic particle swarm optimization with sigmoid-based acceleration coefficients (abbreviated as CPSOS). On the one hand, the frequently used logistic map is applied to generate well-distributed initial particles. On the other hand, the sigmoid-based acceleration coefficients are formulated to balance the global search ability in the early stage and the global convergence in the latter stage. In particular, two sets of slowly varying function and regular varying function embedded update mechanism in conjunction with the chaos based re-initialization and  Gaussian  mutation strategies are employed at different evolution stages to update the particles during the whole search process, which can effectively keep the diversity of the swarm and get out of possible local optima to continue exploring the potential search regions of the  solution space . To validate the performance of CPSOS, a series of experiments are conducted and the simulation results reveal that the proposed method can achieve better performance compared to several state-of-the-art  PSO variants  in terms of solution accuracy and effectiveness.",
    "citation_count": "103",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Dongping Tian",
            "country": ""
        },
        {
            "name": "Xiaofei Zhao",
            "country": ""
        },
        {
            "name": "Zhongzhi Shi",
            "country": ""
        }
    ],
    "keywords": []
}