{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001663",
    "title": "Collaborative scheduling of production resources and spare parts inventory for distributed equipment with feedback guidance and minimum capacity loss",
    "abstract": "Previous studies on production scheduling have neglected the impact of the supply mode of inventory allocation on the arrangement of production resources and guiding significance of delivery information to the demand side. To fill these gaps, this study investigates a collaborative scheduling model of production resources and spare parts inventory to satisfy the spare parts requirements of demand-side distributed equipment, and we propose feedback guidance based on delivery information to reduce the  negative impact  of delayed spare parts. The feedback guidance adopts an optimal operating strategy to reduce the capacity loss of the equipment corresponding to the delayed spare parts. An optimization objective, referred to as the total capacity loss of all distributed equipment, is introduced to visually display the effect of the scheduling scheme on the demand side. Another objective is to minimize the total service cost of the service provider, including the inventory, transportation, and tardiness costs. A modified restarted iterated Pareto  greedy algorithm  is proposed to solve the model. Based on the problem characteristics, certain effective operators, including two problem-dependent local-search operators and a modified idle-time  insertion method , are designed to improve the search performance. Extensive experiments are conducted to demonstrate the effectiveness of the algorithm, including the feedback guidance and proposed operators. Finally, the impact of different inventory levels on the service provider and demand side is analyzed, and the results indicate that the collaborative mode can effectively reduce inventory.",
    "citation_count": "8",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Like Zhang",
            "country": ""
        },
        {
            "name": "Qianwang Deng",
            "country": ""
        },
        {
            "name": "Zhen Wang",
            "country": ""
        },
        {
            "name": "Guiliang Gong",
            "country": ""
        },
        {
            "name": "Xiaoyu Wen",
            "country": ""
        },
        {
            "name": "Xiaoyan Liu",
            "country": ""
        }
    ],
    "keywords": []
}