{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000695",
    "title": "Constraint subsets-based evolutionary multitasking for constrained multiobjective optimization",
    "abstract": "Constrained multiobjective  optimization problems  (CMOPs) are challenging because they need to optimize multiple conflicting objectives and satisfy various constraints simultaneously. To solve CMOPs, various constrained  multiobjective evolutionary algorithms  have been proposed in recent years. However, most of them tackle constraints by considering all constraints or zero constraint scenarios, these extreme treatment methods may be unable to utilize the information of multiple constraint subsets composed of partial constraints to maintain more promising infeasible solutions. To remedy this issue, a constraint subsets-based evolutionary multitasking method is developed, where a CMOP is transformed into a multitasking optimization problem by creating multiple simple  auxiliary  CMOPs. Particularly, the original CMOP is the main task, while the newly created CMOPs with different constraint subsets are the auxiliary tasks. Each task will be evolved by one specific population, and the knowledge transfer is conducted among tasks to realize the collaborative search. Meanwhile, the updating of the auxiliary task involves two stages. In the first stage, each auxiliary population will evolve to approach the  pareto front  of the constraint subset (s-CPF), promoting crossing the infeasible regions. While in the second stage, a feasible region-based search mechanism is proposed to approach the pareto front of the main task from each s-CPF, by utilizing unique and promising infeasible solutions. In addition, systematic experiments are carried out on three benchmark test suites and four real-world CMOPs. The experimental results fully demonstrate that the proposed algorithm is highly competitive with other state-of-the-art constrained multiobjective evolutionary algorithms.",
    "citation_count": "3",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Lingjun Wang",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Heshan Wang",
            "country": ""
        },
        {
            "name": "Kangjia Qiao",
            "country": ""
        },
        {
            "name": "Tianye Liang",
            "country": ""
        }
    ],
    "keywords": []
}