{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022100167X",
    "title": "Coverage path planning of heterogeneous unmanned aerial vehicles based on ant colony system",
    "abstract": "Unmanned aerial vehicle  (UAV) has been extensively studied and widely adopted in practical systems owing to its effectiveness and flexibility. Although heterogeneous UAVs have an enormous advantage in improving performance and conserving energy with respect to homogeneous ones, they give rise to a complex  path planning  problem. Especially in large-scale cooperative search systems with multiple separated regions, coverage  path planning  which seeks  optimal paths  for UAVs to completely visit and search all of regions of interest, has a NP-hard computation complexity and is difficult to settle. In this work, we focus on the coverage  path planning problem  of heterogeneous UAVs, and present an  ant colony  system (ACS)-based algorithm to obtain good enough paths for UAVs and fully cover all regions efficiently. First, models of UAVs and regions are built, and a linear programming-based formulation is presented to exactly provide the best point-to-point flight path for each UAV. Then, inspired by the  foraging behaviour  of ants that they can obtain the shortest path between their nest and food, an ACS-based heuristic is presented to seek approximately optimal solutions and minimize the time consumption of tasks in the cooperative search system. Experiments on randomly generated regions have been organized to evaluate the performance of the new heuristic in terms of  execution time ,  task completion time  and deviation ratio.",
    "citation_count": "196",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Jinchao Chen",
            "country": ""
        },
        {
            "name": "Fuyuan Ling",
            "country": ""
        },
        {
            "name": "Ying Zhang",
            "country": ""
        },
        {
            "name": "Tao You",
            "country": ""
        },
        {
            "name": "Yifan Liu",
            "country": ""
        },
        {
            "name": "Xiaoyan Du",
            "country": ""
        }
    ],
    "keywords": []
}