{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001353",
    "title": "Decomposition-based evolutionary algorithm with dual adjustments for many-objective optimization problems",
    "abstract": "Balancing the convergence and diversity of solutions is a pivotal task for many-objective  optimization problems  (MaOPs). The decomposition-based  evolutionary algorithm  has demonstrated great potential in solving MaOPs in the past years. However, its performance degrades when MaOPs have complex  Pareto fronts  (PFs). Inspired by its pros and cons, this paper proposes a decomposition-based  evolutionary algorithm  adopting dual adjustments to address MaOPs with irregular PFs. First, an MaOP is divided into a set of  subproblems  by the distance between  weight vectors . Each subproblem selects an appropriate solution from its region, using the specified scalarizing function. Then, the first adjustment updates all the scalarizing functions for each weight vector, where a strategy integrating history information is used to promote the accuracy of the adjustment. Sequentially, the second adjustment updates  weight vectors  based on the population distribution, which simulates and modifies the  value function  of  reinforcement learning  to intensify the rationality of updates. Note that the  excitation frequencies  of two adjustments are adaptive. Additionally, we design fine-tuning introducing reminding solutions to enhance exploitation. Finally, numerous experiments demonstrate that the proposed algorithm performs better or is equivalent to five state-of-the-art algorithms on 150 test instances and one practical problem .",
    "citation_count": "4",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Chunliang Zhao",
            "country": ""
        },
        {
            "name": "Yuren Zhou",
            "country": ""
        },
        {
            "name": "Yuanyuan Hao",
            "country": ""
        }
    ],
    "keywords": []
}