{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304430",
    "title": "Decomposition-based multiobjective optimization with bicriteria assisted adaptive operator selection",
    "abstract": "This paper proposes a novel bicriteria assisted adaptive operator selection (B-AOS) strategy for decomposition-based multiobjective evolutionary algorithms (MOEA/Ds). In this approach, two operator pools are employed to focus on exploitation and exploration, each of which includes two DE operators with distinct search patterns. Then, two criteria, one (called the Pareto criterion) emphasizing convergence and the other (called the crowding criterion) focusing on diversity, are collaboratively used to assist the selection of a suitable DE operator for the current solution, which aims to obtain a good balance between exploitation and exploration during the evolutionary search of each solution. Specifically, the Pareto criterion is used to decide whether exploration or exploitation is preferred for the current solution, which will help to select an operator pool. After that, from the selected operator pool, the crowding criterion is used to further assist the selection of the DE operator based on a binary tournament strategy. The experimental results show that our proposed B-AOS performs better than other existing state-of-the-art adaptive operator selection methods, and several MOEA/Ds embedded with B-AOS can significantly improve their performance on most of the benchmark problems adopted.",
    "citation_count": "18",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Wu Lin",
            "country": ""
        },
        {
            "name": "Qiuzhen Lin",
            "country": ""
        },
        {
            "name": "Junkai Ji",
            "country": ""
        },
        {
            "name": "Zexuan Zhu",
            "country": ""
        },
        {
            "name": "Carlos A. Coello Coello",
            "country": ""
        },
        {
            "name": "Ka-Chun Wong",
            "country": ""
        }
    ],
    "keywords": []
}