{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065021930392X",
    "title": "Development of particle swarm and topology optimization-based modeling for mandibular distractor plates",
    "abstract": "Mandibular Distraction Osteogenesis (MDO) is a common clinical procedure to correct mandibular  retrognathia . However, since there is not a gold standard for determining the screw positions for current MDO operations, deviation of distraction direction and  malocclusion  increases. This case results in need of additional operations that affect the callus stability. In these cases, relapse risk increases and remodelling period gets longer. On the other hand, large volume of the distractor plates results in more invasive treatment and negatively affects the patients’ comfort. To overcome these problems, this study offers a new method including; virtual surgery simulation, determining the optimum screw configuration using  particle swarm optimization  loop linked between MATLAB-PYTHON-ANSYS programs and the design of distractor  plate geometry  with topology optimization. In order to test the proposed method, two different Finite Element (FE) models, CM and OM, were established based on conventional and optimum method, respectively.  FEA  results of the current study reveals that OM has 33.56% less displacement compared to CM, and the most critical screw in terms of screw loosening for OM has 35.29% less strain value than CM. These outcomes show OM shows superior callus stability in comparison with CM. On the other hand, redesign of the distractor plates using topology optimization according to the best screw positions provides 43.32% reduction in the total implant volume which means reduced cost and a less invasive MDO operation. Therefore, the clinical use of this protocol is expected to increase the success of the operation by shortening the recovery period.",
    "citation_count": "12",
    "year": "2020/03/01",
    "authors": [
        {
            "name": "Abdullah Tahir Şensoy",
            "country": ""
        },
        {
            "name": "Irfan Kaymaz",
            "country": ""
        },
        {
            "name": "Ümit Ertaş",
            "country": ""
        }
    ],
    "keywords": []
}