{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304697",
    "title": "Differential evolution algorithm with fitness and diversity ranking-based mutation operator",
    "abstract": "Differential evolution (DE) is a simple and efficient global  optimization algorithm . Benefitting from its concise structure and strong search ability, DE has been widely used in various fields. Generally, the convergence performance of DE largely depends on its mutation operation. Meanwhile, individuals’ positions, which are selected as  base vectors  or making up difference vectors, are very important in mutation strategy. In this paper, we propose a  differential evolution algorithm  with both fitness and diversity ranking-based  mutation operator  (FDDE). Different from methods that use fitness as the only index to measure the quality of individuals, FDDE aims to assign suitable position for each individual in the mutation strategy by together considering both individuals’ fitness and their diversity contribution. Firstly, a new method of estimating the individual diversity by fitness values has been proposed. Then, each individual's fitness ranking and diversity contribution are considered together to calculate a newly defined individual's final ranking. Finally, the final ranking are used in the mutation strategy. The newly improved  mutation operator  could be integrated with any classical or advanced DE variants with little additional time or space complexity. The proposed FDDE is compared with some DE variants based on numerical experiments over the CEC (Congress on Evolutionary Computation) 2005 benchmark sets, CEC 2013 benchmark sets and CEC 2014 benchmark sets. Experimental results clearly indicate that FDDE performs better on most test functions and improves the convergence performance of its competitors of jDE, rank-jDE, advanced SHADE, rank-SHADE and  L -SHADE in both low and high dimensional problems.",
    "citation_count": "82",
    "year": "2021/03/01",
    "authors": [
        {
            "name": "Jianchao Cheng",
            "country": ""
        },
        {
            "name": "Zhibin Pan",
            "country": ""
        },
        {
            "name": "Hao Liang",
            "country": ""
        },
        {
            "name": "Zhaoqi Gao",
            "country": ""
        },
        {
            "name": "Jinghuai Gao",
            "country": ""
        }
    ],
    "keywords": []
}