{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217309288",
    "title": "Distributed operation of collaborating unmanned aerial vehicles for time-sensitive oil spill mapping",
    "abstract": "Multiple simple agents working together to achieve a common complex goal embodies the underlying theme of swarm concepts, with decentralized decision-making serving as the new frontier for tackling challenges associated with scalability,  fault tolerance , and communication constraints. This paper builds on this emerging paradigm to develop a distributed approach (called PSOil) for off-shore oil spill mapping using a team of  unmanned aerial vehicles  or UAVs. In-flight waypoint planning is achieved via a new  particle swarm  mechanics-inspired technique, employing a novel combination of  anomaly detection  for  knowledge extraction , and a stochastic occupancy grid approach for timely processing and frugal sharing of knowledge (with net communications <1.7 KB/UAV every 10 waypoints). A total of ten real-world oil spill images, encapsulating complexities such as non-convex  arbitrary shapes  and disjointed segments, are studied in this work. Overall, the algorithm registered 55–90% completeness in mapping oil-covered areas. PSOil required around one-third the time necessary for an exhaustive survey and was found to be superior compared to a typical  random walk  and a spiral search approach w.r.t. mapping performance and efficiency, respectively. Further tests simulating increasing UAV team sizes (to deal with larger search areas) and the random loss of team members respectively illustrate the scalability and fault-tolerance characteristics of PSOil.",
    "citation_count": "39",
    "year": "2019/05/01",
    "authors": [
        {
            "name": "Philip Odonkor",
            "country": ""
        },
        {
            "name": "Zachary Ball",
            "country": ""
        },
        {
            "name": "Souma Chowdhury",
            "country": ""
        }
    ],
    "keywords": []
}