{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000422",
    "title": "Dynamic quadratic decomposition-based evolutionary algorithm for multi-objective fuzzy flexible jobshop scheduling",
    "abstract": "Multi-objective Fuzzy Flexible Jobshop Scheduling Problems (MFFJSPs) have garnered widespread attention since they are able to handle the uncertainty of processing time in actual production. Nevertheless, making a good balance between the diversity and convergence of non-dominated solutions is a challenging issue that cannot be overlooked when MFFJSP is solved. To deal with these issues, this work proposes a Dynamic Quadratic Decomposition-based Multi-objective Evolutionary Algorithm (DQD-MOEA) to solve MFFJSP by minimizing makespan and total machine workload. To solve a problem that the distribution and diversity of searched non-dominant solutions are poor due to the discrete decision space and objective space of MFFJSP, it proposes a dynamic quadratic decomposition method. Its core idea is to eliminate all the failed reference vectors because they have no intersection with a real Pareto front, and ensure that solutions evolve along effective reference vectors. This work also introduces a problem-specific local search method to accelerate the solution convergence for MFFJSP. It proposes a hybrid initialization method to improve the quality of initial solutions. Finally, a series of experiments are performed and the results demonstrate that DQD-MOEA is significantly better than state-of-the-art algorithms in terms of convergence and solution diversity when solving widely-tested benchmark cases.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "XuWei Zhang",
            "country": ""
        },
        {
            "name": "ZiYan Zhao",
            "country": ""
        },
        {
            "name": "ShuJin Qin",
            "country": ""
        },
        {
            "name": "ShiXin Liu",
            "country": ""
        },
        {
            "name": "MengChu Zhou",
            "country": ""
        }
    ],
    "keywords": []
}