{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001943",
    "title": "Energy-efficient flexible job shop scheduling problem considering discrete operation sequence flexibility",
    "abstract": "The classical flexible job shop scheduling problem (FJSP) normally assumes that operations of each job have strict sequence constraints, i.e., each operation can be processed only after its previous operation is completed. However, in the actual production, the phenomenon that some operations of a job don't have any sequence constraints is very common. With regard to this, we firstly propose a FJSP with discrete operation sequence flexibility (FJSPDS) aiming at minimizing the makespan and total energy consumption, simultaneously. An effective mathematical model is established for the FJSPDS and its validity is proved by the CPLEX; and then an improved memetic algorithm (IMA) is designed to solve the FJSPDS. In the IMA, a new flexible sequencing method for determining process plan of each job and a right-leaning decoding method are proposed. And some effective crossover and  mutation operators  and an effective local search operator are designed to accelerate the convergence speed and expand the solution space of the algorithm. A total of 110 FJSPDS benchmark instances are constructed to conduct numerical simulation experiments. Experimental results show that our proposed IMA has superior performance in almost all of the instances compared with three well-known evolutionary algorithms. Our proposed model and algorithm can help the production managers who work with  flexible manufacturing systems  to obtain optimal scheduling schemes considering operations which have or don't have sequence constraints.",
    "citation_count": "14",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Guiliang Gong",
            "country": ""
        },
        {
            "name": "Jiuqiang Tang",
            "country": ""
        },
        {
            "name": "Dan Huang",
            "country": ""
        },
        {
            "name": "Qiang Luo",
            "country": ""
        },
        {
            "name": "Kaikai Zhu",
            "country": ""
        },
        {
            "name": "Ningtao Peng",
            "country": ""
        }
    ],
    "keywords": []
}