{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217300445",
    "title": "Ensemble strategies for population-based optimization algorithms – A survey",
    "abstract": "In population-based  optimization algorithms  (POAs), given an  optimization problem , the quality of the solutions depends heavily on the selection of algorithms, strategies and associated parameter combinations, constraint handling method,  local search  method, surrogate model, niching method, etc. In the literature, there exist several alternatives corresponding to each aspect of configuring a population-based algorithm such as one-point/two-points/uniform  crossover operators , tournament/ranking/stochastic uniform sampling selection methods, Gaussian/Levy/Cauchy  mutation operators , clearing/crowding/sharing based niching algorithms, adaptive penalty/epsilon/superiority of feasible constraint handling approaches, associated parameter values and so on. In POA literature,  No Free Lunch  (NFL) theorem has been well-documented and therefore, to effectively solve a given optimization problem, an appropriate configuration is necessary. But, the  trial and error  approach for the appropriate configuration may be impractical because at different stages of evolution, the most appropriate configurations could be different depending on the characteristics of the current search region for a given problem. Recently, the concept of incorporating ensemble strategies into POAs has become popular so that the process of configuring an optimization algorithm can benefit from both the availability of diverse approaches at different stages and alleviate the computationally intensive offline tuning. In addition,  algorithmic components  of different advantages could support one another during the optimization process, such that the ensemble of them could potentially result in a versatile POA. This paper provides a survey on the use of ensemble strategies in POAs. In addition, we also provide an overview of similar methods in the literature such as hyper-heuristics, island models, adaptive operator selection, etc. and compare them with the ensemble strategies in the context of POAs.",
    "citation_count": "234",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Guohua Wu",
            "country": ""
        },
        {
            "name": "Rammohan Mallipeddi",
            "country": ""
        },
        {
            "name": "Ponnuthurai Nagaratnam Suganthan",
            "country": ""
        }
    ],
    "keywords": []
}