{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216303455",
    "title": "Estimation of transformer parameters from nameplate data by imperialist competitive and gravitational search algorithms",
    "abstract": "Accurate determination of parameters in  power transformer  equivalent circuit is important because it can influence the simulation results of condition monitoring on power transformers, such as analysis of frequency-response. This is due to inaccurate simulation results will yield incorrect interpretation of the power transformer condition through its equivalent circuit. Works on development of transformer models have been widely developed since the past for transient and steady-state analyses. Estimating parameters of a transformer using nameplate data without performing a single experiment has been developed in the past. However, the average error between the actual and estimated parameter values in the past work using  Particle Swarm Optimisation  (PSO) and  Genetic Algorithm  (GA) is considerably large. This signifies that there is a room for improvement by using other optimisation techniques, such as  state of the art methods  which include Heterogeneous Comprehensive Learning PSO (HCLPSO), LSHADE-EpSin, Imperialist Competitive Algorithm (ICA), Gravitational Search Algorithm (GSA) and others. Since ICA and GSA have advantages over GA and PSO, in this work, estimation of transformer parameters from its nameplate data was proposed using ICA and GSA. The results obtained using ICA and GSA was compared to those using GA and PSO to determine the parameters of transformer equivalent circuit. The results show that GSA performs the best as it gives the lowest average error compared to PSO, GA and ICA. Therefore, the proposed technique using GSA and ICA can give a better accuracy than PSO and GA in estimating the parameters of power transformers. The proposed method can also be applied to estimate parameters of three-phase transformers from their nameplate data without disconnecting them from the grid for testing.",
    "citation_count": "32",
    "year": "2017/10/01",
    "authors": [
        {
            "name": "H.A. Illias",
            "country": ""
        },
        {
            "name": "K.J. Mou",
            "country": ""
        },
        {
            "name": "A.H.A. Bakar",
            "country": ""
        }
    ],
    "keywords": []
}