{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216301444",
    "title": "Experimentation investigation of abrasive water jet machining parameters using Taguchi and Evolutionary optimization techniques",
    "abstract": "In the last decade, numerous new materials are rapidly emerging and developed; it creates considerable interest in the researcher to search out the optimum combination of machining parameters during machining of these materials using advanced machining processes (AMP). In this work, an experimental investigation is carried out on  abrasive water jet machining  (AWJM) process for the machining of material AA631-T6 using the Taguchi methodology. Parameters such as transverse speed, standoff distance and  mass flow rate  are considered to obtain the influence of these parameters on  kerf top width  and  taper angle . Regression models have been developed to correlate the data generated using experimental results. Seven advanced optimization techniques, i.e.,  particle swarm optimization ,  firefly algorithm , artificial bee colony, simulated annealing, black hole, biogeography based and non-dominated sorting  genetic algorithm  are attempted for the considered AWJM process. The effectiveness of these algorithms is compared and found that bio-geography algorithm is performing better compared to other algorithms. Furthermore, a non-dominated set of solution is obtained to have diversity in the solutions for the AWJM process. The result obtained using the  Taguchi method  and optimization techniques are confirmed using confirmation experiments. Confirmatory experiments show that both the optimization techniques and  Taguchi method  are the effective tools in optimizing the process parameters of the AWJM process.",
    "citation_count": "86",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Rajkamal Shukla",
            "country": ""
        },
        {
            "name": "Dinesh Singh",
            "country": ""
        }
    ],
    "keywords": []
}