{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000924",
    "title": "Exponential evolution mechanism for in vivo computation",
    "abstract": "We have proposed a novel framework of in vivo computation, which is used for tumor sensitization and targeting (TST) in our previous investigations. In the framework, the process of nanorobots-assisted TST is rendered into an in vivo optimization problem, where nanorobots are utilized as computing agents; the tumor targeted can be seen as the global optimal solution; the high-risk tissue plays the role of the  search space ; and the tumor-triggered biological  gradient field  (BGF) provides the aided knowledge for fitness evaluation. Our previous works have proposed the weak priority evolution strategy (WP-ES) to adapt to the actuating mode of the homogeneous  magnetic field  used in the state-of-the-art nanorobot control platforms. Though the previous works provide an optimal movement direction for the nanorobots at each update, the step size for each iteration, which is called the evolution mechanism in this paper, has not been studied. It is an important issue as the evolution mechanism of computing agents is a fundamental problem for both in vivo computation and mathematical optimization. To account for this issue, we propose an exponential evolution mechanism, which is used to adjust the step size of the nanorobots during each  actuation  period. To demonstrate the effectiveness of the evolution mechanism and choose the optimal parameter setting, we perform comprehensive simulation examples by introducing the mechanism into the WP-ES based  swarm intelligence  algorithms considering the realistic internal constraints. The performance is compared against that of the brute-force search, which represents the traditional systemic targeting method in terms of tumor targeting, and it is also compared against that of the WP-ES based swarm intelligence algorithms without the evolution mechanism. Results from the computational experiments verify the effectiveness of the exponential evolution mechanism for most of the representative BGF landscapes.",
    "citation_count": "9",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Shaolong Shi",
            "country": ""
        },
        {
            "name": "Yifan Chen",
            "country": ""
        },
        {
            "name": "Xin Yao",
            "country": ""
        },
        {
            "name": "Qiang Liu",
            "country": ""
        }
    ],
    "keywords": []
}