{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001433",
    "title": "Fast Pareto set approximation for multi-objective flexible job shop scheduling via parallel preference-conditioned graph reinforcement learning",
    "abstract": "The Multi-Objective Flexible  Job Shop Scheduling  Problem (MOFJSP) is a complex challenge in manufacturing, requiring balancing multiple, often conflicting objectives. Traditional methods, such as Multi-Objective Evolutionary Algorithms (MOEA), can be time-consuming and unsuitable for real-time applications. This paper introduces a novel Graph  Reinforcement Learning  (GRL) approach, named Preference-Conditioned GRL, which efficiently approximates the  Pareto set  for MOFJSP in a parallelized manner. By decomposing the MOFJSP into distinct sub-problems based on preferences and leveraging a parallel multi-objective  training algorithm , our method efficiently produces high-quality Pareto sets, significantly outperforming MOEA methods in both solution quality and speed, especially for large-scale problems. Extensive experiments demonstrate the superiority of our approach, with remarkable results on large instances, showcasing its potential for real-time scheduling in dynamic  manufacturing environments . Notably, for large instances (50 × 20), our approach outperforms MOEA baselines with remarkably shorter  computation time  (less than 1% of that of MOEA baselines). The robust  generalization performance  across various instances also highlights the practical value of our method for decision-makers seeking optimized production  resource utilization .",
    "citation_count": "7",
    "year": "2024/07/01",
    "authors": [
        {
            "name": "Chupeng Su",
            "country": ""
        },
        {
            "name": "Cong Zhang",
            "country": ""
        },
        {
            "name": "Chuang Wang",
            "country": ""
        },
        {
            "name": "Weihong Cen",
            "country": ""
        },
        {
            "name": "Gang Chen",
            "country": ""
        },
        {
            "name": "Longhan Xie",
            "country": ""
        }
    ],
    "keywords": []
}