{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022300202X",
    "title": "Fractional-order modified heterogeneous comprehensive learning particle swarm optimizer for intelligent disease detection in IoMT environment",
    "abstract": "This paper presents an alternative early disease detection technique based on the Internet of Medical Things (IoMT) to improve the healthcare system. Since it is necessary to address different aspects to help healthcare organizations to improve their efficiency. Early disease detection using a fast and efficient test, such as chest X-ray images, is one of the most important issues. In this paper, we develop an efficient model to allocate abnormalities in medical chest X-ray images. The developed model consists of a set of stages; the first stage is to segment the images using a multilevel thresholding technique to determine the lung inside the image, then extracting the features from the segmented objects using different extractor methods. Then, we proposed a Fractional-order modified Heterogeneous comprehensive learning  particle swarm  optimizer (FMHCLPSO) as a feature selection method to determine the relevant features used to improve the detection process. To evaluate the performance of the developed IoMT model, a set of three medical datasets is used, called Covid-19 & Pneumonia, X-raycovid, and  Radiography . The results illustrate the high efficiency of the developed model to detect diseases based on  performance measures . Furthermore, We compared the proposed method to several existing methods, and it showed significant performance.",
    "citation_count": "7",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Mohamed Abd Elaziz",
            "country": ""
        },
        {
            "name": "Dalia Yousri",
            "country": ""
        },
        {
            "name": "Ahmad O. Aseeri",
            "country": ""
        },
        {
            "name": "Laith Abualigah",
            "country": ""
        },
        {
            "name": "Mohammed A.A. Al-qaness",
            "country": ""
        },
        {
            "name": "Ahmed A. Ewees",
            "country": ""
        }
    ],
    "keywords": []
}