{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000410",
    "title": "Gaussian process regression for evolutionary dynamic multiobjective optimization in complex environments",
    "abstract": "Multiobjective Evolutionary Algorithms (MOEAs) face significant challenges when addressing dynamic multiobjective optimization problems, particularly those with frequent changes. The complexity of dynamic environments makes it difficult for MOEAs to accurately approximate the true Pareto-optimal solutions before subsequent changes occur. Typically, historical approximations of Pareto-optimal solutions are utilized to predict solutions in future environments. However, existing predictors often overlook the nondeterministic nature of historical solutions, potentially compromising prediction accuracy. In this paper, we propose a novel predictor based on Gaussian Process Regression (GPR) for evolutionary dynamic multiobjective optimization. Unlike traditional deterministic predictors, our approach aims to provide a probability distribution of predicted results, thereby addressing the inherent nondeterminism of historical solutions. We employ GPR to model relationships among historical solutions across different time steps. Within the framework of the classical MOEA, MOEA/D, we introduce a new method MOEA/D-GPR for Evolutionary Dynamic Multiobjective Optimization (EDMO). Experimental results demonstrate that our method achieves state-of-the-art performance.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Youpeng Deng",
            "country": ""
        },
        {
            "name": "Yan Zheng",
            "country": ""
        },
        {
            "name": "Zhaopeng Meng",
            "country": ""
        },
        {
            "name": "Haobo Gao",
            "country": ""
        },
        {
            "name": "Yueyang Hua",
            "country": ""
        },
        {
            "name": "Qiangguo Jin",
            "country": ""
        },
        {
            "name": "Leilei Cao",
            "country": ""
        }
    ],
    "keywords": []
}