{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218302918",
    "title": "Global genetic learning particle swarm optimization with diversity enhancement by ring topology",
    "abstract": "Genetic  learning  particle swarm optimization  (GL-PSO) improves the performance of  particle swarm optimization  (PSO) by breeding superior exemplars to guide the motion of particles. However, GL-PSO adopts a global topology for exemplar generation and cannot preserve sufficient diversity to enhance exploration, and therefore, its performance on complex  optimization problems  is unsatisfactory. To further improve GL-PSO's performance and  adaptability , two modifications are incorporated into the original GL-PSO. A ring topology is adopted in exemplar generation to enhance diversity and exploration, while a global learning component (GLC) with linearly adjusted  control parameters  is employed to improve the algorithm's adaptability. The resultant algorithm is referred to as global genetic learning  particle swarm optimization  with diversity enhancement by ring topology (GGL-PSOD). To validate the effectiveness of these two modifications, they are combined with GL-PSO separately and together and further tested experimentally. The comparison results on the CEC2017 test suite show that the adoption of the ring topology in exemplar generation can enhance the diversity and exploration capability of GL-PSO, while combining GLC alone with GL-PSO cannot achieve significant improvement. Incorporating both modifications into GL-PSO, the resultant GGL-PSOD exhibits high performance and strong adaptability on different types of CEC2017 functions. It outperforms seven representative  PSO variants  and five non-PSO meta-heuristics, including GL-PSO, SL-PSO, HCLPSO,  EPSO ,  ABC , CMA-ES and  CS .",
    "citation_count": "109",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Anping Lin",
            "country": ""
        },
        {
            "name": "Wei Sun",
            "country": ""
        },
        {
            "name": "Hongshan Yu",
            "country": ""
        },
        {
            "name": "Guohua Wu",
            "country": ""
        },
        {
            "name": "Hongwei Tang",
            "country": ""
        }
    ],
    "keywords": []
}