{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218300488",
    "title": "Handling uncertainty through confidence intervals in portfolio optimization",
    "abstract": "The approach proposed here uses  evolutionary algorithms  combined with interval analysis to optimize the allocation of resources in portfolio optimization. The proposal uses probabilistic confidence intervals to characterize the solutions. Such characterization allows the investor to consider not only the expected impact of the portfolios but also the risk of not obtaining that expected impact. This approach identifies the behavior of the investor in the face of risk and gives her/him support depending on her/his own preferences. Portfolio optimization is performed through one of the most outstanding evolutionary multi-objective approaches, the so-called  Multiobjective Evolutionary Algorithm  Based on Decomposition (MOEA/D). To the best of our knowledge, this algorithm has not been used in the context of interval analysis. In this work, MOEA/D has been enhanced so that it can deal with chromosomes and fitness values described as interval numbers. In order to evaluate the proposed approach, an illustrative application in stock portfolio selection is included. We use as our dataset 13 years of historical monthly prices of stocks in the Dow Jones Industrial Average index (DJIA), including those of the 2008 crisis. Besides, we have carried out an extensive evaluation comparing the performance of the proposed approach with respect to the DJIA index, the Markowitz's mean-variance approach, and other more recent approaches. The results show that the proposed approach outperforms the other ones and allow us to conclude that, within the context of our experiments, i) the proposal was effective in the allocation of resources in most of the periods considered (156 scenarios), ii) the approach is appropriate to find portfolios by explicitly considering the DM's attitude facing risk, and iii) interval analysis was a robust measure of risk even for the 2008 crisis.",
    "citation_count": "23",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Efrain Solares",
            "country": ""
        },
        {
            "name": "Carlos A. Coello Coello",
            "country": ""
        },
        {
            "name": "Eduardo Fernandez",
            "country": ""
        },
        {
            "name": "Jorge Navarro",
            "country": ""
        }
    ],
    "keywords": []
}