{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002365",
    "title": "Hierarchical multi-objective optimization of proton exchange membrane fuel cell with parameter uncertainty",
    "abstract": "It is important to improve the performance indexes including the net power and system efficiency for polymer electrolyte membrane fuel cell (PEMFC), especially considering the parameter uncertainty. To this end, this paper proposes a hierarchical multi-objective optimization framework including the off-line and on-line optimization. Firstly, a steadystate non-linear  PEMFC system  model is established as the base model. Secondly, an adaptive multi-objective  particle swarm optimization  (AMPSO) algorithm scheme is proposed in the off-line  optimization procedure  for the exact optimization of operation parameters. Meanwhile, an adaptive flight parameter strategy based on the particle dispersity (PD) information is proposed to balance the convergence and diversity of  Pareto solutions . Finally, to decrease the influence caused by parameter uncertainty, the interval optimization method is proposed in the on-line optimization layer based on the results of AMPSO. The convergence condition of the proposed optimization scheme is verified by theory analysis. The proposed AMPSO is compared with different algorithms in the numerical simulation and hardware-in-loop (HIL) experiments. Meanwhile, the performance of the proposed method is tested on four representative benchmark problems. These results demonstrate that the PEMFC system with the proposed optimization scheme performs better than the base model and classical optimization algorithms in terms of the net power and system efficiency indexes, revealing the success of this hierarchical optimization approach in solving the accurate optimization and parameter uncertainty problems. By using statistical test methods, the proposed algorithm performs better hypervolume (HV) metric from the Pareto solution distribution.",
    "citation_count": "9",
    "year": "2024/04/01",
    "authors": [
        {
            "name": "Yunlong Wang",
            "country": ""
        },
        {
            "name": "Cunliang Ye",
            "country": ""
        },
        {
            "name": "Yongfu Wang",
            "country": ""
        }
    ],
    "keywords": []
}