{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400292X",
    "title": "Historical knowledge transfer driven self-adaptive evolutionary multitasking algorithm with hybrid resource release for solving nonlinear equation systems",
    "abstract": "In reality, there are many extremely complex nonlinear optimization problems. How to locate the roots of nonlinear equation systems (NESs) more accurately and efficiently has always been a major numerical challenge. Although there are many excellent algorithms to solve NESs, which are all limited by the fact that the algorithm can solve at most one NES in a single run. Therefore, this paper proposes a historical knowledge transfer driven self-adaptive evolutionary multitasking algorithm framework (EMSaRNES) with hybrid resource release to solve NESs. Its core is that in one run, EMSaRNES can efficiently and accurately locate the roots of multiple NESs. In EMSaRNES, self-adaptive parameter method is proposed to dynamically adjust parameters of the algorithm. Secondly, adaptive selection mutation mechanism with historical knowledge transfer is designed, which dynamically adjusts the evolution of populations with or without knowledge sharing according to changes in the current population diversity, thereby balancing population diversity and convergence. Finally, hybrid resource release strategy is developed, which archives the roots that meet the accuracy requirements, and then three distributions are selected to generate new populations, thus ensuring that the population diversity is maintained at high level. After a variety of experiments, it has been proven that compared to comparative algorithms EMSaRNES has superior performance on 30 general NESs test sets. In addition, the results on 18 extremely complex NESs test sets and two real-life application problems further prove that EMSaRNES finds more roots in the face of complex problems and real-life problems.",
    "citation_count": "1",
    "year": "2024/12/01",
    "authors": [
        {
            "name": "Yujun Zhang",
            "country": ""
        },
        {
            "name": "Yufei Wang",
            "country": ""
        },
        {
            "name": "Yuxin Yan",
            "country": ""
        },
        {
            "name": "Juan Zhao",
            "country": ""
        },
        {
            "name": "Zhengming Gao",
            "country": ""
        }
    ],
    "keywords": []
}