{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001420",
    "title": "Integration routing and scheduling for multiple home health care centers using a multi-objective cooperation evolutionary algorithm with stochastic simulation",
    "abstract": "Currently, population aging has aroused much concern in many countries since the elderly occupy a lot of social public resources in hospitals and nursing homes.  Home health care  (HHC) is treated as an alternative solution to serve the elderly community. In recent years, managing and organizing the operation of HHCs receive a  great deal  of attention. The HHC routing and scheduling problems attract huge amounts of interest from modeling and optimization areas. Nevertheless, there are rarely studies focusing on the cooperation of multiple HHC centers in such problems. This work addresses a multi-center, multi-objective and stochastic HHC routing and scheduling problem for minimizing the total operation cost and penalty cost incurred by earliness and delay service, where the caregivers’ working time, customers’ requirements and  resource constraints  are considered. Firstly, a multi-objective chance-constrained programming model is developed to formulate the studied problem. Secondly, a multi-objective cooperation  evolutionary algorithm  by using  stochastic simulation  is specially developed, in which two populations respectively perform global and  local searches , and the cooperation of two populations is designed. The  stochastic simulation  approach is employed to evaluate the quality and feasibility of the obtained solutions. Finally, extensive experiments are performed on a set of test instances and three multi-objective  optimization algorithms  are compared to verify the performance of the proposed algorithm. The comparisons and discussions validate the competitiveness of the designed approach.",
    "citation_count": "34",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "Xiaomeng Ma",
            "country": ""
        },
        {
            "name": "Yaping Fu",
            "country": ""
        },
        {
            "name": "Kaizhou Gao",
            "country": ""
        },
        {
            "name": "Ali Sadollah",
            "country": ""
        },
        {
            "name": "Kai Wang",
            "country": ""
        }
    ],
    "keywords": []
}