{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218308071",
    "title": "Investigation of incremental hybrid genetic algorithm with subgraph isomorphism problem",
    "abstract": "Graph  pattern matching  is a key problem in many applications which data is represented in the form of a graph, and this problem is generally defined as a  subgraph isomorphism . In this paper, we analyze an incremental hybrid  genetic algorithm  for the subgraph isomorphism problem considering various design issues to improve the performance of the algorithm. An incremental  hybrid genetic algorithm  was previously suggested to solve the subgraph isomorphism problem and have shown  good performance . It decomposes the problem into a sequence of consecutive  subproblems  which has an optimal substructure. Each subproblem is solved by the hybrid genetic algorithm and the solutions obtained are extended to be applied to the next subproblem as initial solutions. We examine a wide range of schemes that determine the overall performance of the incremental process and make a number of experiments to verify the effectiveness of each scheme with the  synthetic dataset  of random graphs. We show that the performance of  incremental approach  can be significantly improved compared to the previous representative studies by applying appropriate schemes found by the experiments. In addition, we also investigate the effect of different genetic parameters and identify the scalability of our method by conducting experiments using real world dataset with large-sized graphs.",
    "citation_count": "11",
    "year": "2019/09/01",
    "authors": [
        {
            "name": "HyukGeun Choi",
            "country": ""
        },
        {
            "name": "Jinhyun Kim",
            "country": ""
        },
        {
            "name": "Yourim Yoon",
            "country": ""
        },
        {
            "name": "Byung-Ro Moon",
            "country": ""
        }
    ],
    "keywords": []
}