{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216302188",
    "title": "Jaya, harmony search and water cycle algorithms for solving large-scale real-life urban traffic light scheduling problem",
    "abstract": "This paper studies a large-scale urban traffic light scheduling problem (LUTLSP). A centralized model is developed to describe the LUTLSP, where each outgoing flow rate is described as a nonlinear mixed logical switching function over the source link’s density, the destination link’s density and capacity, and the driver’s potential psychological response to the past traffic light signals. The objective is to minimize the total network-wise delay time of all vehicles in a time window. Three  metaheuristic optimization  algorithms, named as Jaya algorithm, harmony search (HS) and  water cycle  algorithm (WCA) are implemented to solve the LUTLSP. Since we adopt a discrete-time formulation of LUTLSP, we firstly develop a discrete version of Jaya and WCA. Secondly, some  improvement strategies  are proposed to speed up the convergence of applied optimizers. Thirdly, a feature based search operator is utilized to improve the search performance of reported optimization methods. Finally, experiments are carried out based on the real traffic data in Singapore. The HS, WCA, Jaya, and their variants are evaluated by solving 11 cases of traffic networks. The comparisons and discussions verify that the considered metaheuristic optimization methods can effectively solve the LUTLSP considerably surpassing the existing traffic light control strategy.",
    "citation_count": "71",
    "year": "2017/12/01",
    "authors": [
        {
            "name": "Kaizhou Gao",
            "country": ""
        },
        {
            "name": "Yicheng Zhang",
            "country": ""
        },
        {
            "name": "Ali Sadollah",
            "country": ""
        },
        {
            "name": "Antonios Lentzakis",
            "country": ""
        },
        {
            "name": "Rong Su",
            "country": ""
        }
    ],
    "keywords": []
}