{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221001887",
    "title": "Many‐objective optimization by using an immune algorithm",
    "abstract": "Multiobjective optimization is important in practical engineering applications. With the increased number of objectives, multiobjective optimization becomes more challenging due to the difficulty of convergence in population selection. A number of many-objective evolutionary algorithms (MaOEAs) have been designed to enhance population selection, but studies selecting parents for evolution are still rare. Fortunately, multiobjective immune algorithms (MOIAs) provide a promising approach to select high-quality parents for evolution. However, the existing MOIAs are not effective for solving many-objective optimization problems (MaOPs), as these algorithms consider only the local information of solutions for cloning but ignore the global information of populations; consequently, the populations of these algorithms may easily be trapped in local optima. To solve this problem, this paper proposes a many-objective immune algorithm with a novel immune cloning operator. In this approach, the global information in the population is used to estimate the quality of each solution, and only a few offspring from high-quality parents are generated in each generation to improve the convergence and diversity of the population. When the proposed algorithm is compared with nine MaOEAs and six MOIAs on three MaOP benchmarks with 5, 10, and 15 objectives, the experimental results validate that the proposed algorithm obtains the best performance in most cases. Moreover, the effectiveness of the proposed algorithm is also validated on one real-world optimization problem.",
    "citation_count": "18",
    "year": "2022/03/01",
    "authors": [
        {
            "name": "Yuchao Su",
            "country": ""
        },
        {
            "name": "Naili Luo",
            "country": ""
        },
        {
            "name": "Qiuzhen Lin",
            "country": ""
        },
        {
            "name": "Xia Li",
            "country": ""
        }
    ],
    "keywords": []
}