{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216000195",
    "title": "Microarray medical data classification using kernel ridge regression and modified cat swarm optimization based gene selection system",
    "abstract": "Microarray gene expression  based medical data classification has remained as one of the most challenging research areas in the field of bioinformatics, machine learning and pattern classification. This paper proposes two variations of kernel ridge regression (KRR), namely wavelet kernel ridge regression (WKRR) and radial basis kernel ridge regression (RKRR) for classification of  microarray  medical datasets.  Microarray  medical datasets contain irrelevant and redundant genes which cause high number of gene expression i.e. dimensionality and small  sample sizes . To overcome the curse of dimensionality of the microarray datasets, modified cat swarm optimization (MCSO), a naturally inspired  evolutionary algorithm , is used to select the most relevant features from the datasets. The adequacies of the classifiers are demonstrated by employing four from each binary and multi-class microarray medical datasets. Breast cancer, prostate cancer, colon tumor, leukemia datasets belong to the former and leukemia1, leukemia2, SRBCT, brain tumor1 to the latter. A number of useful performance evaluation measures including  accuracy ,  sensitivity ,  specificity ,  confusion matrix ,  Gmean ,  F-score  and the area under the receiver operating characteristic (ROC) curve are considered to examine the efficacy of the model. Other models like simple ridge regression (RR), online sequential ridge regression (OSRR),  support vector machine   radial basis function  (SVMRBF),  support vector machine  polynomial (SVMPoly) and random forest are studied and analyzed for comparison. The experimental results demonstrate that KRR outperforms other models irrespective of the datasets and WKRR produces better results as compared to RKRR. Finally, when the results are compared on the basis of binary and multi-class datasets, it is found that binary class yields a little bit better result as compared to the multiclass irrespective of models.",
    "citation_count": "126",
    "year": "2016/06/01",
    "authors": [
        {
            "name": "P. Mohapatra",
            "country": ""
        },
        {
            "name": "S. Chakravarty",
            "country": ""
        },
        {
            "name": "P.K. Dash",
            "country": ""
        }
    ],
    "keywords": []
}