{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218303353",
    "title": "Multilevel thresholding by fuzzy type II sets using evolutionary algorithms",
    "abstract": "The image segmentation based on Multilevel thresholding has attracted more attention in recent years, they have been used in different applications. Therefore, several evolutionary computation methods have been proposed to determine the optimal threshold values. However, these approaches suffer from some limitations such as the  stagnation point  which leads to degradation the quality of the segmented image. In addition, most of them used either Otsu or Kapur as a fitness function, and the complexity of these methods is increased with increasing the threshold levels. Moreover, they don’t provide accurate results in all the cases. To overcome such situations, in this paper is proposed the use of evolutionary computation algorithms combined with the Type II Fuzzy Entropy as the objective function. Such methods are the Backtracking Search Optimization Algorithm (BSA) and the Salp  Swarm  Algorithm (SSA). The BSA and SSA are able to avoid the limitation of similar techniques for image threshold because the objective function removes the ambiguities helping to find more accurate results. The BSA and SSA are used to find the best parameters of the Type II Fuzzy Entropy that extracts the optimal thresholds that properly segment the histogram of a digital image. To evaluate the performance of the proposed two methods, a set of experiments are performed using a set of benchmark images which have different characteristics. Moreover, the experiments are also performed over medical images from blood cells. The experimental results indicate that the proposed two methods have a good performance. However, they provide better performance than other algorithms in terms of quality and accuracy.",
    "citation_count": "27",
    "year": "2019/12/01",
    "authors": [
        {
            "name": "Diego Oliva",
            "country": ""
        },
        {
            "name": "Sayan Nag",
            "country": ""
        },
        {
            "name": "Mohamed Abd Elaziz",
            "country": ""
        },
        {
            "name": "Uddalok Sarkar",
            "country": ""
        },
        {
            "name": "Salvador Hinojosa",
            "country": ""
        }
    ],
    "keywords": []
}