{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217308362",
    "title": "Multimodal multiobjective optimization with differential evolution",
    "abstract": "This paper proposes a multimodal multiobjective Differential Evolution  optimization algorithm  (MMODE). The technique is conceived for deployment on problems with a Pareto multimodality, where the  Pareto set  comprises multiple  disjoint subsets , all of which map to the same  Pareto front . A new contribution is the formulation of a decision-variable preselection scheme that promotes diversity of solutions in both the decision and  objective space . A new mutation-bound process is also introduced as a supplement to a classical mutation scheme in Differential Evolution methods, where  offspring  that lie outside the search bounds are given a second opportunity to mutate, hence reducing the density of individuals on the boundaries of the  search space . New multimodal multiobjective test functions are designed, along with analytical expressions for their Pareto sets and fronts. Some test functions introduce more complicated Pareto-front shapes and allow for decision-space dimensions greater than two. The performance of the MMODE algorithm is compared with five other state-of-the-art methods. The results show that MMODE realizes superior performance by finding more and better distributed  Pareto solutions .",
    "citation_count": "157",
    "year": "2019/02/01",
    "authors": [
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Weiwei Xu",
            "country": ""
        },
        {
            "name": "Caitong Yue",
            "country": ""
        },
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Hui Song",
            "country": ""
        },
        {
            "name": "Oscar D. Crisalle",
            "country": ""
        },
        {
            "name": "Boyang Qu",
            "country": ""
        }
    ],
    "keywords": []
}