{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022500015X",
    "title": "Multi-objective neural policy approach for agile earth satellite scheduling problem considering image quality",
    "abstract": "The agile earth satellite scheduling problem (AEOSSP) aims to output reasonable execution plans to manage observation requests and satisfy different user requirements. By analyzing the factors which impact the quality of satellite observation, a specific multi-objective AEOSSP (MO-AEOSSP) is studied, integrating observation profit and average image quality as optimization objectives. To overcome the limitations of traditional iterative methods, we introduce a multi-objective neural policy approach (MONP) which consists of problem decomposition, parameter initialization and subproblem modeling. Through problem decomposition a given MO-AEOSSP can be partitioned into several subproblems, subsequently modeled and trained as encoder–decoder structure neural networks. Various features including the most typical satellite attitude angle are characterized to support the MONP, while parameter transfer initialization is employed to accelerate the overall deep reinforcement learning procedure by leveraging params acquired from optimized subproblem. An end-to-end manner is implemented after all subproblems are trained to output the final non-dominated solutions. Experimental results on various scenarios demonstrate that MONP outperforms four representative multi-objective evolutionary algorithms in terms of metrics including Pareto Front, hypervolume and computational overhead, appearing remarkable ability of convergence, distribution, efficiency and scalability. Experiments further verify the effectiveness of the adopted parameter initialization strategy. To the best of our understanding, this study is an innovative attempt to combine the neural policy approach with MO-AEOSSP considering time-dependent satellite transition.",
    "citation_count": "2",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Luona Wei",
            "country": ""
        },
        {
            "name": "Yongqiang Cui",
            "country": ""
        },
        {
            "name": "Ming Chen",
            "country": ""
        },
        {
            "name": "Qian Wan",
            "country": ""
        },
        {
            "name": "Lining Xing",
            "country": ""
        }
    ],
    "keywords": []
}