{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000069",
    "title": "New heterogeneous comprehensive learning particle swarm optimizer enhanced with low-discrepancy sequences and conjugate gradient method",
    "abstract": "The low-discrepancy sequence (LDS) has a superior capability to cover the space compared to the random sequence, and the conjugate gradient method exhibits exceptional local search capabilities due to its ability to search the optimal solution along the conjugate direction. Combining the benefits of these two approaches, two variants of the heterogeneous comprehensive learning particle swarm optimizer (HCLPSO) are developed, named HCLPSO-DC and HCLPSO-OC, respectively. Each variant implements two novel velocity updating strategies (VUS): the low-discrepancy sequence-based VUS (LDS-VUS) and the composite conjugate gradient-based VUS (CCG-VUS), coupled with an adaptive switching strategy to determine which VUS is specifically employed for the search of population. The difference between HCLPSO-DC and HCLPSO-OC is they generate the LDSs through the dynamical evolutionary sequence and the optimized Halton sequence, respectively. The proposed LDS-VUS introduces the strong capability of covering the search space in the velocity updating to improve the overall search capability, and the proposed CCG-VUS guides the particle to search along the conjugate direction to enhance the exploitation capability. The proposed adaptive switching strategy helps to combine the benefits of two VUSs to enhance the exploration and exploitation of HCLPSO. The proposed HCLPSO-DC and HCLPSO-OC are tested on CEC 2017 test functions and eight real-world engineering optimization problems, and compared numerically with fifty-four excellent optimizers. The numerical results demonstrate the superior performance of the proposed HCLPSO-DC and HCLPSO-OC over comparison methods in terms of computational accuracy and efficiency.",
    "citation_count": "0",
    "year": "2025/03/01",
    "authors": [
        {
            "name": "Yuelin Zhao",
            "country": ""
        },
        {
            "name": "Feng Wu",
            "country": ""
        },
        {
            "name": "Jianhua Pang",
            "country": ""
        },
        {
            "name": "Wanxie Zhong",
            "country": ""
        }
    ],
    "keywords": []
}