{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022200030X",
    "title": "Novel MILP and CP models for distributed hybrid flowshop scheduling problem with sequence-dependent setup times",
    "abstract": "As regards distributed hybrid  flow shop scheduling  with sequence-dependent setup times (DHFSP-SDST), three novel mixed-integer linear programming (MILP) models and a  constraint programming  (CP) model are formulated for the same-factory and different-factory environments. The three novel  MILP  models are based on two different modeling ideas. The existing MILP model and the three proposed MILP models are compared in detail from several aspects, such as binary decision variables, continuous decision variables, constraints, solution performance and solution time. By solving the benchmarks in existing studies, the effectiveness and superiority of the proposed MILP and CP models are proved. Experimental results show that the MILP model of sequence-based modeling idea performs best, the MILP model of adjacent sequence-based modeling idea takes the second place and the existing MILP model of position-based modeling idea performs worst. The CP model is more efficient and effective than MILP models. In addition, compared with the existing meta-heuristic algorithms (e.g.,  DABC  and IABC), the proposed MILP models prove the optimal solutions of 37 instances and improve 17 current best solutions. The CP model solves all the 45 instances to  optimality  and improves 19 current best solutions for benchmarks in the existing studies",
    "citation_count": "97",
    "year": "2022/06/01",
    "authors": [
        {
            "name": "Leilei Meng",
            "country": ""
        },
        {
            "name": "Kaizhou Gao",
            "country": ""
        },
        {
            "name": "Yaping Ren",
            "country": ""
        },
        {
            "name": "Biao Zhang",
            "country": ""
        },
        {
            "name": "Hongyan Sang",
            "country": ""
        },
        {
            "name": "Zhang Chaoyong",
            "country": ""
        }
    ],
    "keywords": []
}