{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000446",
    "title": "Novel MINLP model and Lamarckian learning-enhanced multi-objective optimization algorithm for smart household appliance scheduling",
    "abstract": "With the rapid development of information and communication technology, a home energy management system (HEMS) on the demand side, embedded with advanced scheduling models and optimization algorithms, has the potential to conserve energy, reduce users’ electricity costs and dissatisfaction, while ensuring the stable operation of the power grid. This paper first develops a novel mixed-integer non-linear programming (MINLP) model for the smart household appliance scheduling problem with solar energy and energy storage to minimize the total electricity consumption cost and the user dissatisfaction simultaneously over a day. Next, to the best of our knowledge, this is the first work to propose a novel Lamarckian-learning enhanced multi-objective particle swarm optimization (LLMOPSO) algorithm to solve the studied problem. To validate the effectiveness of the improved model and algorithm, comparative experiments are conducted on four case studies under different scenarios. The experimental results demonstrate that the proposed LLMOPSO outperforms the existing ones in terms of eight commonly used performance metrics, such as the number of non-dominated solutions ( ND ), the ratio of non-dominated solutions ( R nd ), the generational distance ( GD ), and the metric of diversity ( DM ). Compared to four existing optimization algorithms, our novel approach can provide better schedules for users, enabling them to manage smart household appliances in a more flexible, comfortable, and cost-effective way.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Weidong Lei",
            "country": ""
        },
        {
            "name": "Ziheng You",
            "country": ""
        },
        {
            "name": "Jiawei Zhu",
            "country": ""
        },
        {
            "name": "Pengyu Yan",
            "country": ""
        },
        {
            "name": "Zhen Zhou",
            "country": ""
        },
        {
            "name": "Jikun Chen",
            "country": ""
        }
    ],
    "keywords": []
}