{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000665",
    "title": "Parrot optimization algorithm for improved multi-strategy fusion for feature optimization of data in medical and industrial field",
    "abstract": "Feature selection is crucial in machine learning, data mining and pattern recognition, aiming at refining data features and improving model performance. Data features in the medical-industrial field are numerous and often contain redundant and irrelevant information, which affects model efficiency and generalization ability. Given that the superior performance of meta-heuristic algorithms in dealing with complex constrained problems has been demonstrated and many researchers have used them for feature selection to process data with better results than traditional methods, this study innovatively proposes an improved Multi-Strategy Fused Parrot Optimization Algorithm (MIPO) to optimize the feature selection process targeting the medical-industrial data. MIPO incorporates four core mechanisms: first, balanced and optimized foraging behavior to pinpoint key features; second, lens imaging reverse dwell behavior to strengthen local search; third, vertical and horizontal cross-communication behavior to promote population co-evolution; and fourth, memory behavior to intelligently guide the search direction. In addition, the pacifying behavior strategy is introduced to enhance the stability and robustness of the algorithm in complex space. To fully validate MIPO, this paper designs exhaustive experiments, including ablation experiments, experiments comparing with mainstream algorithms and comparisons with other feature selection methods, to demonstrate its superior performance in multiple dimensions. Based on the S/V transfer function, nine binary variants are constructed to cope with the challenge of diverse feature selection. The experimental results show that MIPO and its variants exhibit efficient, general and strong generalization capabilities on 23 medical-industrial datasets. Further, by combining KNN, SVM, and RF classifiers, MIPO significantly improves the model accuracy, with average improvement rates of 55.38%, 35.53%, and 49.59%, respectively, compared with the original parrot algorithm, and the optimal variant also performs well on all types of classifiers, with average improvement rates of 53.91%, 34.38%, and 49.94% for the optimal variant, proving the wide applicability of MIPO. In this study, the adaptability of MIPO and classifiers is deeply explored to provide scientific guidance and practical suggestions for practical applications, which not only promotes the technological progress in the field of feature selection, but also provides a powerful tool for data processing and analysis in the field of medical and industrial.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Gaoxia Huang",
            "country": ""
        },
        {
            "name": "Jianan Wei",
            "country": ""
        },
        {
            "name": "Yage Yuan",
            "country": ""
        },
        {
            "name": "Haisong Huang",
            "country": ""
        },
        {
            "name": "Hualin Chen",
            "country": ""
        }
    ],
    "keywords": []
}