{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000732",
    "title": "Particle swarm optimization algorithm based on comprehensive scoring framework for high-dimensional feature selection",
    "abstract": "Feature selection (FS) plays an important role in data preprocessing. However, with the ever-increasing dimensionality of the dataset, most FS methods based on evolutionary computational (EC) face the challenge of “the dimensionality curse”. To address this challenge, we propose an new particle swarm optimization algorithm based on comprehensive scoring framework (PSO-CSM) for high-dimensional feature selection. First, a piecewise initialization strategy based on feature importance is used to initialize the population, which can help to obtain a diversity population and eliminate some redundant features. Then, a comprehensive scoring mechanism is proposed for screening important features. In this mechanism, a scaling adjustment factor is set to adjust the size of the feature space automatically. As the population continues to evolve, its feature space is further reduced so as to focus on the more promising area. Finally, a general comprehensive scoring framework (CSM) is designed to improve the performance of EC methods in FS task. The proposed PSO-CSM is compared with 10 representative FS algorithms on 18 datasets. The experimental results show that PSO-CSM is highly competitive in solving high-dimensional FS problems.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Bo Wei",
            "country": ""
        },
        {
            "name": "Shanshan Yang",
            "country": ""
        },
        {
            "name": "Wentao Zha",
            "country": ""
        },
        {
            "name": "Li Deng",
            "country": ""
        },
        {
            "name": "Jiangyi Huang",
            "country": ""
        },
        {
            "name": "Xiaohui Su",
            "country": ""
        },
        {
            "name": "Feng Wang",
            "country": ""
        }
    ],
    "keywords": []
}