{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022400227X",
    "title": "Photovoltaic model parameters identification using diversity improvement-oriented differential evolution",
    "abstract": "Fast and accurate parameter identification of the photovoltaic (PV) model is crucial for calculating, controlling, and managing PV generation systems. Numerous meta-heuristic algorithms have been applied to identify unknown parameters due to the multimodal and nonlinear characteristics of the parameter identification problems. Although many of them can obtain satisfactory results, problems such as premature convergence and population stagnation still exist, influencing the optimization performance. A novel variant of Differential Evolution, namely, Diversity Improvement-Oriented Differential Evolution (DIODE), is proposed to mitigate these deficiencies and obtain reliable parameters for PV models. In DIODE, an adaptive perturbation strategy is employed to perturb current individuals to mitigate premature convergence by enhancing population diversity. Secondly, a diversity improvement mechanism is proposed, where information on the covariance matrix and fitness improvement of individuals is used as a diversity indicator to detect stagnant individuals, which are then updated by the intervention strategy. Lastly, a novel parameter adaptation strategy is employed to maintain a sound balance between exploration and exploitation. The proposed DIODE algorithm is applied to parameter identification problems of six PV models, including single, double, and triple diode and three PV module models. In addition, a large test bed containing 72 benchmark functions from CEC2014, CEC2017, and CEC2022 test suites is employed to verify DIODE’s overall performance in terms of optimization accuracy. Experiment results demonstrate that DIODE can secure accurate parameters of PV models and achieve highly competitive performance on benchmark functions.",
    "citation_count": "3",
    "year": "2024/10/01",
    "authors": [
        {
            "name": "Chongle Ren",
            "country": ""
        },
        {
            "name": "Zhenghao Song",
            "country": ""
        },
        {
            "name": "Zhenyu Meng",
            "country": ""
        }
    ],
    "keywords": []
}