{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221000936",
    "title": "Pioneer selection for evolutionary multiobjective optimization with discontinuous feasible region",
    "abstract": "Constrained  multiobjective optimization  problems (CMOPs) are widespread in real-world applications. Nevertheless, CMOPs with discontinuous feasible regions are challenging for existing evolutionary algorithms due to the difficulty of passing through the infeasible regions. Moreover, there are only several benchmark test problems specified for promoting the research in complex constrained multiobjective optimization. To address these two issues, we first propose a set of CMOPs with discontinuous feasible regions by introducing constraints into the widely used DTLZ test problems, and then a pioneer selection strategy is designed to handle these complex  constrained optimization problems . The general idea of the proposed constraint handling strategy is simple, which selects some individuals in the population as the pioneer population, aiming to obtain some well-converged solutions without considering the constraints. By adjusting the ratio of the pioneer solutions during the evaluation, the quasi-optimal solutions are expected to approximate the  Pareto optimal front . To investigate the performance of the proposed strategy, it is embedded in a classic evolutionary algorithm and compared with three state-of-the-art constrained multiobjective evolutionary algorithms. Experimental results demonstrate the effectiveness of the proposed strategy and also show that the proposed benchmark problems are challenging for existing approaches.",
    "citation_count": "9",
    "year": "2021/08/01",
    "authors": [
        {
            "name": "Lianghao Li",
            "country": ""
        },
        {
            "name": "Cheng He",
            "country": ""
        },
        {
            "name": "Wenting Xu",
            "country": ""
        },
        {
            "name": "Linqiang Pan",
            "country": ""
        }
    ],
    "keywords": []
}