{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650221001140",
    "title": "Population initialization techniques for evolutionary algorithms for single-objective constrained optimization problems: Deterministic vs. stochastic techniques",
    "abstract": "The population initialization step is a common step in the majority (or even all) of  evolutionary algorithms  (EAs). There are many population initialization techniques. Due to the limited  population size  and the high dimensionality of many problems, there is little chance to cover the promising regions in the search space. From different perspectives, this paper compares the stochastic and deterministic population initialization techniques through comparing five of the well-known population initializers: Random number generator (RNG), Latin Hypercube, Sobol, Halton, and Kronecker. Due to the presence of many constraints in real-world applications, in this paper, we are focusing only on single-objective  constrained optimization  problems. Specifically, the goal is to investigate if there is a significant difference between these population initialization methods. In this paper, we explain theoretically and mathematically these different population initialization techniques. Moreover, different illustrative examples and visualizations are introduced to explain the behavior of each technique and compare different techniques from different perspectives. The results show that due to the high uniformity of the low-discrepancy sequences such as the Halton and Sobol sequences, the generated points using these sequences are more evenly distributed over the space than RNG, which is the commonly used technique for initializing the populations in EAs. Practically, using a set of benchmark functions, we investigate the use of each population initialization technique for initializing different population-based evolutionary algorithms. The results of our experiments prove that with sufficient numbers of iterations, the EAs are not sensitive to the initialization methods and there are no significant differences between the mentioned population initialization methods. Further, the low discrepancy methods enhance the exploration ability of EAs in early iterations.",
    "citation_count": "33",
    "year": "2021/12/01",
    "authors": [
        {
            "name": "Alaa Tharwat",
            "country": ""
        },
        {
            "name": "Wolfram Schenck",
            "country": ""
        }
    ],
    "keywords": []
}