{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000512",
    "title": "Proximity ranking-based multimodal differential evolution",
    "abstract": "Multimodal optimization aiming at locating multiple global optima at a time has received extensive attention from researchers since it can afford multiple choices for decision-makers. To effectively locate as many optima of multimodal optimization problems (MMOPs) as possible, this paper proposes a novel differential evolution framework, named proximity ranking-based multimodal differential evolution (PRMDE). Firstly, a proximity ranking-based individual selection method is proposed to randomly select parent individuals involved in the mutation operation. Specifically, instead of the classical uniform selection, this paper devises a non-linear weight function to calculate the selection probabilities of individuals according to their proximity rankings and then randomly selects parent individuals based on the roulette wheel selection strategy. In this way, each individual is likely mutated by its Euclidian neighbors. Secondly, an adaptive parameter adjustment strategy is further devised for the selection probability calculation, so that the selection probabilities of closer individuals to each target individual gradually increase as the evolution continues. Thirdly, an adaptive local search strategy is designed to carry out the  Gaussian distribution  based local search adaptively around individuals. In this way, better individuals have higher chances to conduct local search to subtly improve their quality. By means of the cohesive cooperation among the three main mechanisms, PRMDE is expectedly capable of simultaneously locating multiple optima of MMOPs. Theoretically, any mutation strategy can be embedded into PRMDE to deal with MMOPs. Four classical mutation strategies are adopted in this paper to instantiate PRMDE. Experiments carried out on the publicly acknowledged CEC2013 benchmark MMOP set demonstrate that PRMDE is effective to solve MMOPs and attains considerably competitive or even far better optimization performance than several representative and state-of-the-art multimodal optimization methods.",
    "citation_count": "39",
    "year": "2023/04/01",
    "authors": [
        {
            "name": "Junna Zhang",
            "country": ""
        },
        {
            "name": "Degang Chen",
            "country": ""
        },
        {
            "name": "Qiang Yang",
            "country": ""
        },
        {
            "name": "Yiqiao Wang",
            "country": ""
        },
        {
            "name": "Dong Liu",
            "country": ""
        },
        {
            "name": "Sang-Woon Jeon",
            "country": ""
        },
        {
            "name": "Jun Zhang",
            "country": ""
        }
    ],
    "keywords": []
}