{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304521",
    "title": "Purpose-directed two-phase multiobjective differential evolution for constrained multiobjective optimization",
    "abstract": "When solving constrained  multiobjective optimization problems  by evolutionary algorithm, the key challenge is how to achieve the balance among convergence, diversity, and feasibility. To deal with this challenge, a purpose-directed two-phase multiobjective differential evolution (PDTP-MDE) algorithm is developed in this paper. The main idea of PDTP-MDE is that the whole evolution process is divided into two sequential phases according to the expected purpose of each stage. To be specific, the first phase aims at keeping the balance between convergence and diversity, while the feasibility is taken as an  auxiliary  indicator. In this way, the population is capable of exploring different potential areas and avoiding to be trapped into local ones, thus providing more information about convergence and diversity for the later evolution process. Afterwards, the second phase mainly tends to maintain feasibility and diversity by selecting and using some promising infeasible solutions according to the population evolution status. In addition, an archive is maintained after each phase to preserve the superior feasible  Pareto solutions  found so far. By the above processes, the feasible  Pareto front  with well convergence and well diversity is obtained. The comprehensive experiments on 42 benchmark problems from three test suites demonstrate the superiority and competitiveness of the proposed PDTP-MDE, in comparison with other state-of-the-art constrained multiobjective evolutionary algorithms.",
    "citation_count": "68",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Kunjie Yu",
            "country": ""
        },
        {
            "name": "Jing Liang",
            "country": ""
        },
        {
            "name": "Boyang Qu",
            "country": ""
        },
        {
            "name": "Caitong Yue",
            "country": ""
        }
    ],
    "keywords": []
}