{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001876",
    "title": "Q-learning based multi-objective immune algorithm for fuzzy flexible job shop scheduling problem considering dynamic disruptions",
    "abstract": "Confronted with complex industrial environments, dynamic disruptions like new job arrival and machine breakdown bring significant challenges to the robustness and stability of the manufacturing process, making the static production depart from the original scheduling scheme. To address this problem, a flexible job shop scheduling problem with fuzzy processing time, dynamic disruptions, and variable processing speeds is considered simultaneously. As well as three objectives of maximum completion time, total energy consumption, and average agreement index are demonstrated in this study. Then, a predictive-reactive dynamic/static rescheduling model is developed, where the off-line based  mixed integer linear programming model  and the on-line based rescheduling heuristics are proposed. Next, a multi-objective immune algorithm combined with a  Q -learning algorithm ( Q -MOIA) is developed. In the proposed algorithm, an active decoding heuristic based on the interval insertion mechanism is used to optimize the initial solutions. After that, the clonal selection-based immune algorithm and the  Q -learning algorithm are adopted to improve the exploration and exploitation capabilities, respectively, where four objective-driven neighborhood structures are designed. Eventually, extensive computational experiments were conducted on 27 instances under static and dynamic scenarios to demonstrate the superiority and stability of the proposed predictive-reactive dynamic/static rescheduling model and the  Q -MOIA. Comparative analysis with four state-of-the-art approaches revealed that proposed  Q -MOIA outperformed in approximately 51.9, 66.7, and 83.3 % of the instances for the three multi-objective metrics.",
    "citation_count": "26",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Xiao-long Chen",
            "country": ""
        },
        {
            "name": "Jun-qing Li",
            "country": ""
        },
        {
            "name": "Ying Xu",
            "country": ""
        }
    ],
    "keywords": []
}