{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000811",
    "title": "Quantum circuit mapping based on discrete particle swarm optimization and deep reinforcement learning",
    "abstract": "Current quantum devices are constrained by a limited number of physical qubits and their sparse connectivity. When executing logical quantum circuits on these devices, it is necessary to map them into equivalent circuits adhering to these constraints. The initial allocation of logical qubits to physical ones and the strategic addition of SWAP gates to meet connectivity requirements are critical decisions impacting the performance of mapped circuits. To tackle these challenges, this paper presents a novel quantum circuit mapping method that integrates discrete particle swarm optimization and deep reinforcement learning. Initially, a qubit allocation algorithm using discrete particle swarm optimization with a sorting selection strategy quickly maps logical to physical qubits. Then, an enhanced double deep-Q-network based quantum gate scheduling algorithm with an action space search strategy obtains a SWAP addition scheme that results in shallower depth and fewer additional quantum gates. Comparisons on benchmark datasets (B131 and B114) and the IBM Q20 quantum device show that our method outperforms others regarding algorithm runtime, mapped circuit depth, and the number of added SWAP gates. It also demonstrates scalability on large-scale circuits and IBM Q127. Compared to heuristic methods (subgraph isomorphism and filtered depth-limited search based quantum circuit mapping algorithms), it reduces the average number of added SWAP gates by 29.1% and the average runtime by 41.95%. Compared to a recent reinforcement learning method using Monte Carlo Tree Search for mapping, it decreases the average added depth by 26.05% and the average number of added SWAP gates by 25.58%. Moreover, compared to commercial compilers tket and qiskit, the proposed method results in 14.73% and 16.55% fewer SWAP gates, respectively.",
    "citation_count": "0",
    "year": "2025/06/01",
    "authors": [
        {
            "name": "Yang-Zhi Li",
            "country": ""
        },
        {
            "name": "Wen Liu",
            "country": ""
        },
        {
            "name": "Guo-Sheng Xu",
            "country": ""
        },
        {
            "name": "Mao-Duo Li",
            "country": ""
        },
        {
            "name": "Kai Chen",
            "country": ""
        },
        {
            "name": "Shou-Li He",
            "country": ""
        }
    ],
    "keywords": []
}