{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650222001675",
    "title": "Real-time collaborative feeder vehicle routing problem with flexible time windows",
    "abstract": "Today, transportation has become a vital service due to increased competition among businesses. In this regard, customer service is one of the major challenges of logistics units. Companies can improve logistics costs, capacity utilization, service levels, and customer satisfaction by sharing new demands. The need for fast, flexible, reliable, and low-cost delivery is another challenge in urban areas for the distribution of goods. As demand increases, more vehicles are needed to deliver goods and congestion increases in urban transportation networks. A feeder vehicle routing problem (FVRP) consists of a heterogeneous fleet of vehicles, including trucks and motorcycles. In this problem, motorcycles pass easily in crowded areas, and the traffic of urban logistics is distributed easily. More importantly, it reduces the number of returns to the physical depot, lowers the costs, and leads to time savings. This study introduces the real-time collaborative feeder vehicle routing problem (RTCFVRP) with flexible time windows in which vehicles are permitted to serve customers before and after the time window. We propose the mixed-integer linear programming model with the CPLEX mathematical programming solver applying the augmented epsilon constraint. Also, multi-objective  particle swarm optimization  (MOPSO) and MOPSO-variable neighborhood search (MOPSO-VNS) were developed regarding the complexity of the problem. The performance of these algorithms was compared with  Pareto solutions  generated by the non-dominated sorting genetic algorithm-II (NSGA-II) and multi-objective evolutionary algorithm based on decomposition (MOEA/D) in both static and dynamic modes. Finally, in addition to statistical analysis, the AHP-TOPSIS method is employed to analyze and prioritize algorithms. The obtained results show the better performance of the proposed algorithm in both static and dynamic modes in small and large-size instances.",
    "citation_count": "19",
    "year": "2022/12/01",
    "authors": [
        {
            "name": "M. Salehi Sarbijan",
            "country": ""
        },
        {
            "name": "J. Behnamian",
            "country": ""
        }
    ],
    "keywords": []
}