{
    "url": "https://www.sciencedirect.com/science/article/pii/S221065022500046X",
    "title": "Reinforcement learning assisted differential evolution with adaptive resource allocation strategy for multimodal optimization problems",
    "abstract": "Multimodal optimization problems (MMOPs) present the challenge of identifying multiple optimal solutions within a search space, requiring algorithms to effectively balance exploration and exploitation. To enhance solution accuracy, the local search methods often focus on elite individuals, allocating additional fitness evaluations (FEs) to refine their solutions. However, once the optima near these elite individuals are identified, continued allocation of FEs becomes inefficient, leading to a waste of limited resources. This highlights the inherent difficulty of achieving a balance between exploration and exploitation within the population under constrained resources. To solve this problem, this paper proposes a new reinforcement learning-assisted differential evolution (RLDE) algorithm with adaptive resource allocation strategy. Firstly, the exploitation population is proposed, and the original population focuses on exploring undiscovered optimal regions and generating exploitation populations, while each exploitation population focuses on finding high-precision optima within its responsible optimal region. Secondly, a reinforcement learning-assisted adaptive resource allocation (RLRA) strategy is proposed to allocate FEs, which can reduce the waste of FEs and balance the exploration and exploitation ability among multiple populations. Finally, a local greedy mutation (LGM) strategy is proposed to help individuals evolve toward the neighborhood with better fitness values. Compared with 11 state-of-the-art multimodal algorithms, the RLDE achieves better or more competitive results in all accuracy levels. Besides, the results on the dielectric composite optimization problem verify the practicality of RLDE.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Tao Ma",
            "country": ""
        },
        {
            "name": "Hong Zhao",
            "country": ""
        },
        {
            "name": "Xiangqian Li",
            "country": ""
        },
        {
            "name": "Fang Yang",
            "country": ""
        },
        {
            "name": "Chun-sheng Liu",
            "country": ""
        },
        {
            "name": "Jing Liu",
            "country": ""
        }
    ],
    "keywords": []
}