{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650225000471",
    "title": "Smart cities optimization using computational intelligence in power-constrained IoT sensor networks",
    "abstract": "This paper introduces the Innovative Clustering Energy Efficient Equilibrium Optimizer-based Multi-Hop Routing Protocol (ICEE-EO-MHRP) for addressing the energy constraint in Internet of Things (IoT) network clustering utilizing the Equilibrium Optimizer (EO), a yet efficient computational intelligence method that is used for selecting Designated Cluster Head (DCH) and Backup DCH (BDCH). Additionally, ICEE-EO-MHRP deals with the IoT energy problem by incorporating a novel cost function that ends up of selecting Designated Relays (DRs) and backup DRs for the purpose of forwarding the traffic towards the sink node. Our protocol substantially reduces messages’ exchanges between IoT Sensor Nodes (SNs) by making the replacement of DCH and BDCH dependent on their energy levels dropping below a threshold. To ensure a balanced communication load and efficient scheduling, an innovative deterministic distributed-time division multiple access system is employed. Not only to this extent, but we address data redundancy issue, raised among those quite adjacent SNs, and accordingly propose an efficient management that guarantees having a coherent protocol. In addition to that, device and link failures are professionally addressed by suggesting recovery mechanisms that optimize the proposed protocol. Dealing with these impairments puts our approach well ahead of the competition since it addresses the most practical issues and scenarios, particularly those with challenging environmental constraints. The simulation results demonstrate primarily that our protocol significantly improves the network lifetime by 157.83 % and 109.81 % in comparison to Particle Swarm Optimization and Tabu Search (Tabu-PSO) and Energy-Efficient CH Selection by Improved Sparrow Search Algorithm utilizing Differential Evolution (EECHS-ISSADE), respectively. Comparing ICEE-EO-MHRP to Tabu-PSO and EECHS-ISSADE reveals improvements in residual energy of 335.87 % and 230.05 %, respectively. Furthermore, in comparison to Tabu-PSO and EECHS-ISSADE, the proposed protocol optimizes the throughput by 252.36 % and 168.64 %, respectively. In terms of average delay, our protocol outperforms Tabu-PSO, EECHS-ISSADE, PEGASIS with Artificial Bee Colony (PEG-ABC), Metaheuristics Cluster-based Routing Technique for Energy-Efficient WSN (MHCRT-EEWSN), as well as Hybrid Bald Eagle Search Optimization Algorithm (HBESAOA) by improvements of 57.53 %, 55.15 %, 86.89 %, 20.52 %, and 94.60 %, respectively.",
    "citation_count": "0",
    "year": "2025/04/01",
    "authors": [
        {
            "name": "Khalid A. Darabkh",
            "country": ""
        },
        {
            "name": "Muna Al-Akhras",
            "country": ""
        }
    ],
    "keywords": []
}