{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650219305553",
    "title": "Study of population partitioning techniques on efficiency of swarm algorithms",
    "abstract": "This paper presents a study of various population partitioning techniques and their effect on the efficiency of swarm algorithms. Population partitioning techniques based on different concepts have been studied. Prominent amongst them is self-adaptive multi-population (SAMP) technique where populations are added and deleted dynamically based on their diversity. This techniques start with a single randomly initialised population, called  free population . After evolution, if the distance between solutions drops below a limit, it is considered to have converged. If all existing populations have converged, a new randomly generated population is added. SAMP keeps at least one free population at all times, hence ensuring the algorithm doesn’t get trapped in  local optima . Another promising population partitioning technique studied is random partitioning, where a single population is divided into many smaller sub-populations randomly. Few extensions to the studied techniques are proposed, like an adaptive hierarchical partitioning technique, seed based partitioning with fixed seeds, random partitioning with master population, SAMP with random partitioning etc. All the studied and proposed techniques are compared over a set of  benchmark functions . The strongest amongst all techniques was found to be SAMPR. SAMPR is a hybrid of self-adaptive multi-population (SAMP) technique and random partitioning where after every few generations all populations are combined together and re-partitioned randomly. Efficiency of SAMPR is validated over seven well-known swarm algorithms. Extensive comparisons are conducted over multiple benchmark functions, CEC′14 function set and 800 GKLS generated functions. Results establish the efficiency of the proposed technique for improving performance of swarm algorithms.",
    "citation_count": "17",
    "year": "2020/06/01",
    "authors": [
        {
            "name": "Reshu Chaudhary",
            "country": ""
        },
        {
            "name": "Hema Banati",
            "country": ""
        }
    ],
    "keywords": []
}