{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223001748",
    "title": "Surrogate-assisted expensive constrained Bi-objective optimization with highly heterogeneous evaluations",
    "abstract": "Expensive  multiobjective optimization problem  has been thoroughly studied in the past few years. However, one type of problem is often overlooked. Still, it is common in practice, whose partial target functions (objectives and constraints) are expensive that require approximations by  surrogate models , while others have explicit formulas that can calculate immediately. To address this problem, a general representation is first defined as a highly heterogeneous optimization problem (HHOP) in this work. In terms of bi-objective constrained HHOP, an algorithm is proposed based on the Kriging surrogate model with a new exact 2-D expected hypervolume improvement (EHVI) calculation method and a new constraint handling approach considering both the expensive and inexpensive target functions. In EHVI calculation, the integral is only performed in the expensive objective dimension due to the deterministic of the inexpensive objective, resulting in the reduction of the time complexity and increase of the accuracy. Combining a multiobjective and a dominance-based constraint handling approaches, a new constraint handling strategy is proposed to deal with the constrained HHOP specifically. The effectiveness of the proposed EHVI calculation method and constraint handling strategy is verified by the benchmark comparison problems. whose results also indicate the superiority of the proposed algorithm compared with the other state-of-art algorithms. Furthermore, the proposed algorithm is implemented for a head sheave optimization problem to demonstrate its practicability in real-world problems.",
    "citation_count": "3",
    "year": "2023/12/01",
    "authors": [
        {
            "name": "Yong Pang",
            "country": ""
        },
        {
            "name": "Xiaonan Lai",
            "country": ""
        },
        {
            "name": "Yitang Wang",
            "country": ""
        },
        {
            "name": "Xiwang He",
            "country": ""
        },
        {
            "name": "Shuai Zhang",
            "country": ""
        },
        {
            "name": "Xueguan Song",
            "country": ""
        }
    ],
    "keywords": []
}