{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650220304569",
    "title": "Sustainable scheduling of distributed permutation flow-shop with non-identical factory using a knowledge-based multi-objective memetic optimization algorithm",
    "abstract": "With the development of economic globalization and sustainable manufacturing, sustainable scheduling of distributed manufacturing has attracted increasing concern. However, distributed manufacturing with the non-identical factory is rarely researched. Meanwhile, scheduling can affect the  sustainability  of manufacturing. Thus, this paper is the first attempt to investigate a sustainable distributed permutation flow-shop scheduling problem with a non-identical factory (DPFSP-NF). We formulate a novel mathematical model of this DPFSP-NF with objectives of minimizing makespan, negative social impact ( NSI ), and total energy consumption ( TEC ). A knowledge-based multi-objective memetic optimization algorithm (KMMOA) is presented to address this DPFSP-NF. First, a new energy conservation strategy is designed and embedded in the model to reduce  TEC  criterion. Second, a cooperative initialization mechanism is presented to yield initial solutions with good diversity and convergence. Third, several properties of DPFSP-NF are investigated and utilized to develop the knowledge-based local search operator. The impact of parameter configuration on KMMOA is studied by the  Taguchi method . Finally, we compare KMMOA to its variants and other well-known multi-objective optimization algorithms by performing a number of experiments. Experiment results demonstrate the effectiveness of each improvement component of the KMMOA, and verify that KMMOA is an effective approach to deal with the DPFSP-NF.",
    "citation_count": "80",
    "year": "2021/02/01",
    "authors": [
        {
            "name": "Chao Lu",
            "country": ""
        },
        {
            "name": "Liang Gao",
            "country": ""
        },
        {
            "name": "Wenyin Gong",
            "country": ""
        },
        {
            "name": "Chengyu Hu",
            "country": ""
        },
        {
            "name": "Xuesong Yan",
            "country": ""
        },
        {
            "name": "Xinyu Li",
            "country": ""
        }
    ],
    "keywords": []
}