{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216301092",
    "title": "Swarm intelligence inspired classifiers for facial recognition",
    "abstract": "Facial recognition is a challenging issue in pattern recognition arising from the need for high security systems capable of overcoming the variability of the acquisition environment such as illumination, pose or facial expression. A broad range of recognition methods have been suggested, yet most are still unable to yield optimal accuracy. More recently, new methods based on  swarm intelligence  or classifiers combination have been devised in the field of facial recognition. Swarm intelligence based methods aim to achieve effective  recognition accuracy  by exploiting their global optimization capability. The combination of classifiers is a new trend allowing cooperation between  multiple classifiers . In this work, two classifiers inspired from  swarm intelligence  are proposed: a bees algorithm based classifier and a  decision tree  based binary  particle swarm optimization  classifier. The two are then combined with a decision tree based fuzzy  support vector machine  by using the majority vote as an attempt to compensate for the weakness of single classifiers. Moreover, the impact of different characteristic features and space reduction methods has been examined namely, the Gabor magnitude and the Gabor phase  congruency  features in combination with  PCA ,  LDA  or KFA reduction space methods. The experiments were conducted on four popular databases: ORL, YALE, FERET and UMIST. The results revealed that the proposed swarm intelligence based classifiers are very effective compared to similar classifiers in terms of recognition accuracy.",
    "citation_count": "23",
    "year": "2017/02/01",
    "authors": [
        {
            "name": "Salima Nebti",
            "country": ""
        },
        {
            "name": "Abdallah Boukerram",
            "country": ""
        }
    ],
    "keywords": []
}