{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223000597",
    "title": "Symmetric uncertainty based decomposition multi-objective immune algorithm for feature selection",
    "abstract": "Feature selection (FS) is a significant  data preprocessing  technology in many fields. FS generally has two primary conflicting goals: 1) reducing features number and 2) improving  classification accuracy , so it can be considered as a multi-objective  optimization problem . This paper studies a symmetric uncertainty (SU) based decomposition multi-objective  immune algorithm  for feature selection, called MOIA/D-SU. Three novel strategies are proposed in MOIA/D-SU, namely population initialization strategy (PIS), proportional clone strategy (PCS) and population update strategy (PUS). The symmetric uncertainty based PIS calculates the SU value between each feature and class label, and initializes the population based on SU value. In the PCS, a new fitness function is defined to evaluate the performance of solutions, and then the proportional  cloning process  of excellent solutions will be performed to form a clone population that can be used to guide the evolution of the population. PUS uses the generated new solution to update the neighbor of the  weight vector  that minimizes the  Tchebycheff  distance of this new solution, instead of updating the neighbor of the current  weight vector , so the update process is more efficient. Extensive experiments are performed on 13 benchmark data sets and compared the proposed method with five state-of-the-art multi-objective  evolutionary algorithms . The experimental results demonstrate that MOIA/D-SU can better balance these two conflicting goals, and can achieve higher  classification accuracy .",
    "citation_count": "16",
    "year": "2023/04/01",
    "authors": [
        {
            "name": "Zhengyi Chai",
            "country": ""
        },
        {
            "name": "Wangwang Li",
            "country": ""
        },
        {
            "name": "Yalun Li",
            "country": ""
        }
    ],
    "keywords": []
}