{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650217306776",
    "title": "Synergism of Firefly Algorithm and Q-Learning for Robot Arm Path Planning",
    "abstract": "Over the past few decades,  Firefly Algorithm  (FA) has attracted the attention of many researchers by virtue of its capability of solving complex real-world optimization problems. The only factor restricting the efficiency of this FA algorithm is the need of having balanced exploration and exploitation while searching for the global optima in the search-space. This balance can be established by tuning the two inherent control parameters of FA. One is the  randomization  parameter and another is  light absorption  coefficient, over iterations, either experimentally or by an automatic adaptive strategy. This paper aims at the later by proposing an improvised FA which involves the Q-learning framework within itself. In this proposed Q-learning induced FA (QFA), the optimal parameter values for each firefly of a population are learnt by the Q-learning strategy during the learning phase and applied thereafter during execution. The proposed algorithm has been simulated on fifteen benchmark functions suggested in the CEC 2015 competition. In addition, the proposed algorithm's superiority is tested by conducting the Friedman test, Iman–Davenport and Bonferroni Dunn test. Moreover, its suitability for application in real-world constrained environments has been examined by employing the algorithm in the  path planning  of a  robotic manipulator  amidst various obstacles. To avoid obstacles one mechanism is designed for the robot-arm. The results, obtained from both simulation and real-world experiment, confirm the superiority of the proposed QFA over other contender algorithms in terms of solution quality as well as run-time complexity.",
    "citation_count": "78",
    "year": "2018/12/01",
    "authors": [
        {
            "name": "Arup Kumar Sadhu",
            "country": ""
        },
        {
            "name": "Amit Konar",
            "country": ""
        },
        {
            "name": "Tanuka Bhattacharjee",
            "country": ""
        },
        {
            "name": "Swagatam Das",
            "country": ""
        }
    ],
    "keywords": []
}