{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224001561",
    "title": "Towards multi-objective high-dimensional feature selection via evolutionary multitasking",
    "abstract": "Feature selection (FS) plays a crucial role in high-dimensional classification problems by identifying relevant features that contribute to model performance. Evolutionary multitasking (EMT) has recently shown success in FS problems. However, existing EMT-based FS methods have limitations in terms of diversity in task construction, evolutionary search, and knowledge transfer, leading to inadequate acquisition, exploration, and utilization of knowledge. To this end, this paper develops a novel EMT framework for multi-objective high-dimensional FS problems, namely MO-FSEMT. In particular, multiple  auxiliary  tasks are constructed by distinct formulation methods to provide diverse  search spaces  and information representations and then simultaneously addressed with the original task by leveraging multiple evolutionary solvers with different biases and search preferences. A task-specific-based knowledge transfer mechanism is designed to leverage the advantageous information from each task, facilitating the discovery and effective transmission of high-quality solutions during the search process. Comprehensive experimental results on 27 real high-dimensional datasets demonstrate the superiority of MO-FSEMT over state-of-the-art FS methods in terms of effectiveness and efficiency. Ablation studies further confirm the contributions of key components of the proposed MO-FSEMT.",
    "citation_count": "6",
    "year": "2024/08/01",
    "authors": [
        {
            "name": "Yinglan Feng",
            "country": ""
        },
        {
            "name": "Liang Feng",
            "country": ""
        },
        {
            "name": "Songbai Liu",
            "country": ""
        },
        {
            "name": "Sam Kwong",
            "country": ""
        },
        {
            "name": "Kay Chen Tan",
            "country": ""
        }
    ],
    "keywords": []
}