{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650223002225",
    "title": "Triple competitive differential evolution for global numerical optimization",
    "abstract": "As  optimization problems  become more and more complex in real-world scenarios, the effectiveness of many existing differential evolution (DE) methods is critically challenged. To circumvent this predicament, this paper proposes a triple competitive DE (TCDE) to tackle increasingly complicated optimization problems. Specifically, a triple competition mechanism is devised to first randomly arrange individuals into exclusive triples and then let individuals in each triple compete with each other. Subsequently, heterogeneous mutation schemes are designed to update the three individuals in each triple based on the competition results. With the cooperation between these two techniques, on the one hand, better individuals in the triples tend to exploit the areas where they lie to find high-accuracy solutions, while worse individuals in the triples prefer to explore the intricate problem space to locate promising regions. On the other hand, different individuals are mutated by following the guidance of different leading exemplars, which ensures that individuals traverse the sophisticated  solution space  in diverse directions along with slight intensification to optimal regions. Furthermore, a modified adaptive parameter adjustment scheme is designed for individuals in each triple by considering their differences so as to meet the expectation that better individuals focus on exploitation while worse individuals concentrate on exploration. Finally, experiments are performed to first compare TCDE with totally 10 advanced DE variants and then further compare it with totally 10 CEC winners and their latest variants on the CEC'2014 and the CEC'2017 problem suites with totally 4 different dimensionality settings. Experimental results prove that TCDE achieves highly competitive or even much better performance than the totally 20 compared methods. Particularly, TCDE is demonstrated to be especially capable of solving complicated optimization problems. Furthermore, the efficacy of TCDE in tackling real-world optimization problems is substantiated through experiments conducted on the CEC'2011 real-world optimization problem set.",
    "citation_count": "22",
    "year": "2024/02/01",
    "authors": [
        {
            "name": "Qiang Yang",
            "country": ""
        },
        {
            "name": "Zhuo-Yin Qiao",
            "country": ""
        },
        {
            "name": "Peilan Xu",
            "country": ""
        },
        {
            "name": "Xin Lin",
            "country": ""
        },
        {
            "name": "Xu-Dong Gao",
            "country": ""
        },
        {
            "name": "Zi-Jia Wang",
            "country": ""
        },
        {
            "name": "Zhen-Yu Lu",
            "country": ""
        },
        {
            "name": "Sang-Woon Jeon",
            "country": ""
        },
        {
            "name": "Jun Zhang",
            "country": ""
        }
    ],
    "keywords": []
}