{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650224000130",
    "title": "Two-stage evolutionary algorithm with fuzzy preference indicator for multimodal multi-objective optimization",
    "abstract": "Multimodal multi-objective optimization problems (MMOPs) are multi-objective optimization problems (MOPs) involving multiple equivalent global or local Pareto optimal solution sets (PSs). For decision-makers, not only the global optimal solution sets need to be found, but also the value of local optimal solution sets cannot be ignored. However, most multimodal multi-objective  evolutionary algorithms  (MMOEAs) tend to select solutions with better convergence, and it is difficult to obtain the global PSs and local PSs at the same time. Therefore, we propose a fuzzy preference indicator-based two-stage evolutionary algorithm (FPITSEA) in this paper. To evaluate more comprehensively the potential of each solution in the population for locating the global and local PS during the evolutionary process, a fuzzy preference indicator is designed in FPITSEA. The fuzzy preference indicator is used to guide the evolution of the population in the first stage to find the global and local Pareto optimal regions. Subsequently, an independent evolution strategy is implemented in the second stage to distinguish different PSs as accurately as possible while also ensuring the convergence quality of the solution set. In addition, an improved distance-based subset selection method is proposed, aiming to simultaneously improve the distribution of the solution set in the decision space and objective space. Experimental results on several test sets of MMOPs show the advantages of FPITSEA over several state-of-the-art MMOEAs.",
    "citation_count": "13",
    "year": "2024/03/01",
    "authors": [
        {
            "name": "Yinghong Xie",
            "country": ""
        },
        {
            "name": "Junhua Li",
            "country": ""
        },
        {
            "name": "Yufei Li",
            "country": ""
        },
        {
            "name": "Wenhao Zhu",
            "country": ""
        },
        {
            "name": "Chaoqing Dai",
            "country": ""
        }
    ],
    "keywords": []
}