{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650218310186",
    "title": "Using Compact Evolutionary Tabu Search algorithm for matching sensor ontologies",
    "abstract": "To implement the semantic interoperability among intelligent  sensor applications , it is necessary to match the identical entities across the sensor ontologies. Since sensor  ontology matching  problem requires matching thousands of sensor concepts and has many  local optimal solutions ,  Evolutionary Algorithm  (EA) becomes the state-of-the-art methodology for solving it. However, the premature convergence and long runtime are two drawbacks which make EA-based sensor ontology matchers incapable of effectively searching the optimal solution for sensor ontology matching problem. To improve the efficiency of EA-based sensor ontology matching technique, in this paper, a new optimal model of sensor ontology matching problem is first constructed, a novel sensor concept similarity measure is then presented to determine the identical sensor concepts, and finally, a problem-specific Compact Evolutionary  Tabu Search algorithm  (CETS) is presented to efficiently determine the sensor  ontology alignment . In particular, CETS combines Compact Evolutionary Algorithm (global search) and Tabu Search algorithm (local search), and this marriage between global search and local search allows keeping high solution diversity via PV (reducing the possibility of the premature convergence) and increasing the convergence speed via the local search (reducing the runtime). The experimental results show that comparing with the state-of-the-art sensor ontology matching techniques, CETS can more efficiently determine the high-quality alignments.",
    "citation_count": "74",
    "year": "2019/08/01",
    "authors": [
        {
            "name": "Xingsi Xue",
            "country": ""
        },
        {
            "name": "Junfeng Chen",
            "country": ""
        }
    ],
    "keywords": []
}