{
    "url": "https://www.sciencedirect.com/science/article/pii/S2210650216300931",
    "title": "Voxelisation in the 3-D Fly Algorithm for PET",
    "abstract": "The Fly Algorithm was initially developed for 3-D robot vision applications. It consists in solving the  inverse problem  of  shape reconstruction  from projections by evolving a population of 3-D points in space (the ‘flies’), using an evolutionary  optimisation strategy . Here, in its version dedicated to  tomographic reconstruction  in medical imaging, the flies are mimicking radioactive photon sources. Evolution is controlled using a fitness function based on the discrepancy of the projections simulated by the flies with the actual pattern received by the sensors. The reconstructed radioactive concentration is derived from the population of flies, i.e. a collection of points in the 3-D  Euclidean space , after convergence. ‘Good’ flies were previously binned into voxels. In this paper, we study which flies to include in the final solution and how this information can be sampled to provide more accurate datasets in a reduced computation time. We investigate the use of density fields, based on Metaballs and on  Gaussian functions  respectively, to obtain a realistic output. The spread of each  Gaussian kernel  is modulated in function of the corresponding fly fitness. The resulting volumes are compared with previous work in terms of normalised-cross correlation. In our test-cases, data fidelity increases by more than 10% when density fields are used instead of binning. Our method also provides reconstructions comparable to those obtained using well-established techniques used in medicine (filtered back-projection and ordered subset expectation-maximisation).",
    "citation_count": "5",
    "year": "2017/10/01",
    "authors": [
        {
            "name": "Zainab Ali Abbood",
            "country": ""
        },
        {
            "name": "Julien Lavauzelle",
            "country": ""
        },
        {
            "name": "Évelyne Lutton",
            "country": ""
        },
        {
            "name": "Jean-Marie Rocchisani",
            "country": ""
        },
        {
            "name": "Jean Louchet",
            "country": ""
        },
        {
            "name": "Franck P. Vidal",
            "country": ""
        }
    ],
    "keywords": []
}